747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
        0x0000061e:    4632        2F      MOV      r2,r6
        0x00000620:    b007        ..      ADD      sp,sp,#0x1c
        0x00000622:    bdf0        ..      POP      {r4-r7,pc}
    .text
    __aeabi_llsl
    _ll_shift_l
        0x00000624:    b510        ..      PUSH     {r4,lr}
        0x00000626:    2a20         *      CMP      r2,#0x20
        0x00000628:    db04        ..      BLT      0x634 ; __aeabi_llsl + 16
        0x0000062a:    4601        .F      MOV      r1,r0
        0x0000062c:    3a20         :      SUBS     r2,r2,#0x20
        0x0000062e:    4091        .@      LSLS     r1,r1,r2
        0x00000630:    2000        .       MOVS     r0,#0
        0x00000632:    bd10        ..      POP      {r4,pc}
        0x00000634:    4091        .@      LSLS     r1,r1,r2
        0x00000636:    2320         #      MOVS     r3,#0x20
        0x00000638:    1a9c        ..      SUBS     r4,r3,r2
        0x0000063a:    4603        .F      MOV      r3,r0
        0x0000063c:    40e3        .@      LSRS     r3,r3,r4
        0x0000063e:    4319        .C      ORRS     r1,r1,r3
        0x00000640:    4090        .@      LSLS     r0,r0,r2
        0x00000642:    bd10        ..      POP      {r4,pc}
    .text
    __aeabi_llsr
    _ll_ushift_r
        0x00000644:    b510        ..      PUSH     {r4,lr}
        0x00000646:    2a20         *      CMP      r2,#0x20
        0x00000648:    db04        ..      BLT      0x654 ; __aeabi_llsr + 16
        0x0000064a:    4608        .F      MOV      r0,r1
        0x0000064c:    3a20         :      SUBS     r2,r2,#0x20
        0x0000064e:    40d0        .@      LSRS     r0,r0,r2
        0x00000650:    2100        .!      MOVS     r1,#0
        0x00000652:    bd10        ..      POP      {r4,pc}
        0x00000654:    460b        .F      MOV      r3,r1
        0x00000656:    40d3        .@      LSRS     r3,r3,r2
        0x00000658:    40d0        .@      LSRS     r0,r0,r2
        0x0000065a:    2420         $      MOVS     r4,#0x20
        0x0000065c:    1aa2        ..      SUBS     r2,r4,r2
        0x0000065e:    4091        .@      LSLS     r1,r1,r2
        0x00000660:    4308        .C      ORRS     r0,r0,r1
        0x00000662:    4619        .F      MOV      r1,r3
        0x00000664:    bd10        ..      POP      {r4,pc}
    .text
    __aeabi_lasr
    _ll_sshift_r
        0x00000666:    b510        ..      PUSH     {r4,lr}
        0x00000668:    2a20         *      CMP      r2,#0x20
        0x0000066a:    db06        ..      BLT      0x67a ; __aeabi_lasr + 20
        0x0000066c:    17cb        ..      ASRS     r3,r1,#31
        0x0000066e:    4608        .F      MOV      r0,r1
        0x00000670:    3a20         :      SUBS     r2,r2,#0x20
        0x00000672:    4110        .A      ASRS     r0,r0,r2
        0x00000674:    17c1        ..      ASRS     r1,r0,#31
        0x00000676:    430b        .C      ORRS     r3,r3,r1
        0x00000678:    e006        ..      B        0x688 ; __aeabi_lasr + 34
        0x0000067a:    460b        .F      MOV      r3,r1
        0x0000067c:    4113        .A      ASRS     r3,r3,r2
        0x0000067e:    40d0        .@      LSRS     r0,r0,r2
        0x00000680:    2420         $      MOVS     r4,#0x20
        0x00000682:    1aa2        ..      SUBS     r2,r4,r2
        0x00000684:    4091        .@      LSLS     r1,r1,r2
        0x00000686:    4308        .C      ORRS     r0,r0,r1
        0x00000688:    4619        .F      MOV      r1,r3
        0x0000068a:    bd10        ..      POP      {r4,pc}
    .text
    .text
    __I$use$fp
    _double_round
        0x0000068c:    b510        ..      PUSH     {r4,lr}
        0x0000068e:    2b00        .+      CMP      r3,#0
        0x00000690:    da08        ..      BGE      0x6a4 ; __I$use$fp + 24
        0x00000692:    2400        .$      MOVS     r4,#0
        0x00000694:    1c40        @.      ADDS     r0,r0,#1
        0x00000696:    4161        aA      ADCS     r1,r1,r4
        0x00000698:    1892        ..      ADDS     r2,r2,r2
        0x0000069a:    415b        [A      ADCS     r3,r3,r3
        0x0000069c:    431a        .C      ORRS     r2,r2,r3
        0x0000069e:    d101        ..      BNE      0x6a4 ; __I$use$fp + 24
        0x000006a0:    0840        @.      LSRS     r0,r0,#1
        0x000006a2:    0040        @.      LSLS     r0,r0,#1
        0x000006a4:    bd10        ..      POP      {r4,pc}
    _double_epilogue
        0x000006a6:    b5f0        ..      PUSH     {r4-r7,lr}
        0x000006a8:    b41f        ..      PUSH     {r0-r4}
        0x000006aa:    b082        ..      SUB      sp,sp,#8
        0x000006ac:    4605        .F      MOV      r5,r0
        0x000006ae:    000c        ..      MOVS     r4,r1
        0x000006b0:    d003        ..      BEQ      0x6ba ; _double_epilogue + 20
        0x000006b2:    4608        .F      MOV      r0,r1
        0x000006b4:    f000ffac    ....    BL       __ARM_clz ; 0x1610
        0x000006b8:    e002        ..      B        0x6c0 ; _double_epilogue + 26
        0x000006ba:    f000ffa9    ....    BL       __ARM_clz ; 0x1610
        0x000006be:    3020         0      ADDS     r0,r0,#0x20
        0x000006c0:    4602        .F      MOV      r2,r0
        0x000006c2:    9000        ..      STR      r0,[sp,#0]
        0x000006c4:    4621        !F      MOV      r1,r4
        0x000006c6:    4628        (F      MOV      r0,r5
        0x000006c8:    f7ffffac    ....    BL       __aeabi_llsl ; 0x624
        0x000006cc:    9b04        ..      LDR      r3,[sp,#0x10]
        0x000006ce:    9a05        ..      LDR      r2,[sp,#0x14]
        0x000006d0:    4604        .F      MOV      r4,r0
        0x000006d2:    460f        .F      MOV      r7,r1
        0x000006d4:    4318        .C      ORRS     r0,r0,r3
        0x000006d6:    4311        .C      ORRS     r1,r1,r2
        0x000006d8:    4308        .C      ORRS     r0,r0,r1
        0x000006da:    d103        ..      BNE      0x6e4 ; _double_epilogue + 62
        0x000006dc:    4620         F      MOV      r0,r4
        0x000006de:    4639        9F      MOV      r1,r7
        0x000006e0:    b007        ..      ADD      sp,sp,#0x1c
        0x000006e2:    bdf0        ..      POP      {r4-r7,pc}
        0x000006e4:    4618        .F      MOV      r0,r3
        0x000006e6:    4310        .C      ORRS     r0,r0,r2
        0x000006e8:    d017        ..      BEQ      0x71a ; _double_epilogue + 116
        0x000006ea:    9800        ..      LDR      r0,[sp,#0]
        0x000006ec:    2140        @!      MOVS     r1,#0x40
        0x000006ee:    1a0a        ..      SUBS     r2,r1,r0
        0x000006f0:    4618        .F      MOV      r0,r3
        0x000006f2:    9905        ..      LDR      r1,[sp,#0x14]
        0x000006f4:    f7ffffa6    ....    BL       __aeabi_llsr ; 0x644
        0x000006f8:    4605        .F      MOV      r5,r0
        0x000006fa:    460e        .F      MOV      r6,r1
        0x000006fc:    9a00        ..      LDR      r2,[sp,#0]
        0x000006fe:    9905        ..      LDR      r1,[sp,#0x14]
        0x00000700:    9804        ..      LDR      r0,[sp,#0x10]
        0x00000702:    f7ffff8f    ....    BL       __aeabi_llsl ; 0x624
        0x00000706:    4308        .C      ORRS     r0,r0,r1
        0x00000708:    d001        ..      BEQ      0x70e ; _double_epilogue + 104
        0x0000070a:    2001        .       MOVS     r0,#1
        0x0000070c:    e000        ..      B        0x710 ; _double_epilogue + 106
        0x0000070e:    2000        .       MOVS     r0,#0
        0x00000710:    17c1        ..      ASRS     r1,r0,#31
        0x00000712:    4305        .C      ORRS     r5,r5,r0
        0x00000714:    430e        .C      ORRS     r6,r6,r1
        0x00000716:    432c        ,C      ORRS     r4,r4,r5
        0x00000718:    4337        7C      ORRS     r7,r7,r6
        0x0000071a:    9900        ..      LDR      r1,[sp,#0]
        0x0000071c:    980e        ..      LDR      r0,[sp,#0x38]
        0x0000071e:    0563        c.      LSLS     r3,r4,#21
        0x00000720:    1a40        @.      SUBS     r0,r0,r1
        0x00000722:    0579        y.      LSLS     r1,r7,#21
        0x00000724:    0ae4        ..      LSRS     r4,r4,#11
        0x00000726:    300a        .0      ADDS     r0,r0,#0xa
        0x00000728:    2200        ."      MOVS     r2,#0
        0x0000072a:    430c        .C      ORRS     r4,r4,r1
        0x0000072c:    0afd        ..      LSRS     r5,r7,#11
        0x0000072e:    2800        .(      CMP      r0,#0
        0x00000730:    da02        ..      BGE      0x738 ; _double_epilogue + 146
        0x00000732:    2000        .       MOVS     r0,#0
        0x00000734:    4601        .F      MOV      r1,r0
        0x00000736:    e7d3        ..      B        0x6e0 ; _double_epilogue + 58
        0x00000738:    0501        ..      LSLS     r1,r0,#20
        0x0000073a:    1910        ..      ADDS     r0,r2,r4
        0x0000073c:    4169        iA      ADCS     r1,r1,r5
        0x0000073e:    9c0c        ..      LDR      r4,[sp,#0x30]
        0x00000740:    9d0d        ..      LDR      r5,[sp,#0x34]
        0x00000742:    1900        ..      ADDS     r0,r0,r4
        0x00000744:    4169        iA      ADCS     r1,r1,r5
        0x00000746:    f7ffffa1    ....    BL       __I$use$fp ; 0x68c
        0x0000074a:    e7c9        ..      B        0x6e0 ; _double_epilogue + 58
    .text
    __aeabi_d2ulz
        0x0000074c:    004a        J.      LSLS     r2,r1,#1
        0x0000074e:    0309        ..      LSLS     r1,r1,#12
        0x00000750:    2301        .#      MOVS     r3,#1
        0x00000752:    0b09        ..      LSRS     r1,r1,#12
        0x00000754:    051b        ..      LSLS     r3,r3,#20
        0x00000756:    4319        .C      ORRS     r1,r1,r3
        0x00000758:    4b0a        .K      LDR      r3,[pc,#40] ; [0x784] = 0x3ff
        0x0000075a:    b510        ..      PUSH     {r4,lr}
        0x0000075c:    0d52        R.      LSRS     r2,r2,#21
        0x0000075e:    429a        .B      CMP      r2,r3
        0x00000760:    da02        ..      BGE      0x768 ; __aeabi_d2ulz + 28
        0x00000762:    2000        .       MOVS     r0,#0
        0x00000764:    4601        .F      MOV      r1,r0
        0x00000766:    bd10        ..      POP      {r4,pc}
        0x00000768:    4b06        .K      LDR      r3,[pc,#24] ; [0x784] = 0x3ff
        0x0000076a:    3334        43      ADDS     r3,r3,#0x34
        0x0000076c:    429a        .B      CMP      r2,r3
        0x0000076e:    dc03        ..      BGT      0x778 ; __aeabi_d2ulz + 44
        0x00000770:    1a9a        ..      SUBS     r2,r3,r2
        0x00000772:    f7ffff67    ..g.    BL       __aeabi_llsr ; 0x644
        0x00000776:    bd10        ..      POP      {r4,pc}
        0x00000778:    4b03        .K      LDR      r3,[pc,#12] ; [0x788] = 0xfffffbcd
        0x0000077a:    18d2        ..      ADDS     r2,r2,r3
        0x0000077c:    f7ffff52    ..R.    BL       __aeabi_llsl ; 0x624
        0x00000780:    bd10        ..      POP      {r4,pc}
    $d
        0x00000782:    0000        ..      DCW    0
        0x00000784:    000003ff    ....    DCD    1023
        0x00000788:    fffffbcd    ....    DCD    4294966221
    $t
    .text
    __scatterload
    __scatterload_rt2
        0x0000078c:    4c06        .L      LDR      r4,[pc,#24] ; [0x7a8] = 0x2a38
        0x0000078e:    2501        .%      MOVS     r5,#1
        0x00000790:    4e06        .N      LDR      r6,[pc,#24] ; [0x7ac] = 0x2a68
        0x00000792:    e005        ..      B        0x7a0 ; __scatterload + 20
        0x00000794:    4620         F      MOV      r0,r4
        0x00000796:    68e3        .h      LDR      r3,[r4,#0xc]
        0x00000798:    c807        ..      LDM      r0,{r0-r2}
        0x0000079a:    432b        +C      ORRS     r3,r3,r5
        0x0000079c:    4798        .G      BLX      r3
        0x0000079e:    3410        .4      ADDS     r4,r4,#0x10
        0x000007a0:    42b4        .B      CMP      r4,r6
        0x000007a2:    d3f7        ..      BCC      0x794 ; __scatterload + 8
        0x000007a4:    f7fffcc0    ....    BL       __main_after_scatterload ; 0x128
    $d
        0x000007a8:    00002a38    8*..    DCD    10808
        0x000007ac:    00002a68    h*..    DCD    10856
    $t
    .text
    __decompress
    __decompress1
        0x000007b0:    b570        p.      PUSH     {r4-r6,lr}
        0x000007b2:    188c        ..      ADDS     r4,r1,r2
        0x000007b4:    7805        .x      LDRB     r5,[r0,#0]
        0x000007b6:    1c40        @.      ADDS     r0,r0,#1
        0x000007b8:    076b        k.      LSLS     r3,r5,#29
        0x000007ba:    0f5b        [.      LSRS     r3,r3,#29
        0x000007bc:    d101        ..      BNE      0x7c2 ; __decompress + 18
        0x000007be:    7803        .x      LDRB     r3,[r0,#0]
        0x000007c0:    1c40        @.      ADDS     r0,r0,#1
        0x000007c2:    112a        *.      ASRS     r2,r5,#4
        0x000007c4:    d106        ..      BNE      0x7d4 ; __decompress + 36
        0x000007c6:    7802        .x      LDRB     r2,[r0,#0]
        0x000007c8:    1c40        @.      ADDS     r0,r0,#1
        0x000007ca:    e003        ..      B        0x7d4 ; __decompress + 36
        0x000007cc:    7806        .x      LDRB     r6,[r0,#0]
        0x000007ce:    1c40        @.      ADDS     r0,r0,#1
        0x000007d0:    700e        .p      STRB     r6,[r1,#0]
        0x000007d2:    1c49        I.      ADDS     r1,r1,#1
        0x000007d4:    1e5b        [.      SUBS     r3,r3,#1
        0x000007d6:    d1f9        ..      BNE      0x7cc ; __decompress + 28
        0x000007d8:    072b        +.      LSLS     r3,r5,#28
        0x000007da:    d405        ..      BMI      0x7e8 ; __decompress + 56
        0x000007dc:    2300        .#      MOVS     r3,#0
        0x000007de:    1e52        R.      SUBS     r2,r2,#1
        0x000007e0:    d40d        ..      BMI      0x7fe ; __decompress + 78
        0x000007e2:    700b        .p      STRB     r3,[r1,#0]
        0x000007e4:    1c49        I.      ADDS     r1,r1,#1
        0x000007e6:    e7fa        ..      B        0x7de ; __decompress + 46
        0x000007e8:    7803        .x      LDRB     r3,[r0,#0]
        0x000007ea:    1c40        @.      ADDS     r0,r0,#1
        0x000007ec:    1acb        ..      SUBS     r3,r1,r3
        0x000007ee:    1c92        ..      ADDS     r2,r2,#2
        0x000007f0:    e003        ..      B        0x7fa ; __decompress + 74
        0x000007f2:    781d        .x      LDRB     r5,[r3,#0]
        0x000007f4:    1c5b        [.      ADDS     r3,r3,#1
        0x000007f6:    700d        .p      STRB     r5,[r1,#0]
        0x000007f8:    1c49        I.      ADDS     r1,r1,#1
        0x000007fa:    1e52        R.      SUBS     r2,r2,#1
        0x000007fc:    d5f9        ..      BPL      0x7f2 ; __decompress + 66
        0x000007fe:    42a1        .B      CMP      r1,r4
        0x00000800:    d3d8        ..      BCC      0x7b4 ; __decompress + 4
        0x00000802:    2000        .       MOVS     r0,#0
        0x00000804:    bd70        p.      POP      {r4-r6,pc}
        0x00000806:    0000        ..      MOVS     r0,r0
    $Ven$TT$L$$foc_svm_gen
        0x00000808:    b403        ..      PUSH     {r0,r1}
        0x0000080a:    4801        .H      LDR      r0,[pc,#4] ; [0x810] = 0x20000021
        0x0000080c:    9001        ..      STR      r0,[sp,#4]
        0x0000080e:    bd01        ..      POP      {r0,pc}
    $d
        0x00000810:    20000021    !..     DCD    536870945
    $t
    $Ven$TT$L$$pi_controller
        0x00000814:    b403        ..      PUSH     {r0,r1}
        0x00000816:    4801        .H      LDR      r0,[pc,#4] ; [0x81c] = 0x20000bc5
        0x00000818:    9001        ..      STR      r0,[sp,#4]
        0x0000081a:    bd01        ..      POP      {r0,pc}
    $d
        0x0000081c:    20000bc5    ...     DCD    536873925
    $t
    i.ACMP_Handler
    ACMP_Handler
        0x00000820:    4804        .H      LDR      r0,[pc,#16] ; [0x834] = 0x400aa080
        0x00000822:    6841        Ah      LDR      r1,[r0,#4]
        0x00000824:    0509        ..      LSLS     r1,r1,#20
        0x00000826:    2900        .)      CMP      r1,#0
        0x00000828:    da02        ..      BGE      0x830 ; ACMP_Handler + 16
        0x0000082a:    2101        .!      MOVS     r1,#1
        0x0000082c:    02c9        ..      LSLS     r1,r1,#11
        0x0000082e:    6041        A`      STR      r1,[r0,#4]
        0x00000830:    4770        pG      BX       lr
    $d
        0x00000832:    0000        ..      DCW    0
        0x00000834:    400aa080    ...@    DCD    1074438272
    $t
    i.ADC_Close
    ADC_Close
        0x00000838:    6801        .h      LDR      r1,[r0,#0]
        0x0000083a:    2201        ."      MOVS     r2,#1
        0x0000083c:    0312        ..      LSLS     r2,r2,#12
        0x0000083e:    4391        .C      BICS     r1,r1,r2
        0x00000840:    6001        .`      STR      r1,[r0,#0]
        0x00000842:    4770        pG      BX       lr
    i.ADC_Init
    ADC_Init
        0x00000844:    b5f8        ..      PUSH     {r3-r7,lr}
        0x00000846:    4603        .F      MOV      r3,r0
        0x00000848:    460d        .F      MOV      r5,r1
        0x0000084a:    4eae        .N      LDR      r6,[pc,#696] ; [0xb04] = 0x40000080
        0x0000084c:    6830        0h      LDR      r0,[r6,#0]
        0x0000084e:    4fae        .O      LDR      r7,[pc,#696] ; [0xb08] = 0x2000114c
        0x00000850:    0e00        ..      LSRS     r0,r0,#24
        0x00000852:    28d3        .(      CMP      r0,#0xd3
        0x00000854:    d101        ..      BNE      0x85a ; ADC_Init + 22
        0x00000856:    2001        .       MOVS     r0,#1
        0x00000858:    6038        8`      STR      r0,[r7,#0]
        0x0000085a:    6838        8h      LDR      r0,[r7,#0]
        0x0000085c:    2800        .(      CMP      r0,#0
        0x0000085e:    d007        ..      BEQ      0x870 ; ADC_Init + 44
        0x00000860:    78a8        .x      LDRB     r0,[r5,#2]
        0x00000862:    0641        A.      LSLS     r1,r0,#25
        0x00000864:    d504        ..      BPL      0x870 ; ADC_Init + 44
        0x00000866:    0680        ..      LSLS     r0,r0,#26
        0x00000868:    0e80        ..      LSRS     r0,r0,#26
        0x0000086a:    70a8        .p      STRB     r0,[r5,#2]
        0x0000086c:    2001        .       MOVS     r0,#1
        0x0000086e:    6078        x`      STR      r0,[r7,#4]
        0x00000870:    48a6        .H      LDR      r0,[pc,#664] ; [0xb0c] = 0xbffb7000
        0x00000872:    4ca7        .L      LDR      r4,[pc,#668] ; [0xb10] = 0x40000000
        0x00000874:    1818        ..      ADDS     r0,r3,r0
        0x00000876:    9000        ..      STR      r0,[sp,#0]
        0x00000878:    d103        ..      BNE      0x882 ; ADC_Init + 62
        0x0000087a:    68a0        .h      LDR      r0,[r4,#8]
        0x0000087c:    1121        !.      ASRS     r1,r4,#4
        0x0000087e:    4308        .C      ORRS     r0,r0,r1
        0x00000880:    60a0        .`      STR      r0,[r4,#8]
        0x00000882:    4618        .F      MOV      r0,r3
        0x00000884:    f7ffffd8    ....    BL       ADC_Close ; 0x838
        0x00000888:    6821        !h      LDR      r1,[r4,#0]
        0x0000088a:    200f        .       MOVS     r0,#0xf
        0x0000088c:    0400        ..      LSLS     r0,r0,#16
        0x0000088e:    4381        .C      BICS     r1,r1,r0
        0x00000890:    6021        !`      STR      r1,[r4,#0]
        0x00000892:    6820         h      LDR      r0,[r4,#0]
        0x00000894:    7829        )x      LDRB     r1,[r5,#0]
        0x00000896:    0709        ..      LSLS     r1,r1,#28
        0x00000898:    0b09        ..      LSRS     r1,r1,#12
        0x0000089a:    4308        .C      ORRS     r0,r0,r1
        0x0000089c:    6020         `      STR      r0,[r4,#0]
        0x0000089e:    461c        .F      MOV      r4,r3
        0x000008a0:    34ff        .4      ADDS     r4,r4,#0xff
        0x000008a2:    3481        .4      ADDS     r4,r4,#0x81
        0x000008a4:    6aa0        .j      LDR      r0,[r4,#0x28]
        0x000008a6:    2118        .!      MOVS     r1,#0x18
        0x000008a8:    4388        .C      BICS     r0,r0,r1
        0x000008aa:    62a0        .b      STR      r0,[r4,#0x28]
        0x000008ac:    6aa0        .j      LDR      r0,[r4,#0x28]
        0x000008ae:    7829        )x      LDRB     r1,[r5,#0]
        0x000008b0:    0689        ..      LSLS     r1,r1,#26
        0x000008b2:    0f89        ..      LSRS     r1,r1,#30
        0x000008b4:    00c9        ..      LSLS     r1,r1,#3
        0x000008b6:    4308        .C      ORRS     r0,r0,r1
        0x000008b8:    62a0        .b      STR      r0,[r4,#0x28]
        0x000008ba:    6a60        `j      LDR      r0,[r4,#0x24]
        0x000008bc:    217f        .!      MOVS     r1,#0x7f
        0x000008be:    0609        ..      LSLS     r1,r1,#24
        0x000008c0:    4388        .C      BICS     r0,r0,r1
        0x000008c2:    6260        `b      STR      r0,[r4,#0x24]
        0x000008c4:    7828        (x      LDRB     r0,[r5,#0]
        0x000008c6:    7869        ix      LDRB     r1,[r5,#1]
        0x000008c8:    0980        ..      LSRS     r0,r0,#6
        0x000008ca:    0740        @.      LSLS     r0,r0,#29
        0x000008cc:    0609        ..      LSLS     r1,r1,#24
        0x000008ce:    4308        .C      ORRS     r0,r0,r1
        0x000008d0:    6a61        aj      LDR      r1,[r4,#0x24]
        0x000008d2:    4308        .C      ORRS     r0,r0,r1
        0x000008d4:    6260        `b      STR      r0,[r4,#0x24]
        0x000008d6:    6a60        `j      LDR      r0,[r4,#0x24]
        0x000008d8:    498e        .I      LDR      r1,[pc,#568] ; [0xb14] = 0xfffff8f9
        0x000008da:    4008        .@      ANDS     r0,r0,r1
        0x000008dc:    6260        `b      STR      r0,[r4,#0x24]
        0x000008de:    6a60        `j      LDR      r0,[r4,#0x24]
        0x000008e0:    78a9        .x      LDRB     r1,[r5,#2]
        0x000008e2:    0909        ..      LSRS     r1,r1,#4
        0x000008e4:    0049        I.      LSLS     r1,r1,#1
        0x000008e6:    4308        .C      ORRS     r0,r0,r1
        0x000008e8:    6260        `b      STR      r0,[r4,#0x24]
        0x000008ea:    78a8        .x      LDRB     r0,[r5,#2]
        0x000008ec:    0901        ..      LSRS     r1,r0,#4
        0x000008ee:    4620         F      MOV      r0,r4
        0x000008f0:    3040        @0      ADDS     r0,r0,#0x40
        0x000008f2:    2900        .)      CMP      r1,#0
        0x000008f4:    d00e        ..      BEQ      0x914 ; ADC_Init + 208
        0x000008f6:    6839        9h      LDR      r1,[r7,#0]
        0x000008f8:    2900        .)      CMP      r1,#0
        0x000008fa:    d02a        *.      BEQ      0x952 ; ADC_Init + 270
        0x000008fc:    6878        xh      LDR      r0,[r7,#4]
        0x000008fe:    2800        .(      CMP      r0,#0
        0x00000900:    d020         .      BEQ      0x944 ; ADC_Init + 256
        0x00000902:    6830        0h      LDR      r0,[r6,#0]
        0x00000904:    0500        ..      LSLS     r0,r0,#20
        0x00000906:    0d00        ..      LSRS     r0,r0,#20
        0x00000908:    6138        8a      STR      r0,[r7,#0x10]
        0x0000090a:    6830        0h      LDR      r0,[r6,#0]
        0x0000090c:    0200        ..      LSLS     r0,r0,#8
        0x0000090e:    0d00        ..      LSRS     r0,r0,#20
        0x00000910:    60f8        .`      STR      r0,[r7,#0xc]
        0x00000912:    e022        ".      B        0x95a ; ADC_Init + 278
        0x00000914:    2101        .!      MOVS     r1,#1
        0x00000916:    60b9        .`      STR      r1,[r7,#8]
        0x00000918:    69b1        .i      LDR      r1,[r6,#0x18]
