747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
        0x0000091a:    0309        ..      LSLS     r1,r1,#12
        0x0000091c:    0c0a        ..      LSRS     r2,r1,#16
        0x0000091e:    613a        :a      STR      r2,[r7,#0x10]
        0x00000920:    69b1        .i      LDR      r1,[r6,#0x18]
        0x00000922:    0d09        ..      LSRS     r1,r1,#20
        0x00000924:    60f9        .`      STR      r1,[r7,#0xc]
        0x00000926:    683e        >h      LDR      r6,[r7,#0]
        0x00000928:    2e00        ..      CMP      r6,#0
        0x0000092a:    d104        ..      BNE      0x936 ; ADC_Init + 242
        0x0000092c:    0409        ..      LSLS     r1,r1,#16
        0x0000092e:    4311        .C      ORRS     r1,r1,r2
        0x00000930:    6341        Ac      STR      r1,[r0,#0x34]
        0x00000932:    2103        .!      MOVS     r1,#3
        0x00000934:    6381        .c      STR      r1,[r0,#0x38]
        0x00000936:    6a60        `j      LDR      r0,[r4,#0x24]
        0x00000938:    78a9        .x      LDRB     r1,[r5,#2]
        0x0000093a:    0709        ..      LSLS     r1,r1,#28
        0x0000093c:    0d09        ..      LSRS     r1,r1,#20
        0x0000093e:    4308        .C      ORRS     r0,r0,r1
        0x00000940:    6260        `b      STR      r0,[r4,#0x24]
        0x00000942:    e014        ..      B        0x96e ; ADC_Init + 298
        0x00000944:    6970        pi      LDR      r0,[r6,#0x14]
        0x00000946:    b280        ..      UXTH     r0,r0
        0x00000948:    6138        8a      STR      r0,[r7,#0x10]
        0x0000094a:    6970        pi      LDR      r0,[r6,#0x14]
        0x0000094c:    0c00        ..      LSRS     r0,r0,#16
        0x0000094e:    60f8        .`      STR      r0,[r7,#0xc]
        0x00000950:    e003        ..      B        0x95a ; ADC_Init + 278
        0x00000952:    6971        qi      LDR      r1,[r6,#0x14]
        0x00000954:    6341        Ac      STR      r1,[r0,#0x34]
        0x00000956:    2103        .!      MOVS     r1,#3
        0x00000958:    6381        .c      STR      r1,[r0,#0x38]
        0x0000095a:    6a20         j      LDR      r0,[r4,#0x20]
        0x0000095c:    2101        .!      MOVS     r1,#1
        0x0000095e:    0709        ..      LSLS     r1,r1,#28
        0x00000960:    4388        .C      BICS     r0,r0,r1
        0x00000962:    6220         b      STR      r0,[r4,#0x20]
        0x00000964:    6a20         j      LDR      r0,[r4,#0x20]
        0x00000966:    78a9        .x      LDRB     r1,[r5,#2]
        0x00000968:    0709        ..      LSLS     r1,r1,#28
        0x0000096a:    4308        .C      ORRS     r0,r0,r1
        0x0000096c:    6220         b      STR      r0,[r4,#0x20]
        0x0000096e:    8929        ).      LDRH     r1,[r5,#8]
        0x00000970:    4618        .F      MOV      r0,r3
        0x00000972:    04ca        ..      LSLS     r2,r1,#19
        0x00000974:    30c0        .0      ADDS     r0,r0,#0xc0
        0x00000976:    2a00        .*      CMP      r2,#0
        0x00000978:    da16        ..      BGE      0x9a8 ; ADC_Init + 356
        0x0000097a:    0b0a        ..      LSRS     r2,r1,#12
        0x0000097c:    0509        ..      LSLS     r1,r1,#20
        0x0000097e:    0d09        ..      LSRS     r1,r1,#20
        0x00000980:    43c9        .C      MVNS     r1,r1
        0x00000982:    6321        !c      STR      r1,[r4,#0x30]
        0x00000984:    6901        .i      LDR      r1,[r0,#0x10]
        0x00000986:    4e64        dN      LDR      r6,[pc,#400] ; [0xb18] = 0xf000ffff
        0x00000988:    4031        1@      ANDS     r1,r1,r6
        0x0000098a:    6101        .a      STR      r1,[r0,#0x10]
        0x0000098c:    6901        .i      LDR      r1,[r0,#0x10]
        0x0000098e:    88ae        ..      LDRH     r6,[r5,#4]
        0x00000990:    0436        6.      LSLS     r6,r6,#16
        0x00000992:    4331        1C      ORRS     r1,r1,r6
        0x00000994:    6101        .a      STR      r1,[r0,#0x10]
        0x00000996:    6901        .i      LDR      r1,[r0,#0x10]
        0x00000998:    0b09        ..      LSRS     r1,r1,#12
        0x0000099a:    0309        ..      LSLS     r1,r1,#12
        0x0000099c:    6101        .a      STR      r1,[r0,#0x10]
        0x0000099e:    6901        .i      LDR      r1,[r0,#0x10]
        0x000009a0:    88ae        ..      LDRH     r6,[r5,#4]
        0x000009a2:    4331        1C      ORRS     r1,r1,r6
        0x000009a4:    6101        .a      STR      r1,[r0,#0x10]
        0x000009a6:    e008        ..      B        0x9ba ; ADC_Init + 374
        0x000009a8:    b2ca        ..      UXTB     r2,r1
        0x000009aa:    6901        .i      LDR      r1,[r0,#0x10]
        0x000009ac:    0b09        ..      LSRS     r1,r1,#12
        0x000009ae:    0309        ..      LSLS     r1,r1,#12
        0x000009b0:    6101        .a      STR      r1,[r0,#0x10]
        0x000009b2:    6901        .i      LDR      r1,[r0,#0x10]
        0x000009b4:    88ae        ..      LDRH     r6,[r5,#4]
        0x000009b6:    4331        1C      ORRS     r1,r1,r6
        0x000009b8:    6101        .a      STR      r1,[r0,#0x10]
        0x000009ba:    6818        .h      LDR      r0,[r3,#0]
        0x000009bc:    4957        WI      LDR      r1,[pc,#348] ; [0xb1c] = 0xfe1e1fff
        0x000009be:    4008        .@      ANDS     r0,r0,r1
        0x000009c0:    6018        .`      STR      r0,[r3,#0]
        0x000009c2:    6818        .h      LDR      r0,[r3,#0]
        0x000009c4:    79a9        .y      LDRB     r1,[r5,#6]
        0x000009c6:    0549        I.      LSLS     r1,r1,#21
        0x000009c8:    4308        .C      ORRS     r0,r0,r1
        0x000009ca:    0391        ..      LSLS     r1,r2,#14
        0x000009cc:    7aaa        .z      LDRB     r2,[r5,#0xa]
        0x000009ce:    0352        R.      LSLS     r2,r2,#13
        0x000009d0:    4311        .C      ORRS     r1,r1,r2
        0x000009d2:    4308        .C      ORRS     r0,r0,r1
        0x000009d4:    6018        .`      STR      r0,[r3,#0]
        0x000009d6:    6a20         j      LDR      r0,[r4,#0x20]
        0x000009d8:    4951        QI      LDR      r1,[pc,#324] ; [0xb20] = 0xfff000ff
        0x000009da:    4008        .@      ANDS     r0,r0,r1
        0x000009dc:    6220         b      STR      r0,[r4,#0x20]
        0x000009de:    6a20         j      LDR      r0,[r4,#0x20]
        0x000009e0:    210f        .!      MOVS     r1,#0xf
        0x000009e2:    0409        ..      LSLS     r1,r1,#16
        0x000009e4:    4308        .C      ORRS     r0,r0,r1
        0x000009e6:    6220         b      STR      r0,[r4,#0x20]
        0x000009e8:    2000        .       MOVS     r0,#0
        0x000009ea:    6098        .`      STR      r0,[r3,#8]
        0x000009ec:    484d        MH      LDR      r0,[pc,#308] ; [0xb24] = 0x7ffff
        0x000009ee:    60d8        .`      STR      r0,[r3,#0xc]
        0x000009f0:    89a8        ..      LDRH     r0,[r5,#0xc]
        0x000009f2:    0782        ..      LSLS     r2,r0,#30
        0x000009f4:    07c1        ..      LSLS     r1,r0,#31
        0x000009f6:    0fd2        ..      LSRS     r2,r2,#31
        0x000009f8:    0fc9        ..      LSRS     r1,r1,#31
        0x000009fa:    0092        ..      LSLS     r2,r2,#2
        0x000009fc:    4311        .C      ORRS     r1,r1,r2
        0x000009fe:    0742        B.      LSLS     r2,r0,#29
        0x00000a00:    0fd2        ..      LSRS     r2,r2,#31
        0x00000a02:    0112        ..      LSLS     r2,r2,#4
        0x00000a04:    4311        .C      ORRS     r1,r1,r2
        0x00000a06:    0702        ..      LSLS     r2,r0,#28
        0x00000a08:    0fd2        ..      LSRS     r2,r2,#31
        0x00000a0a:    0192        ..      LSLS     r2,r2,#6
        0x00000a0c:    4311        .C      ORRS     r1,r1,r2
        0x00000a0e:    06c2        ..      LSLS     r2,r0,#27
        0x00000a10:    0fd2        ..      LSRS     r2,r2,#31
        0x00000a12:    0212        ..      LSLS     r2,r2,#8
        0x00000a14:    4311        .C      ORRS     r1,r1,r2
        0x00000a16:    0682        ..      LSLS     r2,r0,#26
        0x00000a18:    0fd2        ..      LSRS     r2,r2,#31
        0x00000a1a:    0292        ..      LSLS     r2,r2,#10
        0x00000a1c:    4311        .C      ORRS     r1,r1,r2
        0x00000a1e:    0642        B.      LSLS     r2,r0,#25
        0x00000a20:    0fd2        ..      LSRS     r2,r2,#31
        0x00000a22:    0312        ..      LSLS     r2,r2,#12
        0x00000a24:    4311        .C      ORRS     r1,r1,r2
        0x00000a26:    0602        ..      LSLS     r2,r0,#24
        0x00000a28:    0fd2        ..      LSRS     r2,r2,#31
        0x00000a2a:    0392        ..      LSLS     r2,r2,#14
        0x00000a2c:    4311        .C      ORRS     r1,r1,r2
        0x00000a2e:    05c2        ..      LSLS     r2,r0,#23
        0x00000a30:    0fd2        ..      LSRS     r2,r2,#31
        0x00000a32:    0412        ..      LSLS     r2,r2,#16
        0x00000a34:    4311        .C      ORRS     r1,r1,r2
        0x00000a36:    0582        ..      LSLS     r2,r0,#22
        0x00000a38:    0fd2        ..      LSRS     r2,r2,#31
        0x00000a3a:    0492        ..      LSLS     r2,r2,#18
        0x00000a3c:    4311        .C      ORRS     r1,r1,r2
        0x00000a3e:    0542        B.      LSLS     r2,r0,#21
        0x00000a40:    0fd2        ..      LSRS     r2,r2,#31
        0x00000a42:    0512        ..      LSLS     r2,r2,#20
        0x00000a44:    0500        ..      LSLS     r0,r0,#20
        0x00000a46:    0fc0        ..      LSRS     r0,r0,#31
        0x00000a48:    4311        .C      ORRS     r1,r1,r2
        0x00000a4a:    0580        ..      LSLS     r0,r0,#22
        0x00000a4c:    4301        .C      ORRS     r1,r1,r0
        0x00000a4e:    6898        .h      LDR      r0,[r3,#8]
        0x00000a50:    4301        .C      ORRS     r1,r1,r0
        0x00000a52:    6099        .`      STR      r1,[r3,#8]
        0x00000a54:    89e8        ..      LDRH     r0,[r5,#0xe]
        0x00000a56:    0782        ..      LSLS     r2,r0,#30
        0x00000a58:    07c1        ..      LSLS     r1,r0,#31
        0x00000a5a:    0fd2        ..      LSRS     r2,r2,#31
        0x00000a5c:    0f89        ..      LSRS     r1,r1,#30
        0x00000a5e:    00d2        ..      LSLS     r2,r2,#3
        0x00000a60:    4311        .C      ORRS     r1,r1,r2
        0x00000a62:    0742        B.      LSLS     r2,r0,#29
        0x00000a64:    0fd2        ..      LSRS     r2,r2,#31
        0x00000a66:    0152        R.      LSLS     r2,r2,#5
        0x00000a68:    4311        .C      ORRS     r1,r1,r2
        0x00000a6a:    0702        ..      LSLS     r2,r0,#28
        0x00000a6c:    0fd2        ..      LSRS     r2,r2,#31
        0x00000a6e:    01d2        ..      LSLS     r2,r2,#7
        0x00000a70:    4311        .C      ORRS     r1,r1,r2
        0x00000a72:    06c2        ..      LSLS     r2,r0,#27
        0x00000a74:    0fd2        ..      LSRS     r2,r2,#31
        0x00000a76:    0252        R.      LSLS     r2,r2,#9
        0x00000a78:    4311        .C      ORRS     r1,r1,r2
        0x00000a7a:    0682        ..      LSLS     r2,r0,#26
        0x00000a7c:    0fd2        ..      LSRS     r2,r2,#31
        0x00000a7e:    02d2        ..      LSLS     r2,r2,#11
        0x00000a80:    4311        .C      ORRS     r1,r1,r2
        0x00000a82:    0642        B.      LSLS     r2,r0,#25
        0x00000a84:    0fd2        ..      LSRS     r2,r2,#31
        0x00000a86:    0352        R.      LSLS     r2,r2,#13
        0x00000a88:    4311        .C      ORRS     r1,r1,r2
        0x00000a8a:    0602        ..      LSLS     r2,r0,#24
        0x00000a8c:    0fd2        ..      LSRS     r2,r2,#31
        0x00000a8e:    03d2        ..      LSLS     r2,r2,#15
        0x00000a90:    4311        .C      ORRS     r1,r1,r2
        0x00000a92:    05c2        ..      LSLS     r2,r0,#23
        0x00000a94:    0fd2        ..      LSRS     r2,r2,#31
        0x00000a96:    0452        R.      LSLS     r2,r2,#17
        0x00000a98:    4311        .C      ORRS     r1,r1,r2
        0x00000a9a:    0582        ..      LSLS     r2,r0,#22
        0x00000a9c:    0fd2        ..      LSRS     r2,r2,#31
        0x00000a9e:    04d2        ..      LSLS     r2,r2,#19
        0x00000aa0:    4311        .C      ORRS     r1,r1,r2
        0x00000aa2:    0542        B.      LSLS     r2,r0,#21
        0x00000aa4:    0fd2        ..      LSRS     r2,r2,#31
        0x00000aa6:    0552        R.      LSLS     r2,r2,#21
        0x00000aa8:    0500        ..      LSLS     r0,r0,#20
        0x00000aaa:    0fc0        ..      LSRS     r0,r0,#31
        0x00000aac:    4311        .C      ORRS     r1,r1,r2
        0x00000aae:    05c0        ..      LSLS     r0,r0,#23
        0x00000ab0:    4301        .C      ORRS     r1,r1,r0
        0x00000ab2:    6898        .h      LDR      r0,[r3,#8]
        0x00000ab4:    4301        .C      ORRS     r1,r1,r0
        0x00000ab6:    6099        .`      STR      r1,[r3,#8]
        0x00000ab8:    683e        >h      LDR      r6,[r7,#0]
        0x00000aba:    2e00        ..      CMP      r6,#0
        0x00000abc:    d009        ..      BEQ      0xad2 ; ADC_Init + 654
        0x00000abe:    68f8        .h      LDR      r0,[r7,#0xc]
        0x00000ac0:    f7fffd1c    ....    BL       __aeabi_ui2d ; 0x4fc
        0x00000ac4:    4a18        .J      LDR      r2,[pc,#96] ; [0xb28] = 0xd2f1a9fc
        0x00000ac6:    4b19        .K      LDR      r3,[pc,#100] ; [0xb2c] = 0x3ff0624d
        0x00000ac8:    f7fffc0e    ....    BL       __aeabi_dmul ; 0x2e8
        0x00000acc:    f7fffd48    ..H.    BL       __aeabi_d2uiz ; 0x560
        0x00000ad0:    60f8        .`      STR      r0,[r7,#0xc]
        0x00000ad2:    2e00        ..      CMP      r6,#0
        0x00000ad4:    d00a        ..      BEQ      0xaec ; ADC_Init + 680
        0x00000ad6:    6878        xh      LDR      r0,[r7,#4]
        0x00000ad8:    2800        .(      CMP      r0,#0
        0x00000ada:    d007        ..      BEQ      0xaec ; ADC_Init + 680
        0x00000adc:    6a60        `j      LDR      r0,[r4,#0x24]
        0x00000ade:    490d        .I      LDR      r1,[pc,#52] ; [0xb14] = 0xfffff8f9
        0x00000ae0:    4008        .@      ANDS     r0,r0,r1
        0x00000ae2:    6260        `b      STR      r0,[r4,#0x24]
        0x00000ae4:    6a60        `j      LDR      r0,[r4,#0x24]
        0x00000ae6:    4912        .I      LDR      r1,[pc,#72] ; [0xb30] = 0x704
        0x00000ae8:    4308        .C      ORRS     r0,r0,r1
        0x00000aea:    6260        `b      STR      r0,[r4,#0x24]
        0x00000aec:    9800        ..      LDR      r0,[sp,#0]
        0x00000aee:    2800        .(      CMP      r0,#0
        0x00000af0:    d107        ..      BNE      0xb02 ; ADC_Init + 702
        0x00000af2:    89a8        ..      LDRH     r0,[r5,#0xc]
        0x00000af4:    89e9        ..      LDRH     r1,[r5,#0xe]
        0x00000af6:    4308        .C      ORRS     r0,r0,r1
        0x00000af8:    d003        ..      BEQ      0xb02 ; ADC_Init + 702
        0x00000afa:    2001        .       MOVS     r0,#1
        0x00000afc:    490d        .I      LDR      r1,[pc,#52] ; [0xb34] = 0xe000e100
        0x00000afe:    0380        ..      LSLS     r0,r0,#14
        0x00000b00:    6008        .`      STR      r0,[r1,#0]
        0x00000b02:    bdf8        ..      POP      {r3-r7,pc}
    $d
        0x00000b04:    40000080    ...@    DCD    1073741952
        0x00000b08:    2000114c    L..     DCD    536875340
        0x00000b0c:    bffb7000    .p..    DCD    3220926464
        0x00000b10:    40000000    ...@    DCD    1073741824
        0x00000b14:    fffff8f9    ....    DCD    4294965497
        0x00000b18:    f000ffff    ....    DCD    4026597375
        0x00000b1c:    fe1e1fff    ....    DCD    4263387135
        0x00000b20:    fff000ff    ....    DCD    4293918975
        0x00000b24:    0007ffff    ....    DCD    524287
        0x00000b28:    d2f1a9fc    ....    DCD    3539053052
        0x00000b2c:    3ff0624d    Mb.?    DCD    1072718413
        0x00000b30:    00000704    ....    DCD    1796
        0x00000b34:    e000e100    ....    DCD    3758153984
    $t
    i.ADC_IsEOC
    ADC_IsEOC
        0x00000b38:    b510        ..      PUSH     {r4,lr}
        0x00000b3a:    4604        .F      MOV      r4,r0
        0x00000b3c:    4608        .F      MOV      r0,r1
        0x00000b3e:    f001fad7    ....    BL       chn2idx ; 0x20f0
        0x00000b42:    0100        ..      LSLS     r0,r0,#4
        0x00000b44:    1900        ..      ADDS     r0,r0,r4
        0x00000b46:    6900        .i      LDR      r0,[r0,#0x10]
        0x00000b48:    07c0        ..      LSLS     r0,r0,#31
        0x00000b4a:    0fc0        ..      LSRS     r0,r0,#31
        0x00000b4c:    bd10        ..      POP      {r4,pc}
    i.ADC_Open
    ADC_Open
        0x00000b4e:    6801        .h      LDR      r1,[r0,#0]
        0x00000b50:    2201        ."      MOVS     r2,#1
        0x00000b52:    0312        ..      LSLS     r2,r2,#12
        0x00000b54:    4311        .C      ORRS     r1,r1,r2
        0x00000b56:    6001        .`      STR      r1,[r0,#0]
        0x00000b58:    4770        pG      BX       lr
    i.ADC_Start
    ADC_Start
        0x00000b5a:    2101        .!      MOVS     r1,#1
        0x00000b5c:    6041        A`      STR      r1,[r0,#4]
        0x00000b5e:    4770        pG      BX       lr
    i.BOD_Handler
    BOD_Handler
        0x00000b60:    4905        .I      LDR      r1,[pc,#20] ; [0xb78] = 0x400aa000
        0x00000b62:    2001        .       MOVS     r0,#1
        0x00000b64:    6148        Ha      STR      r0,[r1,#0x14]
        0x00000b66:    f3bf8f4f    ..O.    DSB      
        0x00000b6a:    4905        .I      LDR      r1,[pc,#20] ; [0xb80] = 0xe000ed00
        0x00000b6c:    4803        .H      LDR      r0,[pc,#12] ; [0xb7c] = 0x5fa0004
        0x00000b6e:    60c8        .`      STR      r0,[r1,#0xc]
        0x00000b70:    f3bf8f4f    ..O.    DSB      
        0x00000b74:    e7fe        ..      B        0xb74 ; BOD_Handler + 20
    $d
        0x00000b76:    0000        ..      DCW    0
        0x00000b78:    400aa000    ...@    DCD    1074438144
        0x00000b7c:    05fa0004    ....    DCD    100270084
        0x00000b80:    e000ed00    ....    DCD    3758157056
    $t
    i.BTIMR2_Handler
    BTIMR2_Handler
        0x00000b84:    4901        .I      LDR      r1,[pc,#4] ; [0xb8c] = 0x40048880
        0x00000b86:    2001        .       MOVS     r0,#1
        0x00000b88:    6148        Ha      STR      r0,[r1,#0x14]
        0x00000b8a:    4770        pG      BX       lr
    $d
        0x00000b8c:    40048880    ...@    DCD    1074038912
    $t
    i.CORDIC_Init
    CORDIC_Init
        0x00000b90:    4904        .I      LDR      r1,[pc,#16] ; [0xba4] = 0xbfffd000
        0x00000b92:    1840        @.      ADDS     r0,r0,r1
        0x00000b94:    d104        ..      BNE      0xba0 ; CORDIC_Init + 16
        0x00000b96:    0488        ..      LSLS     r0,r1,#18
        0x00000b98:    6881        .h      LDR      r1,[r0,#8]
        0x00000b9a:    1282        ..      ASRS     r2,r0,#10
        0x00000b9c:    4311        .C      ORRS     r1,r1,r2
        0x00000b9e:    6081        .`      STR      r1,[r0,#8]
        0x00000ba0:    4770        pG      BX       lr
    $d
        0x00000ba2:    0000        ..      DCW    0
        0x00000ba4:    bfffd000    ....    DCD    3221213184
    $t
    i.DIV_Init
    DIV_Init
        0x00000ba8:    4904        .I      LDR      r1,[pc,#16] ; [0xbbc] = 0xbfffc800
        0x00000baa:    1840        @.      ADDS     r0,r0,r1
        0x00000bac:    d104        ..      BNE      0xbb8 ; DIV_Init + 16
        0x00000bae:    04c8        ..      LSLS     r0,r1,#19
        0x00000bb0:    6881        .h      LDR      r1,[r0,#8]
        0x00000bb2:    1242        B.      ASRS     r2,r0,#9
        0x00000bb4:    4311        .C      ORRS     r1,r1,r2
        0x00000bb6:    6081        .`      STR      r1,[r0,#8]
        0x00000bb8:    4770        pG      BX       lr
    $d
        0x00000bba:    0000        ..      DCW    0
        0x00000bbc:    bfffc800    ....    DCD    3221211136
    $t
    i.DIV_SDiv_Result
    DIV_SDiv_Result
        0x00000bc0:    b410        ..      PUSH     {r4}
        0x00000bc2:    4b0a        .K      LDR      r3,[pc,#40] ; [0xbec] = 0x40003800
        0x00000bc4:    699a        .i      LDR      r2,[r3,#0x18]
        0x00000bc6:    0052        R.      LSLS     r2,r2,#1
        0x00000bc8:    0852        R.      LSRS     r2,r2,#1
        0x00000bca:    6002        .`      STR      r2,[r0,#0]
        0x00000bcc:    699c        .i      LDR      r4,[r3,#0x18]
        0x00000bce:    2c00        .,      CMP      r4,#0
        0x00000bd0:    da01        ..      BGE      0xbd6 ; DIV_SDiv_Result + 22
        0x00000bd2:    4252        RB      RSBS     r2,r2,#0
        0x00000bd4:    6002        .`      STR      r2,[r0,#0]
        0x00000bd6:    69d8        .i      LDR      r0,[r3,#0x1c]
        0x00000bd8:    0040        @.      LSLS     r0,r0,#1
        0x00000bda:    0840        @.      LSRS     r0,r0,#1
        0x00000bdc:    6008        .`      STR      r0,[r1,#0]
        0x00000bde:    69da        .i      LDR      r2,[r3,#0x1c]
        0x00000be0:    2a00        .*      CMP      r2,#0
        0x00000be2:    da01        ..      BGE      0xbe8 ; DIV_SDiv_Result + 40
        0x00000be4:    4240        @B      RSBS     r0,r0,#0
        0x00000be6:    6008        .`      STR      r0,[r1,#0]
        0x00000be8:    bc10        ..      POP      {r4}
        0x00000bea:    4770        pG      BX       lr
    $d
        0x00000bec:    40003800    .8.@    DCD    1073756160
    $t
    i.FLASH_Erase
    FLASH_Erase
        0x00000bf0:    b510        ..      PUSH     {r4,lr}
        0x00000bf2:    b672        r.      CPSID    i
        0x00000bf4:    0a80        ..      LSRS     r0,r0,#10
        0x00000bf6:    4a07        .J      LDR      r2,[pc,#28] ; [0xc14] = 0x20001160
        0x00000bf8:    4905        .I      LDR      r1,[pc,#20] ; [0xc10] = 0xb11ffac
        0x00000bfa:    6852        Rh      LDR      r2,[r2,#4]
        0x00000bfc:    4790        .G      BLX      r2
        0x00000bfe:    4806        .H      LDR      r0,[pc,#24] ; [0xc18] = 0x4004a000
        0x00000c00:    68c1        .h      LDR      r1,[r0,#0xc]
        0x00000c02:    2201        ."      MOVS     r2,#1
        0x00000c04:    0492        ..      LSLS     r2,r2,#18
        0x00000c06:    4311        .C      ORRS     r1,r1,r2
        0x00000c08:    60c1        .`      STR      r1,[r0,#0xc]
        0x00000c0a:    b662        b.      CPSIE    i
        0x00000c0c:    2000        .       MOVS     r0,#0
        0x00000c0e:    bd10        ..      POP      {r4,pc}
    $d
        0x00000c10:    0b11ffac    ....    DCD    185728940
        0x00000c14:    20001160    `..     DCD    536875360
        0x00000c18:    4004a000    ...@    DCD    1074044928
    $t
    i.FLASH_Write
    FLASH_Write
        0x00000c1c:    b510        ..      PUSH     {r4,lr}
        0x00000c1e:    b672        r.      CPSID    i
        0x00000c20:    0852        R.      LSRS     r2,r2,#1
        0x00000c22:    4b06        .K      LDR      r3,[pc,#24] ; [0xc3c] = 0x20001160
        0x00000c24:    689b        .h      LDR      r3,[r3,#8]
        0x00000c26:    4798        .G      BLX      r3
        0x00000c28:    4805        .H      LDR      r0,[pc,#20] ; [0xc40] = 0x4004a000
        0x00000c2a:    68c1        .h      LDR      r1,[r0,#0xc]
        0x00000c2c:    2201        ."      MOVS     r2,#1
        0x00000c2e:    0492        ..      LSLS     r2,r2,#18
        0x00000c30:    4311        .C      ORRS     r1,r1,r2
        0x00000c32:    60c1        .`      STR      r1,[r0,#0xc]
        0x00000c34:    b662        b.      CPSIE    i
