747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
        0x00000c36:    2000        .       MOVS     r0,#0
        0x00000c38:    bd10        ..      POP      {r4,pc}
    $d
        0x00000c3a:    0000        ..      DCW    0
        0x00000c3c:    20001160    `..     DCD    536875360
        0x00000c40:    4004a000    ...@    DCD    1074044928
    $t
    i.Flash_Param_at_xMHz
    Flash_Param_at_xMHz
        0x00000c44:    b510        ..      PUSH     {r4,lr}
        0x00000c46:    b672        r.      CPSID    i
        0x00000c48:    4b08        .K      LDR      r3,[pc,#32] ; [0xc6c] = 0x89241
        0x00000c4a:    4a0a        .J      LDR      r2,[pc,#40] ; [0xc74] = 0x20001160
        0x00000c4c:    4908        .I      LDR      r1,[pc,#32] ; [0xc70] = 0xb11ffac
        0x00000c4e:    6812        .h      LDR      r2,[r2,#0]
        0x00000c50:    2821        !(      CMP      r0,#0x21
        0x00000c52:    d202        ..      BCS      0xc5a ; Flash_Param_at_xMHz + 22
        0x00000c54:    4618        .F      MOV      r0,r3
        0x00000c56:    4790        .G      BLX      r2
        0x00000c58:    e006        ..      B        0xc68 ; Flash_Param_at_xMHz + 36
        0x00000c5a:    2842        B(      CMP      r0,#0x42
        0x00000c5c:    d202        ..      BCS      0xc64 ; Flash_Param_at_xMHz + 32
        0x00000c5e:    4618        .F      MOV      r0,r3
        0x00000c60:    4790        .G      BLX      r2
        0x00000c62:    e001        ..      B        0xc68 ; Flash_Param_at_xMHz + 36
        0x00000c64:    4804        .H      LDR      r0,[pc,#16] ; [0xc78] = 0x8a241
        0x00000c66:    4790        .G      BLX      r2
        0x00000c68:    b662        b.      CPSIE    i
        0x00000c6a:    bd10        ..      POP      {r4,pc}
    $d
        0x00000c6c:    00089241    A...    DCD    561729
        0x00000c70:    0b11ffac    ....    DCD    185728940
        0x00000c74:    20001160    `..     DCD    536875360
        0x00000c78:    0008a241    A...    DCD    565825
    $t
    i.Flash_ReadDate
    Flash_ReadDate
        0x00000c7c:    b430        0.      PUSH     {r4,r5}
        0x00000c7e:    2300        .#      MOVS     r3,#0
        0x00000c80:    2a00        .*      CMP      r2,#0
        0x00000c82:    d905        ..      BLS      0xc90 ; Flash_ReadDate + 20
        0x00000c84:    009c        ..      LSLS     r4,r3,#2
        0x00000c86:    5905        .Y      LDR      r5,[r0,r4]
        0x00000c88:    510d        .Q      STR      r5,[r1,r4]
        0x00000c8a:    1c5b        [.      ADDS     r3,r3,#1
        0x00000c8c:    4293        .B      CMP      r3,r2
        0x00000c8e:    d3f9        ..      BCC      0xc84 ; Flash_ReadDate + 8
        0x00000c90:    bc30        0.      POP      {r4,r5}
        0x00000c92:    4770        pG      BX       lr
    i.Flash_WriteData
    Flash_WriteData
        0x00000c94:    b510        ..      PUSH     {r4,lr}
        0x00000c96:    b672        r.      CPSID    i
        0x00000c98:    f7ffffc0    ....    BL       FLASH_Write ; 0xc1c
        0x00000c9c:    b662        b.      CPSIE    i
        0x00000c9e:    bd10        ..      POP      {r4,pc}
    i.GPIO_Init
    GPIO_Init
        0x00000ca0:    b5ff        ..      PUSH     {r0-r7,lr}
        0x00000ca2:    b081        ..      SUB      sp,sp,#4
        0x00000ca4:    9f0b        ..      LDR      r7,[sp,#0x2c]
        0x00000ca6:    9e0a        ..      LDR      r6,[sp,#0x28]
        0x00000ca8:    4605        .F      MOV      r5,r0
        0x00000caa:    4c2f        /L      LDR      r4,[pc,#188] ; [0xd68] = 0x400a0000
        0x00000cac:    482f        /H      LDR      r0,[pc,#188] ; [0xd6c] = 0xbfffc000
        0x00000cae:    0361        a.      LSLS     r1,r4,#13
        0x00000cb0:    1828        (.      ADDS     r0,r5,r0
        0x00000cb2:    2201        ."      MOVS     r2,#1
        0x00000cb4:    2800        .(      CMP      r0,#0
        0x00000cb6:    d011        ..      BEQ      0xcdc ; GPIO_Init + 60
        0x00000cb8:    14cb        ..      ASRS     r3,r1,#19
        0x00000cba:    1ac0        ..      SUBS     r0,r0,r3
        0x00000cbc:    d004        ..      BEQ      0xcc8 ; GPIO_Init + 40
        0x00000cbe:    220f        ."      MOVS     r2,#0xf
        0x00000cc0:    0392        ..      LSLS     r2,r2,#14
        0x00000cc2:    1a80        ..      SUBS     r0,r0,r2
        0x00000cc4:    d10f        ..      BNE      0xce6 ; GPIO_Init + 70
        0x00000cc6:    e003        ..      B        0xcd0 ; GPIO_Init + 48
        0x00000cc8:    6888        .h      LDR      r0,[r1,#8]
        0x00000cca:    4310        .C      ORRS     r0,r0,r2
        0x00000ccc:    6088        .`      STR      r0,[r1,#8]
        0x00000cce:    e00a        ..      B        0xce6 ; GPIO_Init + 70
        0x00000cd0:    6888        .h      LDR      r0,[r1,#8]
        0x00000cd2:    2202        ."      MOVS     r2,#2
        0x00000cd4:    4310        .C      ORRS     r0,r0,r2
        0x00000cd6:    6088        .`      STR      r0,[r1,#8]
        0x00000cd8:    4c25        %L      LDR      r4,[pc,#148] ; [0xd70] = 0x400a0010
        0x00000cda:    e004        ..      B        0xce6 ; GPIO_Init + 70
        0x00000cdc:    6888        .h      LDR      r0,[r1,#8]
        0x00000cde:    2210        ."      MOVS     r2,#0x10
        0x00000ce0:    4310        .C      ORRS     r0,r0,r2
        0x00000ce2:    6088        .`      STR      r0,[r1,#8]
        0x00000ce4:    4c23        #L      LDR      r4,[pc,#140] ; [0xd74] = 0x400a0080
        0x00000ce6:    2301        .#      MOVS     r3,#1
        0x00000ce8:    2200        ."      MOVS     r2,#0
        0x00000cea:    4620         F      MOV      r0,r4
        0x00000cec:    9902        ..      LDR      r1,[sp,#8]
        0x00000cee:    f000f9f3    ....    BL       PORT_Init ; 0x10d8
        0x00000cf2:    9a02        ..      LDR      r2,[sp,#8]
        0x00000cf4:    2001        .       MOVS     r0,#1
        0x00000cf6:    9903        ..      LDR      r1,[sp,#0xc]
        0x00000cf8:    4090        .@      LSLS     r0,r0,r2
        0x00000cfa:    2901        .)      CMP      r1,#1
        0x00000cfc:    d01c        ..      BEQ      0xd38 ; GPIO_Init + 152
        0x00000cfe:    6869        ih      LDR      r1,[r5,#4]
        0x00000d00:    4381        .C      BICS     r1,r1,r0
        0x00000d02:    6069        i`      STR      r1,[r5,#4]
        0x00000d04:    9904        ..      LDR      r1,[sp,#0x10]
        0x00000d06:    2901        .)      CMP      r1,#1
        0x00000d08:    d01a        ..      BEQ      0xd40 ; GPIO_Init + 160
        0x00000d0a:    1de1        ..      ADDS     r1,r4,#7
        0x00000d0c:    31f9        .1      ADDS     r1,r1,#0xf9
        0x00000d0e:    680a        .h      LDR      r2,[r1,#0]
        0x00000d10:    4382        .C      BICS     r2,r2,r0
        0x00000d12:    600a        .`      STR      r2,[r1,#0]
        0x00000d14:    2e01        ..      CMP      r6,#1
        0x00000d16:    d019        ..      BEQ      0xd4c ; GPIO_Init + 172
        0x00000d18:    1de1        ..      ADDS     r1,r4,#7
        0x00000d1a:    31ff        .1      ADDS     r1,r1,#0xff
        0x00000d1c:    31fa        .1      ADDS     r1,r1,#0xfa
        0x00000d1e:    680a        .h      LDR      r2,[r1,#0]
        0x00000d20:    4382        .C      BICS     r2,r2,r0
        0x00000d22:    600a        .`      STR      r2,[r1,#0]
        0x00000d24:    2101        .!      MOVS     r1,#1
        0x00000d26:    0289        ..      LSLS     r1,r1,#10
        0x00000d28:    2f01        ./      CMP      r7,#1
        0x00000d2a:    d016        ..      BEQ      0xd5a ; GPIO_Init + 186
        0x00000d2c:    1861        a.      ADDS     r1,r4,r1
        0x00000d2e:    680a        .h      LDR      r2,[r1,#0]
        0x00000d30:    4382        .C      BICS     r2,r2,r0
        0x00000d32:    600a        .`      STR      r2,[r1,#0]
        0x00000d34:    b005        ..      ADD      sp,sp,#0x14
        0x00000d36:    bdf0        ..      POP      {r4-r7,pc}
        0x00000d38:    6869        ih      LDR      r1,[r5,#4]
        0x00000d3a:    4301        .C      ORRS     r1,r1,r0
        0x00000d3c:    6069        i`      STR      r1,[r5,#4]
        0x00000d3e:    e7e1        ..      B        0xd04 ; GPIO_Init + 100
        0x00000d40:    1de1        ..      ADDS     r1,r4,#7
        0x00000d42:    31f9        .1      ADDS     r1,r1,#0xf9
        0x00000d44:    680a        .h      LDR      r2,[r1,#0]
        0x00000d46:    4302        .C      ORRS     r2,r2,r0
        0x00000d48:    600a        .`      STR      r2,[r1,#0]
        0x00000d4a:    e7e3        ..      B        0xd14 ; GPIO_Init + 116
        0x00000d4c:    1de1        ..      ADDS     r1,r4,#7
        0x00000d4e:    31ff        .1      ADDS     r1,r1,#0xff
        0x00000d50:    31fa        .1      ADDS     r1,r1,#0xfa
        0x00000d52:    680a        .h      LDR      r2,[r1,#0]
        0x00000d54:    4302        .C      ORRS     r2,r2,r0
        0x00000d56:    600a        .`      STR      r2,[r1,#0]
        0x00000d58:    e7e4        ..      B        0xd24 ; GPIO_Init + 132
        0x00000d5a:    1861        a.      ADDS     r1,r4,r1
        0x00000d5c:    680a        .h      LDR      r2,[r1,#0]
        0x00000d5e:    4302        .C      ORRS     r2,r2,r0
        0x00000d60:    600a        .`      STR      r2,[r1,#0]
        0x00000d62:    b005        ..      ADD      sp,sp,#0x14
        0x00000d64:    bdf0        ..      POP      {r4-r7,pc}
    $d
        0x00000d66:    0000        ..      DCW    0
        0x00000d68:    400a0000    ...@    DCD    1074397184
        0x00000d6c:    bfffc000    ....    DCD    3221209088
        0x00000d70:    400a0010    ...@    DCD    1074397200
        0x00000d74:    400a0080    ...@    DCD    1074397312
    $t
    i.HardwareInit
    HardwareInit
        0x00000d78:    b510        ..      PUSH     {r4,lr}
        0x00000d7a:    f000f897    ....    BL       Init_CMP ; 0xeac
        0x00000d7e:    f000f901    ....    BL       Init_PWM_Drive ; 0xf84
        0x00000d82:    f000f8b1    ....    BL       Init_GPIO ; 0xee8
        0x00000d86:    4813        .H      LDR      r0,[pc,#76] ; [0xdd4] = 0x40003800
        0x00000d88:    f7ffff0e    ....    BL       DIV_Init ; 0xba8
        0x00000d8c:    4812        .H      LDR      r0,[pc,#72] ; [0xdd8] = 0x40003000
        0x00000d8e:    f7fffeff    ....    BL       CORDIC_Init ; 0xb90
        0x00000d92:    f000f82b    ..+.    BL       Init_ADC ; 0xdec
        0x00000d96:    f000f951    ..Q.    BL       Init_Timer ; 0x103c
        0x00000d9a:    f000f8a7    ....    BL       Init_OPA ; 0xeec
        0x00000d9e:    f000f94f    ..O.    BL       Init_Uart ; 0x1040
        0x00000da2:    480e        .H      LDR      r0,[pc,#56] ; [0xddc] = 0x2000116c
        0x00000da4:    217d        }!      MOVS     r1,#0x7d
        0x00000da6:    00c9        ..      LSLS     r1,r1,#3
        0x00000da8:    6800        .h      LDR      r0,[r0,#0]
        0x00000daa:    f7fff9c3    ....    BL       __aeabi_uidiv ; 0x134
        0x00000dae:    490c        .I      LDR      r1,[pc,#48] ; [0xde0] = 0xffffff
        0x00000db0:    1e40        @.      SUBS     r0,r0,#1
        0x00000db2:    4288        .B      CMP      r0,r1
        0x00000db4:    d80c        ..      BHI      0xdd0 ; HardwareInit + 88
        0x00000db6:    490b        .I      LDR      r1,[pc,#44] ; [0xde4] = 0xe000e000
        0x00000db8:    6148        Ha      STR      r0,[r1,#0x14]
        0x00000dba:    480b        .H      LDR      r0,[pc,#44] ; [0xde8] = 0xe000ed04
        0x00000dbc:    2207        ."      MOVS     r2,#7
        0x00000dbe:    69c3        .i      LDR      r3,[r0,#0x1c]
        0x00000dc0:    021b        ..      LSLS     r3,r3,#8
        0x00000dc2:    0a1b        ..      LSRS     r3,r3,#8
        0x00000dc4:    044c        L.      LSLS     r4,r1,#17
        0x00000dc6:    4323        #C      ORRS     r3,r3,r4
        0x00000dc8:    61c3        .a      STR      r3,[r0,#0x1c]
        0x00000dca:    2000        .       MOVS     r0,#0
        0x00000dcc:    6188        .a      STR      r0,[r1,#0x18]
        0x00000dce:    610a        .a      STR      r2,[r1,#0x10]
        0x00000dd0:    bd10        ..      POP      {r4,pc}
    $d
        0x00000dd2:    0000        ..      DCW    0
        0x00000dd4:    40003800    .8.@    DCD    1073756160
        0x00000dd8:    40003000    .0.@    DCD    1073754112
        0x00000ddc:    2000116c    l..     DCD    536875372
        0x00000de0:    00ffffff    ....    DCD    16777215
        0x00000de4:    e000e000    ....    DCD    3758153728
        0x00000de8:    e000ed04    ....    DCD    3758157060
    $t
    i.Init_ADC
    Init_ADC
        0x00000dec:    b530        0.      PUSH     {r4,r5,lr}
        0x00000dee:    b085        ..      SUB      sp,sp,#0x14
        0x00000df0:    4c20         L      LDR      r4,[pc,#128] ; [0xe74] = 0x400a0000
        0x00000df2:    2300        .#      MOVS     r3,#0
        0x00000df4:    2207        ."      MOVS     r2,#7
        0x00000df6:    2108        .!      MOVS     r1,#8
        0x00000df8:    4620         F      MOV      r0,r4
        0x00000dfa:    f000f96d    ..m.    BL       PORT_Init ; 0x10d8
        0x00000dfe:    4d1e        .M      LDR      r5,[pc,#120] ; [0xe78] = 0x400a0010
        0x00000e00:    2300        .#      MOVS     r3,#0
        0x00000e02:    2207        ."      MOVS     r2,#7
        0x00000e04:    2109        .!      MOVS     r1,#9
        0x00000e06:    4628        (F      MOV      r0,r5
        0x00000e08:    f000f966    ..f.    BL       PORT_Init ; 0x10d8
        0x00000e0c:    2300        .#      MOVS     r3,#0
        0x00000e0e:    2207        ."      MOVS     r2,#7
        0x00000e10:    2108        .!      MOVS     r1,#8
        0x00000e12:    4620         F      MOV      r0,r4
        0x00000e14:    f000f960    ..`.    BL       PORT_Init ; 0x10d8
        0x00000e18:    2300        .#      MOVS     r3,#0
        0x00000e1a:    2207        ."      MOVS     r2,#7
        0x00000e1c:    2104        .!      MOVS     r1,#4
        0x00000e1e:    4628        (F      MOV      r0,r5
        0x00000e20:    f000f95a    ..Z.    BL       PORT_Init ; 0x10d8
        0x00000e24:    2300        .#      MOVS     r3,#0
        0x00000e26:    2207        ."      MOVS     r2,#7
        0x00000e28:    210e        .!      MOVS     r1,#0xe
        0x00000e2a:    4620         F      MOV      r0,r4
        0x00000e2c:    f000f954    ..T.    BL       PORT_Init ; 0x10d8
        0x00000e30:    2300        .#      MOVS     r3,#0
        0x00000e32:    2207        ."      MOVS     r2,#7
        0x00000e34:    2105        .!      MOVS     r1,#5
        0x00000e36:    4628        (F      MOV      r0,r5
        0x00000e38:    f000f94e    ..N.    BL       PORT_Init ; 0x10d8
        0x00000e3c:    2090        .       MOVS     r0,#0x90
        0x00000e3e:    466a        jF      MOV      r2,sp
        0x00000e40:    7010        .p      STRB     r0,[r2,#0]
        0x00000e42:    2004        .       MOVS     r0,#4
        0x00000e44:    7050        Pp      STRB     r0,[r2,#1]
        0x00000e46:    2007        .       MOVS     r0,#7
        0x00000e48:    7090        .p      STRB     r0,[r2,#2]
        0x00000e4a:    20ff        .       MOVS     r0,#0xff
        0x00000e4c:    30c8        .0      ADDS     r0,r0,#0xc8
        0x00000e4e:    8090        ..      STRH     r0,[r2,#4]
        0x00000e50:    2000        .       MOVS     r0,#0
        0x00000e52:    7190        .q      STRB     r0,[r2,#6]
        0x00000e54:    4909        .I      LDR      r1,[pc,#36] ; [0xe7c] = 0x1001
        0x00000e56:    8111        ..      STRH     r1,[r2,#8]
        0x00000e58:    7290        .r      STRB     r0,[r2,#0xa]
        0x00000e5a:    2180        .!      MOVS     r1,#0x80
        0x00000e5c:    8191        ..      STRH     r1,[r2,#0xc]
        0x00000e5e:    81d0        ..      STRH     r0,[r2,#0xe]
        0x00000e60:    4c07        .L      LDR      r4,[pc,#28] ; [0xe80] = 0x40049000
        0x00000e62:    4669        iF      MOV      r1,sp
        0x00000e64:    4620         F      MOV      r0,r4
        0x00000e66:    f7fffced    ....    BL       ADC_Init ; 0x844
        0x00000e6a:    4620         F      MOV      r0,r4
        0x00000e6c:    f7fffe6f    ..o.    BL       ADC_Open ; 0xb4e
        0x00000e70:    b005        ..      ADD      sp,sp,#0x14
        0x00000e72:    bd30        0.      POP      {r4,r5,pc}
    $d
        0x00000e74:    400a0000    ...@    DCD    1074397184
        0x00000e78:    400a0010    ...@    DCD    1074397200
        0x00000e7c:    00001001    ....    DCD    4097
        0x00000e80:    40049000    ...@    DCD    1074040832
    $t
    i.Init_BOD
    Init_BOD
        0x00000e84:    4906        .I      LDR      r1,[pc,#24] ; [0xea0] = 0x400aa000
        0x00000e86:    2002        .       MOVS     r0,#2
        0x00000e88:    6108        .a      STR      r0,[r1,#0x10]
        0x00000e8a:    4806        .H      LDR      r0,[pc,#24] ; [0xea4] = 0xe000e408
        0x00000e8c:    6801        .h      LDR      r1,[r0,#0]
        0x00000e8e:    0a09        ..      LSRS     r1,r1,#8
        0x00000e90:    0209        ..      LSLS     r1,r1,#8
        0x00000e92:    6001        .`      STR      r1,[r0,#0]
        0x00000e94:    20ff        .       MOVS     r0,#0xff
        0x00000e96:    4904        .I      LDR      r1,[pc,#16] ; [0xea8] = 0xe000e100
        0x00000e98:    3001        .0      ADDS     r0,#1
        0x00000e9a:    6008        .`      STR      r0,[r1,#0]
        0x00000e9c:    4770        pG      BX       lr
    $d
        0x00000e9e:    0000        ..      DCW    0
        0x00000ea0:    400aa000    ...@    DCD    1074438144
        0x00000ea4:    e000e408    ....    DCD    3758154760
        0x00000ea8:    e000e100    ....    DCD    3758153984
    $t
    i.Init_CMP
    Init_CMP
        0x00000eac:    4809        .H      LDR      r0,[pc,#36] ; [0xed4] = 0x40000080
        0x00000eae:    68c0        .h      LDR      r0,[r0,#0xc]
        0x00000eb0:    4909        .I      LDR      r1,[pc,#36] ; [0xed8] = 0x20001144
        0x00000eb2:    0e00        ..      LSRS     r0,r0,#24
        0x00000eb4:    6048        H`      STR      r0,[r1,#4]
        0x00000eb6:    3864        d8      SUBS     r0,r0,#0x64
        0x00000eb8:    8008        ..      STRH     r0,[r1,#0]
        0x00000eba:    4808        .H      LDR      r0,[pc,#32] ; [0xedc] = 0xe000e40c
        0x00000ebc:    6801        .h      LDR      r1,[r0,#0]
        0x00000ebe:    0209        ..      LSLS     r1,r1,#8
        0x00000ec0:    0a09        ..      LSRS     r1,r1,#8
        0x00000ec2:    6001        .`      STR      r1,[r0,#0]
        0x00000ec4:    2001        .       MOVS     r0,#1
        0x00000ec6:    4906        .I      LDR      r1,[pc,#24] ; [0xee0] = 0xe000e100
        0x00000ec8:    03c0        ..      LSLS     r0,r0,#15
        0x00000eca:    6008        .`      STR      r0,[r1,#0]
        0x00000ecc:    4905        .I      LDR      r1,[pc,#20] ; [0xee4] = 0xe000e180
        0x00000ece:    6008        .`      STR      r0,[r1,#0]
        0x00000ed0:    4770        pG      BX       lr
    $d
        0x00000ed2:    0000        ..      DCW    0
        0x00000ed4:    40000080    ...@    DCD    1073741952
        0x00000ed8:    20001144    D..     DCD    536875332
        0x00000edc:    e000e40c    ....    DCD    3758154764
        0x00000ee0:    e000e100    ....    DCD    3758153984
        0x00000ee4:    e000e180    ....    DCD    3758154112
    $t
    i.Init_GPIO
    Init_GPIO
        0x00000ee8:    4770        pG      BX       lr
        0x00000eea:    0000        ..      MOVS     r0,r0
    i.Init_OPA
    Init_OPA
        0x00000eec:    b510        ..      PUSH     {r4,lr}
        0x00000eee:    4c22        "L      LDR      r4,[pc,#136] ; [0xf78] = 0x400a0000
        0x00000ef0:    2300        .#      MOVS     r3,#0
        0x00000ef2:    2207        ."      MOVS     r2,#7
        0x00000ef4:    210e        .!      MOVS     r1,#0xe
        0x00000ef6:    4620         F      MOV      r0,r4
        0x00000ef8:    f000f8ee    ....    BL       PORT_Init ; 0x10d8
        0x00000efc:    2300        .#      MOVS     r3,#0
        0x00000efe:    2207        ."      MOVS     r2,#7
        0x00000f00:    210c        .!      MOVS     r1,#0xc
        0x00000f02:    4620         F      MOV      r0,r4
        0x00000f04:    f000f8e8    ....    BL       PORT_Init ; 0x10d8
        0x00000f08:    2300        .#      MOVS     r3,#0
        0x00000f0a:    2207        ."      MOVS     r2,#7
        0x00000f0c:    210a        .!      MOVS     r1,#0xa
        0x00000f0e:    4620         F      MOV      r0,r4
        0x00000f10:    f000f8e2    ....    BL       PORT_Init ; 0x10d8
        0x00000f14:    2300        .#      MOVS     r3,#0
        0x00000f16:    2207        ."      MOVS     r2,#7
        0x00000f18:    210b        .!      MOVS     r1,#0xb
        0x00000f1a:    4620         F      MOV      r0,r4
        0x00000f1c:    f000f8dc    ....    BL       PORT_Init ; 0x10d8
        0x00000f20:    2300        .#      MOVS     r3,#0
        0x00000f22:    2207        ."      MOVS     r2,#7
        0x00000f24:    210d        .!      MOVS     r1,#0xd
        0x00000f26:    4620         F      MOV      r0,r4
        0x00000f28:    f000f8d6    ....    BL       PORT_Init ; 0x10d8
        0x00000f2c:    2300        .#      MOVS     r3,#0
        0x00000f2e:    2207        ."      MOVS     r2,#7
        0x00000f30:    2109        .!      MOVS     r1,#9
        0x00000f32:    4620         F      MOV      r0,r4
        0x00000f34:    f000f8d0    ....    BL       PORT_Init ; 0x10d8
        0x00000f38:    2300        .#      MOVS     r3,#0
        0x00000f3a:    2207        ."      MOVS     r2,#7
        0x00000f3c:    2108        .!      MOVS     r1,#8
        0x00000f3e:    4620         F      MOV      r0,r4
        0x00000f40:    f000f8ca    ....    BL       PORT_Init ; 0x10d8
        0x00000f44:    4c0d        .L      LDR      r4,[pc,#52] ; [0xf7c] = 0x400a0010
        0x00000f46:    2300        .#      MOVS     r3,#0
        0x00000f48:    2207        ."      MOVS     r2,#7
        0x00000f4a:    2108        .!      MOVS     r1,#8
        0x00000f4c:    4620         F      MOV      r0,r4
        0x00000f4e:    f000f8c3    ....    BL       PORT_Init ; 0x10d8
        0x00000f52:    2207        ."      MOVS     r2,#7
        0x00000f54:    2300        .#      MOVS     r3,#0
        0x00000f56:    4611        .F      MOV      r1,r2
        0x00000f58:    4620         F      MOV      r0,r4
        0x00000f5a:    f000f8bd    ....    BL       PORT_Init ; 0x10d8
        0x00000f5e:    2300        .#      MOVS     r3,#0
        0x00000f60:    2207        ."      MOVS     r2,#7
        0x00000f62:    2109        .!      MOVS     r1,#9
        0x00000f64:    4620         F      MOV      r0,r4
        0x00000f66:    f000f8b7    ....    BL       PORT_Init ; 0x10d8
        0x00000f6a:    4805        .H      LDR      r0,[pc,#20] ; [0xf80] = 0x400aa040
        0x00000f6c:    6b01        .k      LDR      r1,[r0,#0x30]
        0x00000f6e:    2207        ."      MOVS     r2,#7
        0x00000f70:    4311        .C      ORRS     r1,r1,r2
        0x00000f72:    6301        .c      STR      r1,[r0,#0x30]
        0x00000f74:    bd10        ..      POP      {r4,pc}
    $d
        0x00000f76:    0000        ..      DCW    0
        0x00000f78:    400a0000    ...@    DCD    1074397184
        0x00000f7c:    400a0010    ...@    DCD    1074397200
        0x00000f80:    400aa040    @..@    DCD    1074438208
    $t
    i.Init_PWM_Drive
    Init_PWM_Drive
        0x00000f84:    b5f0        ..      PUSH     {r4-r7,lr}
        0x00000f86:    b08b        ..      SUB      sp,sp,#0x2c
        0x00000f88:    2301        .#      MOVS     r3,#1
        0x00000f8a:    466a        jF      MOV      r2,sp
