747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
        0x00000f8c:    7213        .r      STRB     r3,[r2,#8]
        0x00000f8e:    8153        S.      STRH     r3,[r2,#0xa]
        0x00000f90:    4821        !H      LDR      r0,[pc,#132] ; [0x1018] = 0x7fd
        0x00000f92:    8190        ..      STRH     r0,[r2,#0xc]
        0x00000f94:    1041        A.      ASRS     r1,r0,#1
        0x00000f96:    81d1        ..      STRH     r1,[r2,#0xe]
        0x00000f98:    202d        -       MOVS     r0,#0x2d
        0x00000f9a:    8250        P.      STRH     r0,[r2,#0x12]
        0x00000f9c:    2400        .$      MOVS     r4,#0
        0x00000f9e:    9405        ..      STR      r4,[sp,#0x14]
        0x00000fa0:    8311        ..      STRH     r1,[r2,#0x18]
        0x00000fa2:    8390        ..      STRH     r0,[r2,#0x1c]
        0x00000fa4:    7794        .w      STRB     r4,[r2,#0x1e]
        0x00000fa6:    77d4        .w      STRB     r4,[r2,#0x1f]
        0x00000fa8:    aa08        ..      ADD      r2,sp,#0x20
        0x00000faa:    7014        .p      STRB     r4,[r2,#0]
        0x00000fac:    7093        .p      STRB     r3,[r2,#2]
        0x00000fae:    70d4        .p      STRB     r4,[r2,#3]
        0x00000fb0:    9409        ..      STR      r4,[sp,#0x24]
        0x00000fb2:    4d1a        .M      LDR      r5,[pc,#104] ; [0x101c] = 0x40046000
        0x00000fb4:    a902        ..      ADD      r1,sp,#8
        0x00000fb6:    4628        (F      MOV      r0,r5
        0x00000fb8:    f000f8f6    ....    BL       PWM_Init ; 0x11a8
        0x00000fbc:    aa08        ..      ADD      r2,sp,#0x20
        0x00000fbe:    7094        .p      STRB     r4,[r2,#2]
        0x00000fc0:    70d4        .p      STRB     r4,[r2,#3]
        0x00000fc2:    4e17        .N      LDR      r6,[pc,#92] ; [0x1020] = 0x40046080
        0x00000fc4:    a902        ..      ADD      r1,sp,#8
        0x00000fc6:    4630        0F      MOV      r0,r6
        0x00000fc8:    f000f8ee    ....    BL       PWM_Init ; 0x11a8
        0x00000fcc:    4916        .I      LDR      r1,[pc,#88] ; [0x1028] = 0x40046400
        0x00000fce:    4815        .H      LDR      r0,[pc,#84] ; [0x1024] = 0xffff
        0x00000fd0:    6048        H`      STR      r0,[r1,#4]
        0x00000fd2:    2003        .       MOVS     r0,#3
        0x00000fd4:    f000f99e    ....    BL       PWM_Start ; 0x1314
        0x00000fd8:    4f14        .O      LDR      r7,[pc,#80] ; [0x102c] = 0x767
        0x00000fda:    2300        .#      MOVS     r3,#0
        0x00000fdc:    9400        ..      STR      r4,[sp,#0]
        0x00000fde:    461a        .F      MOV      r2,r3
        0x00000fe0:    4639        9F      MOV      r1,r7
        0x00000fe2:    4628        (F      MOV      r0,r5
        0x00000fe4:    9401        ..      STR      r4,[sp,#4]
        0x00000fe6:    f000f8cb    ....    BL       PWM_CmpTrigger ; 0x1180
        0x00000fea:    2300        .#      MOVS     r3,#0
        0x00000fec:    9400        ..      STR      r4,[sp,#0]
        0x00000fee:    461a        .F      MOV      r2,r3
        0x00000ff0:    4639        9F      MOV      r1,r7
        0x00000ff2:    4630        0F      MOV      r0,r6
        0x00000ff4:    9401        ..      STR      r4,[sp,#4]
        0x00000ff6:    f000f8c3    ....    BL       PWM_CmpTrigger ; 0x1180
        0x00000ffa:    f000f897    ....    BL       PORT_SixDrive_Enable ; 0x112c
        0x00000ffe:    480c        .H      LDR      r0,[pc,#48] ; [0x1030] = 0xe000e404
        0x00001000:    6801        .h      LDR      r1,[r0,#0]
        0x00001002:    0209        ..      LSLS     r1,r1,#8
        0x00001004:    0a09        ..      LSRS     r1,r1,#8
        0x00001006:    6001        .`      STR      r1,[r0,#0]
        0x00001008:    490a        .I      LDR      r1,[pc,#40] ; [0x1034] = 0xe000e100
        0x0000100a:    2080        .       MOVS     r0,#0x80
        0x0000100c:    6008        .`      STR      r0,[r1,#0]
        0x0000100e:    490a        .I      LDR      r1,[pc,#40] ; [0x1038] = 0xe000e180
        0x00001010:    6008        .`      STR      r0,[r1,#0]
        0x00001012:    b00b        ..      ADD      sp,sp,#0x2c
        0x00001014:    bdf0        ..      POP      {r4-r7,pc}
    $d
        0x00001016:    0000        ..      DCW    0
        0x00001018:    000007fd    ....    DCD    2045
        0x0000101c:    40046000    .`.@    DCD    1074028544
        0x00001020:    40046080    .`.@    DCD    1074028672
        0x00001024:    0000ffff    ....    DCD    65535
        0x00001028:    40046400    .d.@    DCD    1074029568
        0x0000102c:    00000767    g...    DCD    1895
        0x00001030:    e000e404    ....    DCD    3758154756
        0x00001034:    e000e100    ....    DCD    3758153984
        0x00001038:    e000e180    ....    DCD    3758154112
    $t
    i.Init_Timer
    Init_Timer
        0x0000103c:    4770        pG      BX       lr
        0x0000103e:    0000        ..      MOVS     r0,r0
    i.Init_Uart
    Init_Uart
        0x00001040:    b510        ..      PUSH     {r4,lr}
        0x00001042:    b084        ..      SUB      sp,sp,#0x10
        0x00001044:    4c10        .L      LDR      r4,[pc,#64] ; [0x1088] = 0x400a0010
        0x00001046:    2301        .#      MOVS     r3,#1
        0x00001048:    461a        .F      MOV      r2,r3
        0x0000104a:    210c        .!      MOVS     r1,#0xc
        0x0000104c:    4620         F      MOV      r0,r4
        0x0000104e:    f000f843    ..C.    BL       PORT_Init ; 0x10d8
        0x00001052:    2300        .#      MOVS     r3,#0
        0x00001054:    2201        ."      MOVS     r2,#1
        0x00001056:    210b        .!      MOVS     r1,#0xb
        0x00001058:    4620         F      MOV      r0,r4
        0x0000105a:    f000f83d    ..=.    BL       PORT_Init ; 0x10d8
        0x0000105e:    20e1        .       MOVS     r0,#0xe1
        0x00001060:    0240        @.      LSLS     r0,r0,#9
        0x00001062:    9000        ..      STR      r0,[sp,#0]
        0x00001064:    2000        .       MOVS     r0,#0
        0x00001066:    4669        iF      MOV      r1,sp
        0x00001068:    7108        .q      STRB     r0,[r1,#4]
        0x0000106a:    7148        Hq      STRB     r0,[r1,#5]
        0x0000106c:    7188        .q      STRB     r0,[r1,#6]
        0x0000106e:    7208        .r      STRB     r0,[r1,#8]
        0x00001070:    7288        .r      STRB     r0,[r1,#0xa]
        0x00001072:    7308        .s      STRB     r0,[r1,#0xc]
        0x00001074:    4c05        .L      LDR      r4,[pc,#20] ; [0x108c] = 0x40042000
        0x00001076:    4620         F      MOV      r0,r4
        0x00001078:    f000fa26    ..&.    BL       UART_Init ; 0x14c8
        0x0000107c:    4620         F      MOV      r0,r4
        0x0000107e:    f000faaf    ....    BL       UART_Open ; 0x15e0
        0x00001082:    b004        ..      ADD      sp,sp,#0x10
        0x00001084:    bd10        ..      POP      {r4,pc}
    $d
        0x00001086:    0000        ..      DCW    0
        0x00001088:    400a0010    ...@    DCD    1074397200
        0x0000108c:    40042000    . .@    DCD    1074012160
    $t
    i.PLLInit
    PLLInit
        0x00001090:    480d        .H      LDR      r0,[pc,#52] ; [0x10c8] = 0x400aa000
        0x00001092:    2201        ."      MOVS     r2,#1
        0x00001094:    6002        .`      STR      r2,[r0,#0]
        0x00001096:    480d        .H      LDR      r0,[pc,#52] ; [0x10cc] = 0x400aa040
        0x00001098:    6801        .h      LDR      r1,[r0,#0]
        0x0000109a:    2302        .#      MOVS     r3,#2
        0x0000109c:    4319        .C      ORRS     r1,r1,r3
        0x0000109e:    6001        .`      STR      r1,[r0,#0]
        0x000010a0:    6841        Ah      LDR      r1,[r0,#4]
        0x000010a2:    4b0b        .K      LDR      r3,[pc,#44] ; [0x10d0] = 0xfce0fe00
        0x000010a4:    4019        .@      ANDS     r1,r1,r3
        0x000010a6:    6041        A`      STR      r1,[r0,#4]
        0x000010a8:    6841        Ah      LDR      r1,[r0,#4]
        0x000010aa:    4b0a        .K      LDR      r3,[pc,#40] ; [0x10d4] = 0x3002d
        0x000010ac:    4319        .C      ORRS     r1,r1,r3
        0x000010ae:    6041        A`      STR      r1,[r0,#4]
        0x000010b0:    6801        .h      LDR      r1,[r0,#0]
        0x000010b2:    2304        .#      MOVS     r3,#4
        0x000010b4:    4399        .C      BICS     r1,r1,r3
        0x000010b6:    6001        .`      STR      r1,[r0,#0]
        0x000010b8:    68c1        .h      LDR      r1,[r0,#0xc]
        0x000010ba:    2900        .)      CMP      r1,#0
        0x000010bc:    d0fc        ..      BEQ      0x10b8 ; PLLInit + 40
        0x000010be:    6801        .h      LDR      r1,[r0,#0]
        0x000010c0:    4311        .C      ORRS     r1,r1,r2
        0x000010c2:    6001        .`      STR      r1,[r0,#0]
        0x000010c4:    4770        pG      BX       lr
    $d
        0x000010c6:    0000        ..      DCW    0
        0x000010c8:    400aa000    ...@    DCD    1074438144
        0x000010cc:    400aa040    @..@    DCD    1074438208
        0x000010d0:    fce0fe00    ....    DCD    4242603520
        0x000010d4:    0003002d    -...    DCD    196653
    $t
    i.PORT_Init
    PORT_Init
        0x000010d8:    b470        p.      PUSH     {r4-r6}
        0x000010da:    250f        .%      MOVS     r5,#0xf
        0x000010dc:    2908        .)      CMP      r1,#8
        0x000010de:    d209        ..      BCS      0x10f4 ; PORT_Init + 28
        0x000010e0:    6806        .h      LDR      r6,[r0,#0]
        0x000010e2:    008c        ..      LSLS     r4,r1,#2
        0x000010e4:    40a5        .@      LSLS     r5,r5,r4
        0x000010e6:    43ae        .C      BICS     r6,r6,r5
        0x000010e8:    6006        .`      STR      r6,[r0,#0]
        0x000010ea:    6805        .h      LDR      r5,[r0,#0]
        0x000010ec:    40a2        .@      LSLS     r2,r2,r4
        0x000010ee:    4315        .C      ORRS     r5,r5,r2
        0x000010f0:    6005        .`      STR      r5,[r0,#0]
        0x000010f2:    e00a        ..      B        0x110a ; PORT_Init + 50
        0x000010f4:    6846        Fh      LDR      r6,[r0,#4]
        0x000010f6:    460c        .F      MOV      r4,r1
        0x000010f8:    3c08        .<      SUBS     r4,r4,#8
        0x000010fa:    00a4        ..      LSLS     r4,r4,#2
        0x000010fc:    40a5        .@      LSLS     r5,r5,r4
        0x000010fe:    43ae        .C      BICS     r6,r6,r5
        0x00001100:    6046        F`      STR      r6,[r0,#4]
        0x00001102:    6845        Eh      LDR      r5,[r0,#4]
        0x00001104:    40a2        .@      LSLS     r2,r2,r4
        0x00001106:    4315        .C      ORRS     r5,r5,r2
        0x00001108:    6045        E`      STR      r5,[r0,#4]
        0x0000110a:    2403        .$      MOVS     r4,#3
        0x0000110c:    0224        $.      LSLS     r4,r4,#8
        0x0000110e:    2201        ."      MOVS     r2,#1
        0x00001110:    408a        .@      LSLS     r2,r2,r1
        0x00001112:    1900        ..      ADDS     r0,r0,r4
        0x00001114:    2b00        .+      CMP      r3,#0
        0x00001116:    d004        ..      BEQ      0x1122 ; PORT_Init + 74
        0x00001118:    6801        .h      LDR      r1,[r0,#0]
        0x0000111a:    4311        .C      ORRS     r1,r1,r2
        0x0000111c:    6001        .`      STR      r1,[r0,#0]
        0x0000111e:    bc70        p.      POP      {r4-r6}
        0x00001120:    4770        pG      BX       lr
        0x00001122:    6801        .h      LDR      r1,[r0,#0]
        0x00001124:    4391        .C      BICS     r1,r1,r2
        0x00001126:    6001        .`      STR      r1,[r0,#0]
        0x00001128:    bc70        p.      POP      {r4-r6}
        0x0000112a:    4770        pG      BX       lr
    i.PORT_SixDrive_Enable
    PORT_SixDrive_Enable
        0x0000112c:    b510        ..      PUSH     {r4,lr}
        0x0000112e:    4c13        .L      LDR      r4,[pc,#76] ; [0x117c] = 0x400a0000
        0x00001130:    2300        .#      MOVS     r3,#0
        0x00001132:    2203        ."      MOVS     r2,#3
        0x00001134:    2105        .!      MOVS     r1,#5
        0x00001136:    4620         F      MOV      r0,r4
        0x00001138:    f7ffffce    ....    BL       PORT_Init ; 0x10d8
        0x0000113c:    2202        ."      MOVS     r2,#2
        0x0000113e:    2300        .#      MOVS     r3,#0
        0x00001140:    4611        .F      MOV      r1,r2
        0x00001142:    4620         F      MOV      r0,r4
        0x00001144:    f7ffffc8    ....    BL       PORT_Init ; 0x10d8
        0x00001148:    2300        .#      MOVS     r3,#0
        0x0000114a:    2203        ."      MOVS     r2,#3
        0x0000114c:    2104        .!      MOVS     r1,#4
        0x0000114e:    4620         F      MOV      r0,r4
        0x00001150:    f7ffffc2    ....    BL       PORT_Init ; 0x10d8
        0x00001154:    2300        .#      MOVS     r3,#0
        0x00001156:    2204        ."      MOVS     r2,#4
        0x00001158:    2101        .!      MOVS     r1,#1
        0x0000115a:    4620         F      MOV      r0,r4
        0x0000115c:    f7ffffbc    ....    BL       PORT_Init ; 0x10d8
        0x00001160:    2300        .#      MOVS     r3,#0
        0x00001162:    2202        ."      MOVS     r2,#2
        0x00001164:    2103        .!      MOVS     r1,#3
        0x00001166:    4620         F      MOV      r0,r4
        0x00001168:    f7ffffb6    ....    BL       PORT_Init ; 0x10d8
        0x0000116c:    2300        .#      MOVS     r3,#0
        0x0000116e:    2204        ."      MOVS     r2,#4
        0x00001170:    4619        .F      MOV      r1,r3
        0x00001172:    4620         F      MOV      r0,r4
        0x00001174:    f7ffffb0    ....    BL       PORT_Init ; 0x10d8
        0x00001178:    bd10        ..      POP      {r4,pc}
    $d
        0x0000117a:    0000        ..      DCW    0
        0x0000117c:    400a0000    ...@    DCD    1074397184
    $t
    i.PWM_CmpTrigger
    PWM_CmpTrigger
        0x00001180:    b470        p.      PUSH     {r4-r6}
        0x00001182:    9d04        ..      LDR      r5,[sp,#0x10]
        0x00001184:    9c03        ..      LDR      r4,[sp,#0xc]
        0x00001186:    2601        .&      MOVS     r6,#1
        0x00001188:    0436        6.      LSLS     r6,r6,#16
        0x0000118a:    0712        ..      LSLS     r2,r2,#28
        0x0000118c:    1989        ..      ADDS     r1,r1,r6
        0x0000118e:    430a        .C      ORRS     r2,r2,r1
        0x00001190:    0899        ..      LSRS     r1,r3,#2
        0x00001192:    0509        ..      LSLS     r1,r1,#20
        0x00001194:    430a        .C      ORRS     r2,r2,r1
        0x00001196:    0461        a.      LSLS     r1,r4,#17
        0x00001198:    430a        .C      ORRS     r2,r2,r1
        0x0000119a:    2103        .!      MOVS     r1,#3
        0x0000119c:    0749        I.      LSLS     r1,r1,#29
        0x0000119e:    430a        .C      ORRS     r2,r2,r1
        0x000011a0:    6542        Be      STR      r2,[r0,#0x54]
        0x000011a2:    6585        .e      STR      r5,[r0,#0x58]
        0x000011a4:    bc70        p.      POP      {r4-r6}
        0x000011a6:    4770        pG      BX       lr
    i.PWM_Init
    PWM_Init
        0x000011a8:    b410        ..      PUSH     {r4}
        0x000011aa:    2201        ."      MOVS     r2,#1
        0x000011ac:    0792        ..      LSLS     r2,r2,#30
        0x000011ae:    6893        .h      LDR      r3,[r2,#8]
        0x000011b0:    1494        ..      ASRS     r4,r2,#18
        0x000011b2:    4323        #C      ORRS     r3,r3,r4
        0x000011b4:    6093        .`      STR      r3,[r2,#8]
        0x000011b6:    884b        K.      LDRH     r3,[r1,#2]
        0x000011b8:    780a        .x      LDRB     r2,[r1,#0]
        0x000011ba:    1e5b        [.      SUBS     r3,r3,#1
        0x000011bc:    019b        ..      LSLS     r3,r3,#6
        0x000011be:    2404        .$      MOVS     r4,#4
        0x000011c0:    4323        #C      ORRS     r3,r3,r4
        0x000011c2:    431a        .C      ORRS     r2,r2,r3
        0x000011c4:    6002        .`      STR      r2,[r0,#0]
        0x000011c6:    7b0a        .{      LDRB     r2,[r1,#0xc]
        0x000011c8:    2a00        .*      CMP      r2,#0
        0x000011ca:    d001        ..      BEQ      0x11d0 ; PWM_Init + 40
        0x000011cc:    2201        ."      MOVS     r2,#1
        0x000011ce:    e000        ..      B        0x11d2 ; PWM_Init + 42
        0x000011d0:    2200        ."      MOVS     r2,#0
        0x000011d2:    7d8b        .}      LDRB     r3,[r1,#0x16]
        0x000011d4:    2b00        .+      CMP      r3,#0
        0x000011d6:    d001        ..      BEQ      0x11dc ; PWM_Init + 52
        0x000011d8:    2301        .#      MOVS     r3,#1
        0x000011da:    e000        ..      B        0x11de ; PWM_Init + 54
        0x000011dc:    2300        .#      MOVS     r3,#0
        0x000011de:    005b        [.      LSLS     r3,r3,#1
        0x000011e0:    431a        .C      ORRS     r2,r2,r3
        0x000011e2:    7b4b        K{      LDRB     r3,[r1,#0xd]
        0x000011e4:    2b00        .+      CMP      r3,#0
        0x000011e6:    d001        ..      BEQ      0x11ec ; PWM_Init + 68
        0x000011e8:    2301        .#      MOVS     r3,#1
        0x000011ea:    e000        ..      B        0x11ee ; PWM_Init + 70
        0x000011ec:    2300        .#      MOVS     r3,#0
        0x000011ee:    009b        ..      LSLS     r3,r3,#2
        0x000011f0:    431a        .C      ORRS     r2,r2,r3
        0x000011f2:    7dcb        .}      LDRB     r3,[r1,#0x17]
        0x000011f4:    2b00        .+      CMP      r3,#0
        0x000011f6:    d001        ..      BEQ      0x11fc ; PWM_Init + 84
        0x000011f8:    2301        .#      MOVS     r3,#1
        0x000011fa:    e000        ..      B        0x11fe ; PWM_Init + 86
        0x000011fc:    2300        .#      MOVS     r3,#0
        0x000011fe:    00db        ..      LSLS     r3,r3,#3
        0x00001200:    431a        .C      ORRS     r2,r2,r3
        0x00001202:    7b8b        .{      LDRB     r3,[r1,#0xe]
        0x00001204:    2b00        .+      CMP      r3,#0
        0x00001206:    d001        ..      BEQ      0x120c ; PWM_Init + 100
        0x00001208:    2301        .#      MOVS     r3,#1
        0x0000120a:    e000        ..      B        0x120e ; PWM_Init + 102
        0x0000120c:    2300        .#      MOVS     r3,#0
        0x0000120e:    011b        ..      LSLS     r3,r3,#4
        0x00001210:    431a        .C      ORRS     r2,r2,r3
        0x00001212:    7e0b        .~      LDRB     r3,[r1,#0x18]
        0x00001214:    2b00        .+      CMP      r3,#0
        0x00001216:    d001        ..      BEQ      0x121c ; PWM_Init + 116
        0x00001218:    2301        .#      MOVS     r3,#1
        0x0000121a:    e000        ..      B        0x121e ; PWM_Init + 118
        0x0000121c:    2300        .#      MOVS     r3,#0
        0x0000121e:    015b        [.      LSLS     r3,r3,#5
        0x00001220:    431a        .C      ORRS     r2,r2,r3
        0x00001222:    7bcb        .{      LDRB     r3,[r1,#0xf]
        0x00001224:    2b00        .+      CMP      r3,#0
        0x00001226:    d001        ..      BEQ      0x122c ; PWM_Init + 132
        0x00001228:    2301        .#      MOVS     r3,#1
        0x0000122a:    e000        ..      B        0x122e ; PWM_Init + 134
        0x0000122c:    2300        .#      MOVS     r3,#0
        0x0000122e:    019b        ..      LSLS     r3,r3,#6
        0x00001230:    431a        .C      ORRS     r2,r2,r3
        0x00001232:    7e4b        K~      LDRB     r3,[r1,#0x19]
        0x00001234:    2b00        .+      CMP      r3,#0
        0x00001236:    d001        ..      BEQ      0x123c ; PWM_Init + 148
        0x00001238:    2301        .#      MOVS     r3,#1
        0x0000123a:    e000        ..      B        0x123e ; PWM_Init + 150
        0x0000123c:    2300        .#      MOVS     r3,#0
        0x0000123e:    01db        ..      LSLS     r3,r3,#7
        0x00001240:    431a        .C      ORRS     r2,r2,r3
        0x00001242:    6042        B`      STR      r2,[r0,#4]
        0x00001244:    888a        ..      LDRH     r2,[r1,#4]
        0x00001246:    1e52        R.      SUBS     r2,r2,#1
        0x00001248:    6202        .b      STR      r2,[r0,#0x20]
        0x0000124a:    88ca        ..      LDRH     r2,[r1,#6]
        0x0000124c:    6242        Bb      STR      r2,[r0,#0x24]
        0x0000124e:    890a        ..      LDRH     r2,[r1,#8]
        0x00001250:    6342        Bc      STR      r2,[r0,#0x34]
        0x00001252:    894a        J.      LDRH     r2,[r1,#0xa]
        0x00001254:    62c2        .b      STR      r2,[r0,#0x2c]
        0x00001256:    8a0a        ..      LDRH     r2,[r1,#0x10]
        0x00001258:    6282        .b      STR      r2,[r0,#0x28]
        0x0000125a:    8a4a        J.      LDRH     r2,[r1,#0x12]
        0x0000125c:    6382        .c      STR      r2,[r0,#0x38]
        0x0000125e:    8a8a        ..      LDRH     r2,[r1,#0x14]
        0x00001260:    6302        .c      STR      r2,[r0,#0x30]
        0x00001262:    4b29        )K      LDR      r3,[pc,#164] ; [0x1308] = 0x40046400
        0x00001264:    223f        ?"      MOVS     r2,#0x3f
        0x00001266:    60da        .`      STR      r2,[r3,#0xc]
        0x00001268:    6742        Bg      STR      r2,[r0,#0x74]
        0x0000126a:    7e8a        .~      LDRB     r2,[r1,#0x1a]
        0x0000126c:    2a00        .*      CMP      r2,#0
        0x0000126e:    d001        ..      BEQ      0x1274 ; PWM_Init + 204
        0x00001270:    2201        ."      MOVS     r2,#1
        0x00001272:    e000        ..      B        0x1276 ; PWM_Init + 206
        0x00001274:    2200        ."      MOVS     r2,#0
        0x00001276:    7ecb        .~      LDRB     r3,[r1,#0x1b]
        0x00001278:    2b00        .+      CMP      r3,#0
        0x0000127a:    d001        ..      BEQ      0x1280 ; PWM_Init + 216
        0x0000127c:    2301        .#      MOVS     r3,#1
        0x0000127e:    e000        ..      B        0x1282 ; PWM_Init + 218
        0x00001280:    2300        .#      MOVS     r3,#0
        0x00001282:    005b        [.      LSLS     r3,r3,#1
        0x00001284:    431a        .C      ORRS     r2,r2,r3
        0x00001286:    7f0b        ..      LDRB     r3,[r1,#0x1c]
        0x00001288:    2b00        .+      CMP      r3,#0
        0x0000128a:    d001        ..      BEQ      0x1290 ; PWM_Init + 232
        0x0000128c:    2301        .#      MOVS     r3,#1
        0x0000128e:    e000        ..      B        0x1292 ; PWM_Init + 234
        0x00001290:    2300        .#      MOVS     r3,#0
        0x00001292:    009b        ..      LSLS     r3,r3,#2
        0x00001294:    431a        .C      ORRS     r2,r2,r3
        0x00001296:    7f4b        K.      LDRB     r3,[r1,#0x1d]
        0x00001298:    2b00        .+      CMP      r3,#0
        0x0000129a:    d001        ..      BEQ      0x12a0 ; PWM_Init + 248
        0x0000129c:    2301        .#      MOVS     r3,#1
        0x0000129e:    e000        ..      B        0x12a2 ; PWM_Init + 250
        0x000012a0:    2300        .#      MOVS     r3,#0
        0x000012a2:    011b        ..      LSLS     r3,r3,#4
        0x000012a4:    431a        .C      ORRS     r2,r2,r3
        0x000012a6:    7f8b        ..      LDRB     r3,[r1,#0x1e]
        0x000012a8:    2b00        .+      CMP      r3,#0
        0x000012aa:    d001        ..      BEQ      0x12b0 ; PWM_Init + 264
        0x000012ac:    2301        .#      MOVS     r3,#1
        0x000012ae:    e000        ..      B        0x12b2 ; PWM_Init + 266
        0x000012b0:    2300        .#      MOVS     r3,#0
        0x000012b2:    00db        ..      LSLS     r3,r3,#3
