747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
        0x000012b4:    431a        .C      ORRS     r2,r2,r3
        0x000012b6:    7fcb        ..      LDRB     r3,[r1,#0x1f]
        0x000012b8:    2b00        .+      CMP      r3,#0
        0x000012ba:    d001        ..      BEQ      0x12c0 ; PWM_Init + 280
        0x000012bc:    2301        .#      MOVS     r3,#1
        0x000012be:    e000        ..      B        0x12c2 ; PWM_Init + 282
        0x000012c0:    2300        .#      MOVS     r3,#0
        0x000012c2:    015b        [.      LSLS     r3,r3,#5
        0x000012c4:    431a        .C      ORRS     r2,r2,r3
        0x000012c6:    6702        .g      STR      r2,[r0,#0x70]
        0x000012c8:    7e8a        .~      LDRB     r2,[r1,#0x1a]
        0x000012ca:    2a00        .*      CMP      r2,#0
        0x000012cc:    d10e        ..      BNE      0x12ec ; PWM_Init + 324
        0x000012ce:    7eca        .~      LDRB     r2,[r1,#0x1b]
        0x000012d0:    2a00        .*      CMP      r2,#0
        0x000012d2:    d10b        ..      BNE      0x12ec ; PWM_Init + 324
        0x000012d4:    7f0a        ..      LDRB     r2,[r1,#0x1c]
        0x000012d6:    2a00        .*      CMP      r2,#0
        0x000012d8:    d108        ..      BNE      0x12ec ; PWM_Init + 324
        0x000012da:    7f4a        J.      LDRB     r2,[r1,#0x1d]
        0x000012dc:    2a00        .*      CMP      r2,#0
        0x000012de:    d105        ..      BNE      0x12ec ; PWM_Init + 324
        0x000012e0:    7f8a        ..      LDRB     r2,[r1,#0x1e]
        0x000012e2:    2a00        .*      CMP      r2,#0
        0x000012e4:    d102        ..      BNE      0x12ec ; PWM_Init + 324
        0x000012e6:    7fc9        ..      LDRB     r1,[r1,#0x1f]
        0x000012e8:    2900        .)      CMP      r1,#0
        0x000012ea:    d007        ..      BEQ      0x12fc ; PWM_Init + 340
        0x000012ec:    4907        .I      LDR      r1,[pc,#28] ; [0x130c] = 0xbffba000
        0x000012ee:    1840        @.      ADDS     r0,r0,r1
        0x000012f0:    4907        .I      LDR      r1,[pc,#28] ; [0x1310] = 0xe000e100
        0x000012f2:    d005        ..      BEQ      0x1300 ; PWM_Init + 344
        0x000012f4:    2880        .(      CMP      r0,#0x80
        0x000012f6:    d101        ..      BNE      0x12fc ; PWM_Init + 340
        0x000012f8:    2010        .       MOVS     r0,#0x10
        0x000012fa:    6008        .`      STR      r0,[r1,#0]
        0x000012fc:    bc10        ..      POP      {r4}
        0x000012fe:    4770        pG      BX       lr
        0x00001300:    2080        .       MOVS     r0,#0x80
        0x00001302:    6008        .`      STR      r0,[r1,#0]
        0x00001304:    bc10        ..      POP      {r4}
        0x00001306:    4770        pG      BX       lr
    $d
        0x00001308:    40046400    .d.@    DCD    1074029568
        0x0000130c:    bffba000    ....    DCD    3220938752
        0x00001310:    e000e100    ....    DCD    3758153984
    $t
    i.PWM_Start
    PWM_Start
        0x00001314:    4902        .I      LDR      r1,[pc,#8] ; [0x1320] = 0x40046400
        0x00001316:    680a        .h      LDR      r2,[r1,#0]
        0x00001318:    4302        .C      ORRS     r2,r2,r0
        0x0000131a:    600a        .`      STR      r2,[r1,#0]
        0x0000131c:    4770        pG      BX       lr
    $d
        0x0000131e:    0000        ..      DCW    0
        0x00001320:    40046400    .d.@    DCD    1074029568
    $t
    i.SoftwareInit
    SoftwareInit
        0x00001324:    b510        ..      PUSH     {r4,lr}
        0x00001326:    f000ff1f    ....    BL       debug_gpio_init ; 0x2168
        0x0000132a:    f000ff83    ....    BL       foc_if_init ; 0x2234
        0x0000132e:    4902        .I      LDR      r1,[pc,#8] ; [0x1338] = 0x2000194c
        0x00001330:    2001        .       MOVS     r0,#1
        0x00001332:    7008        .p      STRB     r0,[r1,#0]
        0x00001334:    bd10        ..      POP      {r4,pc}
    $d
        0x00001336:    0000        ..      DCW    0
        0x00001338:    2000194c    L..     DCD    536877388
    $t
    i.SysTick_Handler
    SysTick_Handler
        0x0000133c:    b510        ..      PUSH     {r4,lr}
        0x0000133e:    4806        .H      LDR      r0,[pc,#24] ; [0x1358] = 0x20000e9c
        0x00001340:    6801        .h      LDR      r1,[r0,#0]
        0x00001342:    2900        .)      CMP      r1,#0
        0x00001344:    d002        ..      BEQ      0x134c ; SysTick_Handler + 16
        0x00001346:    6801        .h      LDR      r1,[r0,#0]
        0x00001348:    1e49        I.      SUBS     r1,r1,#1
        0x0000134a:    6001        .`      STR      r1,[r0,#0]
        0x0000134c:    f000ff8c    ....    BL       foc_if_loop ; 0x2268
        0x00001350:    f001fb6e    ..n.    BL       user_1ms_task ; 0x2a30
        0x00001354:    bd10        ..      POP      {r4,pc}
    $d
        0x00001356:    0000        ..      DCW    0
        0x00001358:    20000e9c    ...     DCD    536874652
    $t
    i.SystemCoreClockUpdate
    SystemCoreClockUpdate
        0x0000135c:    b510        ..      PUSH     {r4,lr}
        0x0000135e:    2201        ."      MOVS     r2,#1
        0x00001360:    0792        ..      LSLS     r2,r2,#30
        0x00001362:    6810        .h      LDR      r0,[r2,#0]
        0x00001364:    4916        .I      LDR      r1,[pc,#88] ; [0x13c0] = 0xb71b00
        0x00001366:    4c17        .L      LDR      r4,[pc,#92] ; [0x13c4] = 0x2000116c
        0x00001368:    07c0        ..      LSLS     r0,r0,#31
        0x0000136a:    d001        ..      BEQ      0x1370 ; SystemCoreClockUpdate + 20
        0x0000136c:    6021        !`      STR      r1,[r4,#0]
        0x0000136e:    e021        !.      B        0x13b4 ; SystemCoreClockUpdate + 88
        0x00001370:    6810        .h      LDR      r0,[r2,#0]
        0x00001372:    06c0        ..      LSLS     r0,r0,#27
        0x00001374:    0f40        @.      LSRS     r0,r0,#29
        0x00001376:    d006        ..      BEQ      0x1386 ; SystemCoreClockUpdate + 42
        0x00001378:    2801        .(      CMP      r0,#1
        0x0000137a:    d008        ..      BEQ      0x138e ; SystemCoreClockUpdate + 50
        0x0000137c:    2803        .(      CMP      r0,#3
        0x0000137e:    d010        ..      BEQ      0x13a2 ; SystemCoreClockUpdate + 70
        0x00001380:    2804        .(      CMP      r0,#4
        0x00001382:    d111        ..      BNE      0x13a8 ; SystemCoreClockUpdate + 76
        0x00001384:    e00f        ..      B        0x13a6 ; SystemCoreClockUpdate + 74
        0x00001386:    207d        }       MOVS     r0,#0x7d
        0x00001388:    0200        ..      LSLS     r0,r0,#8
        0x0000138a:    6020         `      STR      r0,[r4,#0]
        0x0000138c:    e00c        ..      B        0x13a8 ; SystemCoreClockUpdate + 76
        0x0000138e:    480e        .H      LDR      r0,[pc,#56] ; [0x13c8] = 0x400aa040
        0x00001390:    6800        .h      LDR      r0,[r0,#0]
        0x00001392:    0780        ..      LSLS     r0,r0,#30
        0x00001394:    d501        ..      BPL      0x139a ; SystemCoreClockUpdate + 62
        0x00001396:    6021        !`      STR      r1,[r4,#0]
        0x00001398:    e000        ..      B        0x139c ; SystemCoreClockUpdate + 64
        0x0000139a:    6021        !`      STR      r1,[r4,#0]
        0x0000139c:    480b        .H      LDR      r0,[pc,#44] ; [0x13cc] = 0x55d4a80
        0x0000139e:    6020         `      STR      r0,[r4,#0]
        0x000013a0:    e002        ..      B        0x13a8 ; SystemCoreClockUpdate + 76
        0x000013a2:    6021        !`      STR      r1,[r4,#0]
        0x000013a4:    e000        ..      B        0x13a8 ; SystemCoreClockUpdate + 76
        0x000013a6:    6021        !`      STR      r1,[r4,#0]
        0x000013a8:    6810        .h      LDR      r0,[r2,#0]
        0x000013aa:    0780        ..      LSLS     r0,r0,#30
        0x000013ac:    d502        ..      BPL      0x13b4 ; SystemCoreClockUpdate + 88
        0x000013ae:    6820         h      LDR      r0,[r4,#0]
        0x000013b0:    08c0        ..      LSRS     r0,r0,#3
        0x000013b2:    6020         `      STR      r0,[r4,#0]
        0x000013b4:    4906        .I      LDR      r1,[pc,#24] ; [0x13d0] = 0xf4240
        0x000013b6:    6820         h      LDR      r0,[r4,#0]
        0x000013b8:    f7fefebc    ....    BL       __aeabi_uidiv ; 0x134
        0x000013bc:    6060        ``      STR      r0,[r4,#4]
        0x000013be:    bd10        ..      POP      {r4,pc}
    $d
        0x000013c0:    00b71b00    ....    DCD    12000000
        0x000013c4:    2000116c    l..     DCD    536875372
        0x000013c8:    400aa040    @..@    DCD    1074438208
        0x000013cc:    055d4a80    .J].    DCD    90000000
        0x000013d0:    000f4240    @B..    DCD    1000000
    $t
    i.SystemInit
    SystemInit
        0x000013d4:    b510        ..      PUSH     {r4,lr}
        0x000013d6:    2001        .       MOVS     r0,#1
        0x000013d8:    0780        ..      LSLS     r0,r0,#30
        0x000013da:    6881        .h      LDR      r1,[r0,#8]
        0x000013dc:    1142        B.      ASRS     r2,r0,#5
        0x000013de:    4311        .C      ORRS     r1,r1,r2
        0x000013e0:    6081        .`      STR      r1,[r0,#8]
        0x000013e2:    4c25        %L      LDR      r4,[pc,#148] ; [0x1478] = 0x40000080
        0x000013e4:    69e0        .i      LDR      r0,[r4,#0x1c]
        0x000013e6:    0f40        @.      LSRS     r0,r0,#29
        0x000013e8:    2805        .(      CMP      r0,#5
        0x000013ea:    d104        ..      BNE      0x13f6 ; SystemInit + 34
        0x000013ec:    69e0        .i      LDR      r0,[r4,#0x1c]
        0x000013ee:    4923        #I      LDR      r1,[pc,#140] ; [0x147c] = 0x400aa000
        0x000013f0:    00c0        ..      LSLS     r0,r0,#3
        0x000013f2:    08c0        ..      LSRS     r0,r0,#3
        0x000013f4:    6088        .`      STR      r0,[r1,#8]
        0x000013f6:    205a        Z       MOVS     r0,#0x5a
        0x000013f8:    f7fffc24    ..$.    BL       Flash_Param_at_xMHz ; 0xc44
        0x000013fc:    2000        .       MOVS     r0,#0
        0x000013fe:    f001faf7    ....    BL       switchToPLL ; 0x29f0
        0x00001402:    f7ffffab    ....    BL       SystemCoreClockUpdate ; 0x135c
        0x00001406:    481f        .H      LDR      r0,[pc,#124] ; [0x1484] = 0x2000116c
        0x00001408:    491d        .I      LDR      r1,[pc,#116] ; [0x1480] = 0xf4240
        0x0000140a:    6800        .h      LDR      r0,[r0,#0]
        0x0000140c:    f7fefe92    ....    BL       __aeabi_uidiv ; 0x134
        0x00001410:    f7fffc18    ....    BL       Flash_Param_at_xMHz ; 0xc44
        0x00001414:    2105        .!      MOVS     r1,#5
        0x00001416:    481c        .H      LDR      r0,[pc,#112] ; [0x1488] = 0x4004a000
        0x00001418:    0409        ..      LSLS     r1,r1,#16
        0x0000141a:    60c1        .`      STR      r1,[r0,#0xc]
        0x0000141c:    bf00        ..      NOP      
        0x0000141e:    bf00        ..      NOP      
        0x00001420:    bf00        ..      NOP      
        0x00001422:    bf00        ..      NOP      
        0x00001424:    bf00        ..      NOP      
        0x00001426:    bf00        ..      NOP      
        0x00001428:    bf00        ..      NOP      
        0x0000142a:    2103        .!      MOVS     r1,#3
        0x0000142c:    0409        ..      LSLS     r1,r1,#16
        0x0000142e:    60c1        .`      STR      r1,[r0,#0xc]
        0x00001430:    4816        .H      LDR      r0,[pc,#88] ; [0x148c] = 0x400a0200
        0x00001432:    6901        .i      LDR      r1,[r0,#0x10]
        0x00001434:    2203        ."      MOVS     r2,#3
        0x00001436:    0292        ..      LSLS     r2,r2,#10
        0x00001438:    4391        .C      BICS     r1,r1,r2
        0x0000143a:    6101        .a      STR      r1,[r0,#0x10]
        0x0000143c:    4814        .H      LDR      r0,[pc,#80] ; [0x1490] = 0x400a0100
        0x0000143e:    6901        .i      LDR      r1,[r0,#0x10]
        0x00001440:    2205        ."      MOVS     r2,#5
        0x00001442:    0312        ..      LSLS     r2,r2,#12
        0x00001444:    4391        .C      BICS     r1,r1,r2
        0x00001446:    6101        .a      STR      r1,[r0,#0x10]
        0x00001448:    4812        .H      LDR      r0,[pc,#72] ; [0x1494] = 0x400aa040
        0x0000144a:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x0000144c:    0909        ..      LSRS     r1,r1,#4
        0x0000144e:    0109        ..      LSLS     r1,r1,#4
        0x00001450:    6341        Ac      STR      r1,[r0,#0x34]
        0x00001452:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x00001454:    68e2        .h      LDR      r2,[r4,#0xc]
        0x00001456:    0712        ..      LSLS     r2,r2,#28
        0x00001458:    0f12        ..      LSRS     r2,r2,#28
        0x0000145a:    4311        .C      ORRS     r1,r1,r2
        0x0000145c:    6341        Ac      STR      r1,[r0,#0x34]
        0x0000145e:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x00001460:    220f        ."      MOVS     r2,#0xf
        0x00001462:    0512        ..      LSLS     r2,r2,#20
        0x00001464:    4391        .C      BICS     r1,r1,r2
        0x00001466:    6341        Ac      STR      r1,[r0,#0x34]
        0x00001468:    6b41        Ak      LDR      r1,[r0,#0x34]
        0x0000146a:    68e2        .h      LDR      r2,[r4,#0xc]
        0x0000146c:    0312        ..      LSLS     r2,r2,#12
        0x0000146e:    0f12        ..      LSRS     r2,r2,#28
        0x00001470:    0512        ..      LSLS     r2,r2,#20
        0x00001472:    4311        .C      ORRS     r1,r1,r2
        0x00001474:    6341        Ac      STR      r1,[r0,#0x34]
        0x00001476:    bd10        ..      POP      {r4,pc}
    $d
        0x00001478:    40000080    ...@    DCD    1073741952
        0x0000147c:    400aa000    ...@    DCD    1074438144
        0x00001480:    000f4240    @B..    DCD    1000000
        0x00001484:    2000116c    l..     DCD    536875372
        0x00001488:    4004a000    ...@    DCD    1074044928
        0x0000148c:    400a0200    ...@    DCD    1074397696
        0x00001490:    400a0100    ...@    DCD    1074397440
        0x00001494:    400aa040    @..@    DCD    1074438208
    $t
    i.TIMR0_Handler
    TIMR0_Handler
        0x00001498:    4901        .I      LDR      r1,[pc,#4] ; [0x14a0] = 0x40046800
        0x0000149a:    2001        .       MOVS     r0,#1
        0x0000149c:    6148        Ha      STR      r0,[r1,#0x14]
        0x0000149e:    4770        pG      BX       lr
    $d
        0x000014a0:    40046800    .h.@    DCD    1074030592
    $t
    i.TIMR1_Handler
    TIMR1_Handler
        0x000014a4:    b510        ..      PUSH     {r4,lr}
        0x000014a6:    4802        .H      LDR      r0,[pc,#8] ; [0x14b0] = 0x40046840
        0x000014a8:    f000f804    ....    BL       TIMR_INTClr ; 0x14b4
        0x000014ac:    bd10        ..      POP      {r4,pc}
    $d
        0x000014ae:    0000        ..      DCW    0
        0x000014b0:    40046840    @h.@    DCD    1074030656
    $t
    i.TIMR_INTClr
    TIMR_INTClr
        0x000014b4:    2101        .!      MOVS     r1,#1
        0x000014b6:    6141        Aa      STR      r1,[r0,#0x14]
        0x000014b8:    4770        pG      BX       lr
    i.UART_Close
    UART_Close
        0x000014ba:    6841        Ah      LDR      r1,[r0,#4]
        0x000014bc:    2201        ."      MOVS     r2,#1
        0x000014be:    0252        R.      LSLS     r2,r2,#9
        0x000014c0:    4391        .C      BICS     r1,r1,r2
        0x000014c2:    6041        A`      STR      r1,[r0,#4]
        0x000014c4:    4770        pG      BX       lr
        0x000014c6:    0000        ..      MOVS     r0,r0
    i.UART_Init
    UART_Init
        0x000014c8:    b5f8        ..      PUSH     {r3-r7,lr}
        0x000014ca:    4604        .F      MOV      r4,r0
        0x000014cc:    460d        .F      MOV      r5,r1
        0x000014ce:    483c        <H      LDR      r0,[pc,#240] ; [0x15c0] = 0xbffbe000
        0x000014d0:    1826        &.      ADDS     r6,r4,r0
        0x000014d2:    2001        .       MOVS     r0,#1
        0x000014d4:    0780        ..      LSLS     r0,r0,#30
        0x000014d6:    14c1        ..      ASRS     r1,r0,#19
        0x000014d8:    1a77        w.      SUBS     r7,r6,r1
        0x000014da:    2e00        ..      CMP      r6,#0
        0x000014dc:    d002        ..      BEQ      0x14e4 ; UART_Init + 28
        0x000014de:    2f00        ./      CMP      r7,#0
        0x000014e0:    d109        ..      BNE      0x14f6 ; UART_Init + 46
        0x000014e2:    e004        ..      B        0x14ee ; UART_Init + 38
        0x000014e4:    6881        .h      LDR      r1,[r0,#8]
        0x000014e6:    2240        @"      MOVS     r2,#0x40
        0x000014e8:    4311        .C      ORRS     r1,r1,r2
        0x000014ea:    6081        .`      STR      r1,[r0,#8]
        0x000014ec:    e003        ..      B        0x14f6 ; UART_Init + 46
        0x000014ee:    6881        .h      LDR      r1,[r0,#8]
        0x000014f0:    2280        ."      MOVS     r2,#0x80
        0x000014f2:    4311        .C      ORRS     r1,r1,r2
        0x000014f4:    6081        .`      STR      r1,[r0,#8]
        0x000014f6:    4620         F      MOV      r0,r4
        0x000014f8:    f7ffffdf    ....    BL       UART_Close ; 0x14ba
        0x000014fc:    68a0        .h      LDR      r0,[r4,#8]
        0x000014fe:    4931        1I      LDR      r1,[pc,#196] ; [0x15c4] = 0xfffc000
        0x00001500:    4008        .@      ANDS     r0,r0,r1
        0x00001502:    60a0        .`      STR      r0,[r4,#8]
        0x00001504:    4830        0H      LDR      r0,[pc,#192] ; [0x15c8] = 0x2000116c
        0x00001506:    6829        )h      LDR      r1,[r5,#0]
        0x00001508:    6800        .h      LDR      r0,[r0,#0]
        0x0000150a:    f7fefe13    ....    BL       __aeabi_uidiv ; 0x134
        0x0000150e:    1e40        @.      SUBS     r0,r0,#1
        0x00001510:    2104        .!      MOVS     r1,#4
        0x00001512:    41c8        .A      RORS     r0,r0,r1
        0x00001514:    68a1        .h      LDR      r1,[r4,#8]
        0x00001516:    4308        .C      ORRS     r0,r0,r1
        0x00001518:    60a0        .`      STR      r0,[r4,#8]
        0x0000151a:    6860        `h      LDR      r0,[r4,#4]
        0x0000151c:    213f        ?!      MOVS     r1,#0x3f
        0x0000151e:    0489        ..      LSLS     r1,r1,#18
        0x00001520:    4388        .C      BICS     r0,r0,r1
        0x00001522:    6060        ``      STR      r0,[r4,#4]
        0x00001524:    6860        `h      LDR      r0,[r4,#4]
        0x00001526:    7929        )y      LDRB     r1,[r5,#4]
        0x00001528:    79aa        .y      LDRB     r2,[r5,#6]
        0x0000152a:    0489        ..      LSLS     r1,r1,#18
        0x0000152c:    4308        .C      ORRS     r0,r0,r1
        0x0000152e:    7969        iy      LDRB     r1,[r5,#5]
        0x00001530:    04c9        ..      LSLS     r1,r1,#19
        0x00001532:    0592        ..      LSLS     r2,r2,#22
        0x00001534:    4311        .C      ORRS     r1,r1,r2
        0x00001536:    4308        .C      ORRS     r0,r0,r1
        0x00001538:    6060        ``      STR      r0,[r4,#4]
        0x0000153a:    68e0        .h      LDR      r0,[r4,#0xc]
        0x0000153c:    b280        ..      UXTH     r0,r0
        0x0000153e:    60e0        .`      STR      r0,[r4,#0xc]
        0x00001540:    79e8        .y      LDRB     r0,[r5,#7]
        0x00001542:    7a69        iz      LDRB     r1,[r5,#9]
        0x00001544:    0400        ..      LSLS     r0,r0,#16
        0x00001546:    0609        ..      LSLS     r1,r1,#24
        0x00001548:    4308        .C      ORRS     r0,r0,r1
        0x0000154a:    68e1        .h      LDR      r1,[r4,#0xc]
        0x0000154c:    4308        .C      ORRS     r0,r0,r1
        0x0000154e:    60e0        .`      STR      r0,[r4,#0xc]
        0x00001550:    69e0        .i      LDR      r0,[r4,#0x1c]
        0x00001552:    0b00        ..      LSRS     r0,r0,#12
        0x00001554:    0300        ..      LSLS     r0,r0,#12
        0x00001556:    61e0        .a      STR      r0,[r4,#0x1c]
        0x00001558:    69e0        .i      LDR      r0,[r4,#0x1c]
        0x0000155a:    7ae9        .z      LDRB     r1,[r5,#0xb]
        0x0000155c:    2201        ."      MOVS     r2,#1
        0x0000155e:    0312        ..      LSLS     r2,r2,#12
        0x00001560:    1889        ..      ADDS     r1,r1,r2
        0x00001562:    4308        .C      ORRS     r0,r0,r1
        0x00001564:    61e0        .a      STR      r0,[r4,#0x1c]
        0x00001566:    6860        `h      LDR      r0,[r4,#4]
        0x00001568:    4918        .I      LDR      r1,[pc,#96] ; [0x15cc] = 0xffffbfeb
        0x0000156a:    4008        .@      ANDS     r0,r0,r1
        0x0000156c:    6060        ``      STR      r0,[r4,#4]
        0x0000156e:    6860        `h      LDR      r0,[r4,#4]
        0x00001570:    7a29        )z      LDRB     r1,[r5,#8]
        0x00001572:    7b2a        *{      LDRB     r2,[r5,#0xc]
        0x00001574:    0109        ..      LSLS     r1,r1,#4
        0x00001576:    4308        .C      ORRS     r0,r0,r1
        0x00001578:    7aa9        .z      LDRB     r1,[r5,#0xa]
        0x0000157a:    0089        ..      LSLS     r1,r1,#2
        0x0000157c:    0392        ..      LSLS     r2,r2,#14
        0x0000157e:    4311        .C      ORRS     r1,r1,r2
        0x00001580:    4308        .C      ORRS     r0,r0,r1
        0x00001582:    6060        ``      STR      r0,[r4,#4]
        0x00001584:    2001        .       MOVS     r0,#1
        0x00001586:    4a12        .J      LDR      r2,[pc,#72] ; [0x15d0] = 0xe000e100
        0x00001588:    4b12        .K      LDR      r3,[pc,#72] ; [0x15d4] = 0xe000e180
        0x0000158a:    2e00        ..      CMP      r6,#0
        0x0000158c:    d00b        ..      BEQ      0x15a6 ; UART_Init + 222
        0x0000158e:    2f00        ./      CMP      r7,#0
        0x00001590:    d108        ..      BNE      0x15a4 ; UART_Init + 220
        0x00001592:    7a28        (z      LDRB     r0,[r5,#8]
        0x00001594:    7aa9        .z      LDRB     r1,[r5,#0xa]
        0x00001596:    4308        .C      ORRS     r0,r0,r1
        0x00001598:    7b29        ){      LDRB     r1,[r5,#0xc]
        0x0000159a:    4308        .C      ORRS     r0,r0,r1
        0x0000159c:    2108        .!      MOVS     r1,#8
        0x0000159e:    2800        .(      CMP      r0,#0
        0x000015a0:    d00b        ..      BEQ      0x15ba ; UART_Init + 242
        0x000015a2:    6011        .`      STR      r1,[r2,#0]
        0x000015a4:    bdf8        ..      POP      {r3-r7,pc}
        0x000015a6:    7a29        )z      LDRB     r1,[r5,#8]
        0x000015a8:    7aac        .z      LDRB     r4,[r5,#0xa]
        0x000015aa:    4321        !C      ORRS     r1,r1,r4
        0x000015ac:    7b2c        ,{      LDRB     r4,[r5,#0xc]
        0x000015ae:    4321        !C      ORRS     r1,r1,r4
        0x000015b0:    d001        ..      BEQ      0x15b6 ; UART_Init + 238
        0x000015b2:    6010        .`      STR      r0,[r2,#0]
        0x000015b4:    bdf8        ..      POP      {r3-r7,pc}
        0x000015b6:    6018        .`      STR      r0,[r3,#0]
        0x000015b8:    bdf8        ..      POP      {r3-r7,pc}
        0x000015ba:    6019        .`      STR      r1,[r3,#0]
        0x000015bc:    bdf8        ..      POP      {r3-r7,pc}
    $d
        0x000015be:    0000        ..      DCW    0
        0x000015c0:    bffbe000    ....    DCD    3220955136
        0x000015c4:    0fffc000    ....    DCD    268419072
        0x000015c8:    2000116c    l..     DCD    536875372
