747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
        0x000015cc:    ffffbfeb    ....    DCD    4294950891
        0x000015d0:    e000e100    ....    DCD    3758153984
        0x000015d4:    e000e180    ....    DCD    3758154112
    $t
    i.UART_IsTXFIFOFull
    UART_IsTXFIFOFull
        0x000015d8:    6840        @h      LDR      r0,[r0,#4]
        0x000015da:    0780        ..      LSLS     r0,r0,#30
        0x000015dc:    0fc0        ..      LSRS     r0,r0,#31
        0x000015de:    4770        pG      BX       lr
    i.UART_Open
    UART_Open
        0x000015e0:    6841        Ah      LDR      r1,[r0,#4]
        0x000015e2:    2201        ."      MOVS     r2,#1
        0x000015e4:    0252        R.      LSLS     r2,r2,#9
        0x000015e6:    4311        .C      ORRS     r1,r1,r2
        0x000015e8:    6041        A`      STR      r1,[r0,#4]
        0x000015ea:    4770        pG      BX       lr
    i.UART_WriteByte
    UART_WriteByte
        0x000015ec:    6001        .`      STR      r1,[r0,#0]
        0x000015ee:    4770        pG      BX       lr
    i.__0printf
    __0printf
    __1printf
    __2printf
    __c89printf
    printf
        0x000015f0:    b40f        ..      PUSH     {r0-r3}
        0x000015f2:    b510        ..      PUSH     {r4,lr}
        0x000015f4:    a903        ..      ADD      r1,sp,#0xc
        0x000015f6:    4b04        .K      LDR      r3,[pc,#16] ; [0x1608] = 0x284d
        0x000015f8:    4a04        .J      LDR      r2,[pc,#16] ; [0x160c] = 0x20001174
        0x000015fa:    9802        ..      LDR      r0,[sp,#8]
        0x000015fc:    f000f8da    ....    BL       _printf_core ; 0x17b4
        0x00001600:    bc10        ..      POP      {r4}
        0x00001602:    bc08        ..      POP      {r3}
        0x00001604:    b004        ..      ADD      sp,sp,#0x10
        0x00001606:    4718        .G      BX       r3
    $d
        0x00001608:    0000284d    M(..    DCD    10317
        0x0000160c:    20001174    t..     DCD    536875380
    $t
    i.__ARM_clz
    __ARM_clz
        0x00001610:    2120         !      MOVS     r1,#0x20
        0x00001612:    0c02        ..      LSRS     r2,r0,#16
        0x00001614:    d001        ..      BEQ      0x161a ; __ARM_clz + 10
        0x00001616:    2110        .!      MOVS     r1,#0x10
        0x00001618:    4610        .F      MOV      r0,r2
        0x0000161a:    0a02        ..      LSRS     r2,r0,#8
        0x0000161c:    d001        ..      BEQ      0x1622 ; __ARM_clz + 18
        0x0000161e:    3908        .9      SUBS     r1,r1,#8
        0x00001620:    4610        .F      MOV      r0,r2
        0x00001622:    0902        ..      LSRS     r2,r0,#4
        0x00001624:    d001        ..      BEQ      0x162a ; __ARM_clz + 26
        0x00001626:    1f09        ..      SUBS     r1,r1,#4
        0x00001628:    4610        .F      MOV      r0,r2
        0x0000162a:    0882        ..      LSRS     r2,r0,#2
        0x0000162c:    d001        ..      BEQ      0x1632 ; __ARM_clz + 34
        0x0000162e:    1e89        ..      SUBS     r1,r1,#2
        0x00001630:    4610        .F      MOV      r0,r2
        0x00001632:    0842        B.      LSRS     r2,r0,#1
        0x00001634:    d001        ..      BEQ      0x163a ; __ARM_clz + 42
        0x00001636:    1e88        ..      SUBS     r0,r1,#2
        0x00001638:    4770        pG      BX       lr
        0x0000163a:    1a08        ..      SUBS     r0,r1,r0
        0x0000163c:    4770        pG      BX       lr
    i.__scatterload_copy
    __scatterload_copy
        0x0000163e:    e002        ..      B        0x1646 ; __scatterload_copy + 8
        0x00001640:    c808        ..      LDM      r0!,{r3}
        0x00001642:    1f12        ..      SUBS     r2,r2,#4
        0x00001644:    c108        ..      STM      r1!,{r3}
        0x00001646:    2a00        .*      CMP      r2,#0
        0x00001648:    d1fa        ..      BNE      0x1640 ; __scatterload_copy + 2
        0x0000164a:    4770        pG      BX       lr
    i.__scatterload_null
    __scatterload_null
        0x0000164c:    4770        pG      BX       lr
    i.__scatterload_zeroinit
    __scatterload_zeroinit
        0x0000164e:    2000        .       MOVS     r0,#0
        0x00001650:    e001        ..      B        0x1656 ; __scatterload_zeroinit + 8
        0x00001652:    c101        ..      STM      r1!,{r0}
        0x00001654:    1f12        ..      SUBS     r2,r2,#4
        0x00001656:    2a00        .*      CMP      r2,#0
        0x00001658:    d1fb        ..      BNE      0x1652 ; __scatterload_zeroinit + 4
        0x0000165a:    4770        pG      BX       lr
    i._fp_digits
    _fp_digits
        0x0000165c:    b5f0        ..      PUSH     {r4-r7,lr}
        0x0000165e:    b41f        ..      PUSH     {r0-r4}
        0x00001660:    b084        ..      SUB      sp,sp,#0x10
        0x00001662:    9807        ..      LDR      r0,[sp,#0x1c]
        0x00001664:    9906        ..      LDR      r1,[sp,#0x18]
        0x00001666:    0d02        ..      LSRS     r2,r0,#20
        0x00001668:    4301        .C      ORRS     r1,r1,r0
        0x0000166a:    d10f        ..      BNE      0x168c ; _fp_digits + 48
        0x0000166c:    980f        ..      LDR      r0,[sp,#0x3c]
        0x0000166e:    2401        .$      MOVS     r4,#1
        0x00001670:    a349        I.      ADR      r3,{pc}+0x128 ; 0x1798
        0x00001672:    2801        .(      CMP      r0,#1
        0x00001674:    d007        ..      BEQ      0x1686 ; _fp_digits + 42
        0x00001676:    9804        ..      LDR      r0,[sp,#0x10]
        0x00001678:    9a0f        ..      LDR      r2,[sp,#0x3c]
        0x0000167a:    6084        .`      STR      r4,[r0,#8]
        0x0000167c:    6003        .`      STR      r3,[r0,#0]
        0x0000167e:    60c2        .`      STR      r2,[r0,#0xc]
        0x00001680:    6041        A`      STR      r1,[r0,#4]
        0x00001682:    b009        ..      ADD      sp,sp,#0x24
        0x00001684:    bdf0        ..      POP      {r4-r7,pc}
        0x00001686:    980e        ..      LDR      r0,[sp,#0x38]
        0x00001688:    43c1        .C      MVNS     r1,r0
        0x0000168a:    e7f4        ..      B        0x1676 ; _fp_digits + 26
        0x0000168c:    4843        CH      LDR      r0,[pc,#268] ; [0x179c] = 0xfffffc01
        0x0000168e:    4944        DI      LDR      r1,[pc,#272] ; [0x17a0] = 0x4d10
        0x00001690:    1810        ..      ADDS     r0,r2,r0
        0x00001692:    4348        HC      MULS     r0,r1,r0
        0x00001694:    1405        ..      ASRS     r5,r0,#16
        0x00001696:    980f        ..      LDR      r0,[sp,#0x3c]
        0x00001698:    2801        .(      CMP      r0,#1
        0x0000169a:    980e        ..      LDR      r0,[sp,#0x38]
        0x0000169c:    d00b        ..      BEQ      0x16b6 ; _fp_digits + 90
        0x0000169e:    1a28        (.      SUBS     r0,r5,r0
        0x000016a0:    1c40        @.      ADDS     r0,r0,#1
        0x000016a2:    2400        .$      MOVS     r4,#0
        0x000016a4:    4e3f        ?N      LDR      r6,[pc,#252] ; [0x17a4] = 0x40240000
        0x000016a6:    4940        @I      LDR      r1,[pc,#256] ; [0x17a8] = 0x3ff00000
        0x000016a8:    9400        ..      STR      r4,[sp,#0]
        0x000016aa:    9101        ..      STR      r1,[sp,#4]
        0x000016ac:    9002        ..      STR      r0,[sp,#8]
        0x000016ae:    2800        .(      CMP      r0,#0
        0x000016b0:    da03        ..      BGE      0x16ba ; _fp_digits + 94
        0x000016b2:    4247        GB      RSBS     r7,r0,#0
        0x000016b4:    e016        ..      B        0x16e4 ; _fp_digits + 136
        0x000016b6:    4240        @B      RSBS     r0,r0,#0
        0x000016b8:    e7f3        ..      B        0x16a2 ; _fp_digits + 70
        0x000016ba:    4607        .F      MOV      r7,r0
        0x000016bc:    e012        ..      B        0x16e4 ; _fp_digits + 136
        0x000016be:    07f8        ..      LSLS     r0,r7,#31
        0x000016c0:    d007        ..      BEQ      0x16d2 ; _fp_digits + 118
        0x000016c2:    4622        "F      MOV      r2,r4
        0x000016c4:    4633        3F      MOV      r3,r6
        0x000016c6:    9901        ..      LDR      r1,[sp,#4]
        0x000016c8:    9800        ..      LDR      r0,[sp,#0]
        0x000016ca:    f7fefe0d    ....    BL       __aeabi_dmul ; 0x2e8
        0x000016ce:    9101        ..      STR      r1,[sp,#4]
        0x000016d0:    9000        ..      STR      r0,[sp,#0]
        0x000016d2:    4622        "F      MOV      r2,r4
        0x000016d4:    4633        3F      MOV      r3,r6
        0x000016d6:    4610        .F      MOV      r0,r2
        0x000016d8:    4619        .F      MOV      r1,r3
        0x000016da:    f7fefe05    ....    BL       __aeabi_dmul ; 0x2e8
        0x000016de:    4604        .F      MOV      r4,r0
        0x000016e0:    460e        .F      MOV      r6,r1
        0x000016e2:    107f        ..      ASRS     r7,r7,#1
        0x000016e4:    2f00        ./      CMP      r7,#0
        0x000016e6:    d1ea        ..      BNE      0x16be ; _fp_digits + 98
        0x000016e8:    9802        ..      LDR      r0,[sp,#8]
        0x000016ea:    9b01        ..      LDR      r3,[sp,#4]
        0x000016ec:    2800        .(      CMP      r0,#0
        0x000016ee:    9a00        ..      LDR      r2,[sp,#0]
        0x000016f0:    9907        ..      LDR      r1,[sp,#0x1c]
        0x000016f2:    9806        ..      LDR      r0,[sp,#0x18]
        0x000016f4:    da02        ..      BGE      0x16fc ; _fp_digits + 160
        0x000016f6:    f7fefdf7    ....    BL       __aeabi_dmul ; 0x2e8
        0x000016fa:    e001        ..      B        0x1700 ; _fp_digits + 164
        0x000016fc:    f7fefe5c    ..\.    BL       __aeabi_ddiv ; 0x3b8
        0x00001700:    4604        .F      MOV      r4,r0
        0x00001702:    460e        .F      MOV      r6,r1
        0x00001704:    2200        ."      MOVS     r2,#0
        0x00001706:    4b29        )K      LDR      r3,[pc,#164] ; [0x17ac] = 0x43f00000
        0x00001708:    f7feff48    ..H.    BL       __aeabi_cdrcmple ; 0x59c
        0x0000170c:    d803        ..      BHI      0x1716 ; _fp_digits + 186
        0x0000170e:    2000        .       MOVS     r0,#0
        0x00001710:    43c0        .C      MVNS     r0,r0
        0x00001712:    4601        .F      MOV      r1,r0
        0x00001714:    e007        ..      B        0x1726 ; _fp_digits + 202
        0x00001716:    2200        ."      MOVS     r2,#0
        0x00001718:    4b25        %K      LDR      r3,[pc,#148] ; [0x17b0] = 0x3fe00000
        0x0000171a:    4620         F      MOV      r0,r4
        0x0000171c:    4631        1F      MOV      r1,r6
        0x0000171e:    f7fefd31    ..1.    BL       __aeabi_dadd ; 0x184
        0x00001722:    f7fff813    ....    BL       __aeabi_d2ulz ; 0x74c
        0x00001726:    2410        .$      MOVS     r4,#0x10
        0x00001728:    e009        ..      B        0x173e ; _fp_digits + 226
        0x0000172a:    2c00        .,      CMP      r4,#0
        0x0000172c:    db0a        ..      BLT      0x1744 ; _fp_digits + 232
        0x0000172e:    220a        ."      MOVS     r2,#0xa
        0x00001730:    2300        .#      MOVS     r3,#0
        0x00001732:    f7feff47    ..G.    BL       __aeabi_uldivmod ; 0x5c4
        0x00001736:    9b05        ..      LDR      r3,[sp,#0x14]
        0x00001738:    3230        02      ADDS     r2,r2,#0x30
        0x0000173a:    551a        .U      STRB     r2,[r3,r4]
        0x0000173c:    1e64        d.      SUBS     r4,r4,#1
        0x0000173e:    4602        .F      MOV      r2,r0
        0x00001740:    430a        .C      ORRS     r2,r2,r1
        0x00001742:    d1f2        ..      BNE      0x172a ; _fp_digits + 206
        0x00001744:    1c64        d.      ADDS     r4,r4,#1
        0x00001746:    2211        ."      MOVS     r2,#0x11
        0x00001748:    9b05        ..      LDR      r3,[sp,#0x14]
        0x0000174a:    1b12        ..      SUBS     r2,r2,r4
        0x0000174c:    191c        ..      ADDS     r4,r3,r4
        0x0000174e:    9b0f        ..      LDR      r3,[sp,#0x3c]
        0x00001750:    2b01        .+      CMP      r3,#1
        0x00001752:    d008        ..      BEQ      0x1766 ; _fp_digits + 266
        0x00001754:    2301        .#      MOVS     r3,#1
        0x00001756:    4308        .C      ORRS     r0,r0,r1
        0x00001758:    d102        ..      BNE      0x1760 ; _fp_digits + 260
        0x0000175a:    980e        ..      LDR      r0,[sp,#0x38]
        0x0000175c:    4282        .B      CMP      r2,r0
        0x0000175e:    dd0d        ..      BLE      0x177c ; _fp_digits + 288
        0x00001760:    2300        .#      MOVS     r3,#0
        0x00001762:    1c6d        m.      ADDS     r5,r5,#1
        0x00001764:    e00e        ..      B        0x1784 ; _fp_digits + 296
        0x00001766:    4308        .C      ORRS     r0,r0,r1
        0x00001768:    d103        ..      BNE      0x1772 ; _fp_digits + 278
        0x0000176a:    980e        ..      LDR      r0,[sp,#0x38]
        0x0000176c:    1a15        ..      SUBS     r5,r2,r0
        0x0000176e:    1e6d        m.      SUBS     r5,r5,#1
        0x00001770:    e00a        ..      B        0x1788 ; _fp_digits + 300
        0x00001772:    2011        .       MOVS     r0,#0x11
        0x00001774:    900e        ..      STR      r0,[sp,#0x38]
        0x00001776:    2000        .       MOVS     r0,#0
        0x00001778:    900f        ..      STR      r0,[sp,#0x3c]
        0x0000177a:    e78c        ..      B        0x1696 ; _fp_digits + 58
        0x0000177c:    4282        .B      CMP      r2,r0
        0x0000177e:    da01        ..      BGE      0x1784 ; _fp_digits + 296
        0x00001780:    2300        .#      MOVS     r3,#0
        0x00001782:    1e6d        m.      SUBS     r5,r5,#1
        0x00001784:    2b00        .+      CMP      r3,#0
        0x00001786:    d086        ..      BEQ      0x1696 ; _fp_digits + 58
        0x00001788:    9804        ..      LDR      r0,[sp,#0x10]
        0x0000178a:    990f        ..      LDR      r1,[sp,#0x3c]
        0x0000178c:    6045        E`      STR      r5,[r0,#4]
        0x0000178e:    6004        .`      STR      r4,[r0,#0]
        0x00001790:    6082        .`      STR      r2,[r0,#8]
        0x00001792:    60c1        .`      STR      r1,[r0,#0xc]
        0x00001794:    e775        u.      B        0x1682 ; _fp_digits + 38
    $d
        0x00001796:    0000        ..      DCW    0
        0x00001798:    00000030    0...    DCD    48
        0x0000179c:    fffffc01    ....    DCD    4294966273
        0x000017a0:    00004d10    .M..    DCD    19728
        0x000017a4:    40240000    ..$@    DCD    1076101120
        0x000017a8:    3ff00000    ...?    DCD    1072693248
        0x000017ac:    43f00000    ...C    DCD    1139802112
        0x000017b0:    3fe00000    ...?    DCD    1071644672
    $t
    i._printf_core
    _printf_core
        0x000017b4:    b5ff        ..      PUSH     {r0-r7,lr}
        0x000017b6:    b097        ..      SUB      sp,sp,#0x5c
        0x000017b8:    4606        .F      MOV      r6,r0
        0x000017ba:    2500        .%      MOVS     r5,#0
        0x000017bc:    e21f        ..      B        0x1bfe ; _printf_core + 1098
        0x000017be:    2825        %(      CMP      r0,#0x25
        0x000017c0:    d179        y.      BNE      0x18b6 ; _printf_core + 258
        0x000017c2:    2400        .$      MOVS     r4,#0
        0x000017c4:    49f9        .I      LDR      r1,[pc,#996] ; [0x1bac] = 0x12809
        0x000017c6:    4627        'F      MOV      r7,r4
        0x000017c8:    1c76        v.      ADDS     r6,r6,#1
        0x000017ca:    9404        ..      STR      r4,[sp,#0x10]
        0x000017cc:    7832        2x      LDRB     r2,[r6,#0]
        0x000017ce:    2001        .       MOVS     r0,#1
        0x000017d0:    3a20         :      SUBS     r2,r2,#0x20
        0x000017d2:    4090        .@      LSLS     r0,r0,r2
        0x000017d4:    4602        .F      MOV      r2,r0
        0x000017d6:    420a        .B      TST      r2,r1
        0x000017d8:    d002        ..      BEQ      0x17e0 ; _printf_core + 44
        0x000017da:    4304        .C      ORRS     r4,r4,r0
        0x000017dc:    1c76        v.      ADDS     r6,r6,#1
        0x000017de:    e7f5        ..      B        0x17cc ; _printf_core + 24
        0x000017e0:    7830        0x      LDRB     r0,[r6,#0]
        0x000017e2:    282a        *(      CMP      r0,#0x2a
        0x000017e4:    d00e        ..      BEQ      0x1804 ; _printf_core + 80
        0x000017e6:    2202        ."      MOVS     r2,#2
        0x000017e8:    7830        0x      LDRB     r0,[r6,#0]
        0x000017ea:    4601        .F      MOV      r1,r0
        0x000017ec:    3930        09      SUBS     r1,r1,#0x30
        0x000017ee:    2909        .)      CMP      r1,#9
        0x000017f0:    d816        ..      BHI      0x1820 ; _printf_core + 108
        0x000017f2:    9904        ..      LDR      r1,[sp,#0x10]
        0x000017f4:    230a        .#      MOVS     r3,#0xa
        0x000017f6:    4359        YC      MULS     r1,r3,r1
        0x000017f8:    3930        09      SUBS     r1,r1,#0x30
        0x000017fa:    1840        @.      ADDS     r0,r0,r1
        0x000017fc:    4314        .C      ORRS     r4,r4,r2
        0x000017fe:    1c76        v.      ADDS     r6,r6,#1
        0x00001800:    9004        ..      STR      r0,[sp,#0x10]
        0x00001802:    e7f1        ..      B        0x17e8 ; _printf_core + 52
        0x00001804:    9818        ..      LDR      r0,[sp,#0x60]
        0x00001806:    c802        ..      LDM      r0!,{r1}
        0x00001808:    9104        ..      STR      r1,[sp,#0x10]
        0x0000180a:    9018        ..      STR      r0,[sp,#0x60]
        0x0000180c:    2900        .)      CMP      r1,#0
        0x0000180e:    da04        ..      BGE      0x181a ; _printf_core + 102
        0x00001810:    2001        .       MOVS     r0,#1
        0x00001812:    0340        @.      LSLS     r0,r0,#13
        0x00001814:    4304        .C      ORRS     r4,r4,r0
        0x00001816:    4248        HB      RSBS     r0,r1,#0
        0x00001818:    9004        ..      STR      r0,[sp,#0x10]
        0x0000181a:    2002        .       MOVS     r0,#2
        0x0000181c:    4304        .C      ORRS     r4,r4,r0
        0x0000181e:    1c76        v.      ADDS     r6,r6,#1
        0x00001820:    7830        0x      LDRB     r0,[r6,#0]
        0x00001822:    282e        .(      CMP      r0,#0x2e
        0x00001824:    d114        ..      BNE      0x1850 ; _printf_core + 156
        0x00001826:    2004        .       MOVS     r0,#4
        0x00001828:    4304        .C      ORRS     r4,r4,r0
        0x0000182a:    1c76        v.      ADDS     r6,r6,#1
        0x0000182c:    7830        0x      LDRB     r0,[r6,#0]
        0x0000182e:    282a        *(      CMP      r0,#0x2a
        0x00001830:    d109        ..      BNE      0x1846 ; _printf_core + 146
        0x00001832:    9818        ..      LDR      r0,[sp,#0x60]
        0x00001834:    1c76        v.      ADDS     r6,r6,#1
        0x00001836:    c880        ..      LDM      r0!,{r7}
        0x00001838:    9018        ..      STR      r0,[sp,#0x60]
        0x0000183a:    e009        ..      B        0x1850 ; _printf_core + 156
        0x0000183c:    210a        .!      MOVS     r1,#0xa
        0x0000183e:    434f        OC      MULS     r7,r1,r7
        0x00001840:    3f30        0?      SUBS     r7,r7,#0x30
        0x00001842:    19c7        ..      ADDS     r7,r0,r7
        0x00001844:    1c76        v.      ADDS     r6,r6,#1
        0x00001846:    7830        0x      LDRB     r0,[r6,#0]
        0x00001848:    4601        .F      MOV      r1,r0
        0x0000184a:    3930        09      SUBS     r1,r1,#0x30
        0x0000184c:    2909        .)      CMP      r1,#9
        0x0000184e:    d9f5        ..      BLS      0x183c ; _printf_core + 136
        0x00001850:    7830        0x      LDRB     r0,[r6,#0]
        0x00001852:    286c        l(      CMP      r0,#0x6c
        0x00001854:    d010        ..      BEQ      0x1878 ; _printf_core + 196
        0x00001856:    dc06        ..      BGT      0x1866 ; _printf_core + 178
        0x00001858:    284c        L(      CMP      r0,#0x4c
        0x0000185a:    d01a        ..      BEQ      0x1892 ; _printf_core + 222
        0x0000185c:    2868        h(      CMP      r0,#0x68
        0x0000185e:    d00e        ..      BEQ      0x187e ; _printf_core + 202
        0x00001860:    286a        j(      CMP      r0,#0x6a
        0x00001862:    d117        ..      BNE      0x1894 ; _printf_core + 224
        0x00001864:    e004        ..      B        0x1870 ; _printf_core + 188
        0x00001866:    2874        t(      CMP      r0,#0x74
        0x00001868:    d013        ..      BEQ      0x1892 ; _printf_core + 222
        0x0000186a:    287a        z(      CMP      r0,#0x7a
        0x0000186c:    d112        ..      BNE      0x1894 ; _printf_core + 224
        0x0000186e:    e010        ..      B        0x1892 ; _printf_core + 222
        0x00001870:    2001        .       MOVS     r0,#1
        0x00001872:    0540        @.      LSLS     r0,r0,#21
        0x00001874:    4304        .C      ORRS     r4,r4,r0
        0x00001876:    e00c        ..      B        0x1892 ; _printf_core + 222
        0x00001878:    2101        .!      MOVS     r1,#1
        0x0000187a:    0509        ..      LSLS     r1,r1,#20
        0x0000187c:    e001        ..      B        0x1882 ; _printf_core + 206
        0x0000187e:    2103        .!      MOVS     r1,#3
        0x00001880:    0509        ..      LSLS     r1,r1,#20
        0x00001882:    430c        .C      ORRS     r4,r4,r1
        0x00001884:    7871        qx      LDRB     r1,[r6,#1]
        0x00001886:    4281        .B      CMP      r1,r0
        0x00001888:    d103        ..      BNE      0x1892 ; _printf_core + 222
        0x0000188a:    2001        .       MOVS     r0,#1
        0x0000188c:    1c76        v.      ADDS     r6,r6,#1
        0x0000188e:    0500        ..      LSLS     r0,r0,#20
        0x00001890:    1824        $.      ADDS     r4,r4,r0
        0x00001892:    1c76        v.      ADDS     r6,r6,#1
        0x00001894:    7830        0x      LDRB     r0,[r6,#0]
        0x00001896:    9011        ..      STR      r0,[sp,#0x44]
        0x00001898:    2866        f(      CMP      r0,#0x66
        0x0000189a:    d00b        ..      BEQ      0x18b4 ; _printf_core + 256
        0x0000189c:    dc13        ..      BGT      0x18c6 ; _printf_core + 274
        0x0000189e:    2858        X(      CMP      r0,#0x58
        0x000018a0:    d07e        ~.      BEQ      0x19a0 ; _printf_core + 492
        0x000018a2:    dc09        ..      BGT      0x18b8 ; _printf_core + 260
        0x000018a4:    2800        .(      CMP      r0,#0
        0x000018a6:    d07c        |.      BEQ      0x19a2 ; _printf_core + 494
        0x000018a8:    2845        E(      CMP      r0,#0x45
        0x000018aa:    d0f6        ..      BEQ      0x189a ; _printf_core + 230
        0x000018ac:    2846        F(      CMP      r0,#0x46
        0x000018ae:    d0f4        ..      BEQ      0x189a ; _printf_core + 230
        0x000018b0:    2847        G(      CMP      r0,#0x47
        0x000018b2:    d11a        ..      BNE      0x18ea ; _printf_core + 310
        0x000018b4:    e1aa        ..      B        0x1c0c ; _printf_core + 1112
        0x000018b6:    e018        ..      B        0x18ea ; _printf_core + 310
        0x000018b8:    2863        c(      CMP      r0,#0x63
        0x000018ba:    d036        6.      BEQ      0x192a ; _printf_core + 374
        0x000018bc:    2864        d(      CMP      r0,#0x64
        0x000018be:    d071        q.      BEQ      0x19a4 ; _printf_core + 496
        0x000018c0:    2865        e(      CMP      r0,#0x65
