747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
        0x000018c2:    d112        ..      BNE      0x18ea ; _printf_core + 310
        0x000018c4:    e1a2        ..      B        0x1c0c ; _printf_core + 1112
        0x000018c6:    2870        p(      CMP      r0,#0x70
        0x000018c8:    d06d        m.      BEQ      0x19a6 ; _printf_core + 498
        0x000018ca:    dc08        ..      BGT      0x18de ; _printf_core + 298
        0x000018cc:    2867        g(      CMP      r0,#0x67
        0x000018ce:    d0f1        ..      BEQ      0x18b4 ; _printf_core + 256
        0x000018d0:    2869        i(      CMP      r0,#0x69
        0x000018d2:    d07c        |.      BEQ      0x19ce ; _printf_core + 538
        0x000018d4:    286e        n(      CMP      r0,#0x6e
        0x000018d6:    d00d        ..      BEQ      0x18f4 ; _printf_core + 320
        0x000018d8:    286f        o(      CMP      r0,#0x6f
        0x000018da:    d106        ..      BNE      0x18ea ; _printf_core + 310
        0x000018dc:    e0bd        ..      B        0x1a5a ; _printf_core + 678
        0x000018de:    2873        s(      CMP      r0,#0x73
        0x000018e0:    d02f        /.      BEQ      0x1942 ; _printf_core + 398
        0x000018e2:    2875        u(      CMP      r0,#0x75
        0x000018e4:    d072        r.      BEQ      0x19cc ; _printf_core + 536
        0x000018e6:    2878        x(      CMP      r0,#0x78
        0x000018e8:    d05a        Z.      BEQ      0x19a0 ; _printf_core + 492
        0x000018ea:    9a1a        ..      LDR      r2,[sp,#0x68]
        0x000018ec:    9919        ..      LDR      r1,[sp,#0x64]
        0x000018ee:    4790        .G      BLX      r2
        0x000018f0:    1c6d        m.      ADDS     r5,r5,#1
        0x000018f2:    e183        ..      B        0x1bfc ; _printf_core + 1096
        0x000018f4:    0260        `.      LSLS     r0,r4,#9
        0x000018f6:    0f40        @.      LSRS     r0,r0,#29
        0x000018f8:    2802        .(      CMP      r0,#2
        0x000018fa:    d009        ..      BEQ      0x1910 ; _printf_core + 348
        0x000018fc:    2803        .(      CMP      r0,#3
        0x000018fe:    d00d        ..      BEQ      0x191c ; _printf_core + 360
        0x00001900:    2804        .(      CMP      r0,#4
        0x00001902:    9818        ..      LDR      r0,[sp,#0x60]
        0x00001904:    6801        .h      LDR      r1,[r0,#0]
        0x00001906:    d00d        ..      BEQ      0x1924 ; _printf_core + 368
        0x00001908:    1d00        ..      ADDS     r0,r0,#4
        0x0000190a:    600d        .`      STR      r5,[r1,#0]
        0x0000190c:    9018        ..      STR      r0,[sp,#0x60]
        0x0000190e:    e175        u.      B        0x1bfc ; _printf_core + 1096
        0x00001910:    9818        ..      LDR      r0,[sp,#0x60]
        0x00001912:    17ea        ..      ASRS     r2,r5,#31
        0x00001914:    c802        ..      LDM      r0!,{r1}
        0x00001916:    600d        .`      STR      r5,[r1,#0]
        0x00001918:    604a        J`      STR      r2,[r1,#4]
        0x0000191a:    e7f7        ..      B        0x190c ; _printf_core + 344
        0x0000191c:    9818        ..      LDR      r0,[sp,#0x60]
        0x0000191e:    c802        ..      LDM      r0!,{r1}
        0x00001920:    800d        ..      STRH     r5,[r1,#0]
        0x00001922:    e7f3        ..      B        0x190c ; _printf_core + 344
        0x00001924:    1d00        ..      ADDS     r0,r0,#4
        0x00001926:    700d        .p      STRB     r5,[r1,#0]
        0x00001928:    e7f0        ..      B        0x190c ; _printf_core + 344
        0x0000192a:    9818        ..      LDR      r0,[sp,#0x60]
        0x0000192c:    466a        jF      MOV      r2,sp
        0x0000192e:    7801        .x      LDRB     r1,[r0,#0]
        0x00001930:    1d00        ..      ADDS     r0,r0,#4
        0x00001932:    7211        .r      STRB     r1,[r2,#8]
        0x00001934:    9018        ..      STR      r0,[sp,#0x60]
        0x00001936:    2000        .       MOVS     r0,#0
        0x00001938:    7250        Pr      STRB     r0,[r2,#9]
        0x0000193a:    a802        ..      ADD      r0,sp,#8
        0x0000193c:    9000        ..      STR      r0,[sp,#0]
        0x0000193e:    2001        .       MOVS     r0,#1
        0x00001940:    e005        ..      B        0x194e ; _printf_core + 410
        0x00001942:    9818        ..      LDR      r0,[sp,#0x60]
        0x00001944:    c802        ..      LDM      r0!,{r1}
        0x00001946:    9018        ..      STR      r0,[sp,#0x60]
        0x00001948:    2000        .       MOVS     r0,#0
        0x0000194a:    9100        ..      STR      r1,[sp,#0]
        0x0000194c:    43c0        .C      MVNS     r0,r0
        0x0000194e:    0761        a.      LSLS     r1,r4,#29
        0x00001950:    d50d        ..      BPL      0x196e ; _printf_core + 442
        0x00001952:    2100        .!      MOVS     r1,#0
        0x00001954:    e001        ..      B        0x195a ; _printf_core + 422
        0x00001956:    9901        ..      LDR      r1,[sp,#4]
        0x00001958:    1c49        I.      ADDS     r1,r1,#1
        0x0000195a:    9101        ..      STR      r1,[sp,#4]
        0x0000195c:    42b9        .B      CMP      r1,r7
        0x0000195e:    da12        ..      BGE      0x1986 ; _printf_core + 466
        0x00001960:    4281        .B      CMP      r1,r0
        0x00001962:    dbf8        ..      BLT      0x1956 ; _printf_core + 418
        0x00001964:    9a00        ..      LDR      r2,[sp,#0]
        0x00001966:    5c51        Q\      LDRB     r1,[r2,r1]
        0x00001968:    2900        .)      CMP      r1,#0
        0x0000196a:    d1f4        ..      BNE      0x1956 ; _printf_core + 418
        0x0000196c:    e00b        ..      B        0x1986 ; _printf_core + 466
        0x0000196e:    2100        .!      MOVS     r1,#0
        0x00001970:    e001        ..      B        0x1976 ; _printf_core + 450
        0x00001972:    9901        ..      LDR      r1,[sp,#4]
        0x00001974:    1c49        I.      ADDS     r1,r1,#1
        0x00001976:    9101        ..      STR      r1,[sp,#4]
        0x00001978:    4281        .B      CMP      r1,r0
        0x0000197a:    dbfa        ..      BLT      0x1972 ; _printf_core + 446
        0x0000197c:    9a01        ..      LDR      r2,[sp,#4]
        0x0000197e:    9900        ..      LDR      r1,[sp,#0]
        0x00001980:    5c89        .\      LDRB     r1,[r1,r2]
        0x00001982:    2900        .)      CMP      r1,#0
        0x00001984:    d1f5        ..      BNE      0x1972 ; _printf_core + 446
        0x00001986:    9901        ..      LDR      r1,[sp,#4]
        0x00001988:    9804        ..      LDR      r0,[sp,#0x10]
        0x0000198a:    9b1a        ..      LDR      r3,[sp,#0x68]
        0x0000198c:    1a47        G.      SUBS     r7,r0,r1
        0x0000198e:    4621        !F      MOV      r1,r4
        0x00001990:    4638        8F      MOV      r0,r7
        0x00001992:    9a19        ..      LDR      r2,[sp,#0x64]
        0x00001994:    f000fa9a    ....    BL       _printf_pre_padding ; 0x1ecc
        0x00001998:    9901        ..      LDR      r1,[sp,#4]
        0x0000199a:    1940        @.      ADDS     r0,r0,r5
        0x0000199c:    1845        E.      ADDS     r5,r0,r1
        0x0000199e:    e00b        ..      B        0x19b8 ; _printf_core + 516
        0x000019a0:    e051        Q.      B        0x1a46 ; _printf_core + 658
        0x000019a2:    e130        0.      B        0x1c06 ; _printf_core + 1106
        0x000019a4:    e013        ..      B        0x19ce ; _printf_core + 538
        0x000019a6:    e050        P.      B        0x1a4a ; _printf_core + 662
        0x000019a8:    9800        ..      LDR      r0,[sp,#0]
        0x000019aa:    9900        ..      LDR      r1,[sp,#0]
        0x000019ac:    7800        .x      LDRB     r0,[r0,#0]
        0x000019ae:    1c49        I.      ADDS     r1,r1,#1
        0x000019b0:    9100        ..      STR      r1,[sp,#0]
        0x000019b2:    9a1a        ..      LDR      r2,[sp,#0x68]
        0x000019b4:    9919        ..      LDR      r1,[sp,#0x64]
        0x000019b6:    4790        .G      BLX      r2
        0x000019b8:    9801        ..      LDR      r0,[sp,#4]
        0x000019ba:    1e40        @.      SUBS     r0,r0,#1
        0x000019bc:    9001        ..      STR      r0,[sp,#4]
        0x000019be:    1c40        @.      ADDS     r0,r0,#1
        0x000019c0:    d1f2        ..      BNE      0x19a8 ; _printf_core + 500
        0x000019c2:    4621        !F      MOV      r1,r4
        0x000019c4:    4638        8F      MOV      r0,r7
        0x000019c6:    9b1a        ..      LDR      r3,[sp,#0x68]
        0x000019c8:    9a19        ..      LDR      r2,[sp,#0x64]
        0x000019ca:    e114        ..      B        0x1bf6 ; _printf_core + 1090
        0x000019cc:    e039        9.      B        0x1a42 ; _printf_core + 654
        0x000019ce:    200a        .       MOVS     r0,#0xa
        0x000019d0:    2100        .!      MOVS     r1,#0
        0x000019d2:    9000        ..      STR      r0,[sp,#0]
        0x000019d4:    9101        ..      STR      r1,[sp,#4]
        0x000019d6:    0260        `.      LSLS     r0,r4,#9
        0x000019d8:    0f41        A.      LSRS     r1,r0,#29
        0x000019da:    2902        .)      CMP      r1,#2
        0x000019dc:    d007        ..      BEQ      0x19ee ; _printf_core + 570
        0x000019de:    9a18        ..      LDR      r2,[sp,#0x60]
        0x000019e0:    ca01        ..      LDM      r2!,{r0}
        0x000019e2:    9218        ..      STR      r2,[sp,#0x60]
        0x000019e4:    17c2        ..      ASRS     r2,r0,#31
        0x000019e6:    4694        .F      MOV      r12,r2
        0x000019e8:    2903        .)      CMP      r1,#3
        0x000019ea:    d00a        ..      BEQ      0x1a02 ; _printf_core + 590
        0x000019ec:    e00c        ..      B        0x1a08 ; _printf_core + 596
        0x000019ee:    9818        ..      LDR      r0,[sp,#0x60]
        0x000019f0:    1dc0        ..      ADDS     r0,r0,#7
        0x000019f2:    08c1        ..      LSRS     r1,r0,#3
        0x000019f4:    00c9        ..      LSLS     r1,r1,#3
        0x000019f6:    684a        Jh      LDR      r2,[r1,#4]
        0x000019f8:    6808        .h      LDR      r0,[r1,#0]
        0x000019fa:    3108        .1      ADDS     r1,r1,#8
        0x000019fc:    4694        .F      MOV      r12,r2
        0x000019fe:    9118        ..      STR      r1,[sp,#0x60]
        0x00001a00:    e007        ..      B        0x1a12 ; _printf_core + 606
        0x00001a02:    b200        ..      SXTH     r0,r0
        0x00001a04:    17c2        ..      ASRS     r2,r0,#31
        0x00001a06:    4694        .F      MOV      r12,r2
        0x00001a08:    2904        .)      CMP      r1,#4
        0x00001a0a:    d102        ..      BNE      0x1a12 ; _printf_core + 606
        0x00001a0c:    b240        @.      SXTB     r0,r0
        0x00001a0e:    17c1        ..      ASRS     r1,r0,#31
        0x00001a10:    468c        .F      MOV      r12,r1
        0x00001a12:    2200        ."      MOVS     r2,#0
        0x00001a14:    4661        aF      MOV      r1,r12
        0x00001a16:    4594        .E      CMP      r12,r2
        0x00001a18:    da06        ..      BGE      0x1a28 ; _printf_core + 628
        0x00001a1a:    460a        .F      MOV      r2,r1
        0x00001a1c:    2100        .!      MOVS     r1,#0
        0x00001a1e:    4240        @B      RSBS     r0,r0,#0
        0x00001a20:    4191        .A      SBCS     r1,r1,r2
        0x00001a22:    468c        .F      MOV      r12,r1
        0x00001a24:    212d        -!      MOVS     r1,#0x2d
        0x00001a26:    e002        ..      B        0x1a2e ; _printf_core + 634
        0x00001a28:    0521        !.      LSLS     r1,r4,#20
        0x00001a2a:    d504        ..      BPL      0x1a36 ; _printf_core + 642
        0x00001a2c:    212b        +!      MOVS     r1,#0x2b
        0x00001a2e:    466a        jF      MOV      r2,sp
        0x00001a30:    7311        .s      STRB     r1,[r2,#0xc]
        0x00001a32:    2101        .!      MOVS     r1,#1
        0x00001a34:    e003        ..      B        0x1a3e ; _printf_core + 650
        0x00001a36:    07e1        ..      LSLS     r1,r4,#31
        0x00001a38:    d001        ..      BEQ      0x1a3e ; _printf_core + 650
        0x00001a3a:    2120         !      MOVS     r1,#0x20
        0x00001a3c:    e7f7        ..      B        0x1a2e ; _printf_core + 634
        0x00001a3e:    9102        ..      STR      r1,[sp,#8]
        0x00001a40:    e051        Q.      B        0x1ae6 ; _printf_core + 818
        0x00001a42:    200a        .       MOVS     r0,#0xa
        0x00001a44:    e00a        ..      B        0x1a5c ; _printf_core + 680
        0x00001a46:    2010        .       MOVS     r0,#0x10
        0x00001a48:    e008        ..      B        0x1a5c ; _printf_core + 680
        0x00001a4a:    2010        .       MOVS     r0,#0x10
        0x00001a4c:    9000        ..      STR      r0,[sp,#0]
        0x00001a4e:    2100        .!      MOVS     r1,#0
        0x00001a50:    2004        .       MOVS     r0,#4
        0x00001a52:    4304        .C      ORRS     r4,r4,r0
        0x00001a54:    9101        ..      STR      r1,[sp,#4]
        0x00001a56:    2708        .'      MOVS     r7,#8
        0x00001a58:    e003        ..      B        0x1a62 ; _printf_core + 686
        0x00001a5a:    2008        .       MOVS     r0,#8
        0x00001a5c:    2100        .!      MOVS     r1,#0
        0x00001a5e:    9101        ..      STR      r1,[sp,#4]
        0x00001a60:    9000        ..      STR      r0,[sp,#0]
        0x00001a62:    0260        `.      LSLS     r0,r4,#9
        0x00001a64:    0f41        A.      LSRS     r1,r0,#29
        0x00001a66:    2902        .)      CMP      r1,#2
        0x00001a68:    d007        ..      BEQ      0x1a7a ; _printf_core + 710
        0x00001a6a:    9a18        ..      LDR      r2,[sp,#0x60]
        0x00001a6c:    ca01        ..      LDM      r2!,{r0}
        0x00001a6e:    9218        ..      STR      r2,[sp,#0x60]
        0x00001a70:    2200        ."      MOVS     r2,#0
        0x00001a72:    4694        .F      MOV      r12,r2
        0x00001a74:    2903        .)      CMP      r1,#3
        0x00001a76:    d00a        ..      BEQ      0x1a8e ; _printf_core + 730
        0x00001a78:    e00a        ..      B        0x1a90 ; _printf_core + 732
        0x00001a7a:    9818        ..      LDR      r0,[sp,#0x60]
        0x00001a7c:    1dc0        ..      ADDS     r0,r0,#7
        0x00001a7e:    08c1        ..      LSRS     r1,r0,#3
        0x00001a80:    00c9        ..      LSLS     r1,r1,#3
        0x00001a82:    684a        Jh      LDR      r2,[r1,#4]
        0x00001a84:    6808        .h      LDR      r0,[r1,#0]
        0x00001a86:    3108        .1      ADDS     r1,r1,#8
        0x00001a88:    4694        .F      MOV      r12,r2
        0x00001a8a:    9118        ..      STR      r1,[sp,#0x60]
        0x00001a8c:    e003        ..      B        0x1a96 ; _printf_core + 738
        0x00001a8e:    b280        ..      UXTH     r0,r0
        0x00001a90:    2904        .)      CMP      r1,#4
        0x00001a92:    d100        ..      BNE      0x1a96 ; _printf_core + 738
        0x00001a94:    b2c0        ..      UXTB     r0,r0
        0x00001a96:    2100        .!      MOVS     r1,#0
        0x00001a98:    9102        ..      STR      r1,[sp,#8]
        0x00001a9a:    0721        !.      LSLS     r1,r4,#28
        0x00001a9c:    d523        #.      BPL      0x1ae6 ; _printf_core + 818
        0x00001a9e:    9911        ..      LDR      r1,[sp,#0x44]
        0x00001aa0:    2970        p)      CMP      r1,#0x70
        0x00001aa2:    d028        (.      BEQ      0x1af6 ; _printf_core + 834
        0x00001aa4:    9a00        ..      LDR      r2,[sp,#0]
        0x00001aa6:    2110        .!      MOVS     r1,#0x10
        0x00001aa8:    9b01        ..      LDR      r3,[sp,#4]
        0x00001aaa:    404a        J@      EORS     r2,r2,r1
        0x00001aac:    431a        .C      ORRS     r2,r2,r3
        0x00001aae:    d109        ..      BNE      0x1ac4 ; _printf_core + 784
        0x00001ab0:    4661        aF      MOV      r1,r12
        0x00001ab2:    4301        .C      ORRS     r1,r1,r0
        0x00001ab4:    d006        ..      BEQ      0x1ac4 ; _printf_core + 784
        0x00001ab6:    2130        0!      MOVS     r1,#0x30
        0x00001ab8:    466a        jF      MOV      r2,sp
        0x00001aba:    7311        .s      STRB     r1,[r2,#0xc]
        0x00001abc:    9911        ..      LDR      r1,[sp,#0x44]
        0x00001abe:    7351        Qs      STRB     r1,[r2,#0xd]
        0x00001ac0:    2102        .!      MOVS     r1,#2
        0x00001ac2:    9102        ..      STR      r1,[sp,#8]
        0x00001ac4:    9a00        ..      LDR      r2,[sp,#0]
        0x00001ac6:    2108        .!      MOVS     r1,#8
        0x00001ac8:    9b01        ..      LDR      r3,[sp,#4]
        0x00001aca:    404a        J@      EORS     r2,r2,r1
        0x00001acc:    431a        .C      ORRS     r2,r2,r3
        0x00001ace:    d10a        ..      BNE      0x1ae6 ; _printf_core + 818
        0x00001ad0:    4661        aF      MOV      r1,r12
        0x00001ad2:    4301        .C      ORRS     r1,r1,r0
        0x00001ad4:    d101        ..      BNE      0x1ada ; _printf_core + 806
        0x00001ad6:    0761        a.      LSLS     r1,r4,#29
        0x00001ad8:    d505        ..      BPL      0x1ae6 ; _printf_core + 818
        0x00001ada:    2130        0!      MOVS     r1,#0x30
        0x00001adc:    466a        jF      MOV      r2,sp
        0x00001ade:    7311        .s      STRB     r1,[r2,#0xc]
        0x00001ae0:    2101        .!      MOVS     r1,#1
        0x00001ae2:    1e7f        ..      SUBS     r7,r7,#1
        0x00001ae4:    9102        ..      STR      r1,[sp,#8]
        0x00001ae6:    9911        ..      LDR      r1,[sp,#0x44]
        0x00001ae8:    2958        X)      CMP      r1,#0x58
        0x00001aea:    d009        ..      BEQ      0x1b00 ; _printf_core + 844
        0x00001aec:    a130        0.      ADR      r1,{pc}+0xc4 ; 0x1bb0
        0x00001aee:    910e        ..      STR      r1,[sp,#0x38]
        0x00001af0:    a90d        ..      ADD      r1,sp,#0x34
        0x00001af2:    910d        ..      STR      r1,[sp,#0x34]
        0x00001af4:    e012        ..      B        0x1b1c ; _printf_core + 872
        0x00001af6:    2140        @!      MOVS     r1,#0x40
        0x00001af8:    466a        jF      MOV      r2,sp
        0x00001afa:    7311        .s      STRB     r1,[r2,#0xc]
        0x00001afc:    2101        .!      MOVS     r1,#1
        0x00001afe:    e7e0        ..      B        0x1ac2 ; _printf_core + 782
        0x00001b00:    a130        0.      ADR      r1,{pc}+0xc4 ; 0x1bc4
        0x00001b02:    e7f4        ..      B        0x1aee ; _printf_core + 826
        0x00001b04:    4661        aF      MOV      r1,r12
        0x00001b06:    9b01        ..      LDR      r3,[sp,#4]
        0x00001b08:    9a00        ..      LDR      r2,[sp,#0]
        0x00001b0a:    f7fefd5b    ..[.    BL       __aeabi_uldivmod ; 0x5c4
        0x00001b0e:    9b0e        ..      LDR      r3,[sp,#0x38]
        0x00001b10:    468c        .F      MOV      r12,r1
        0x00001b12:    5c9b        .\      LDRB     r3,[r3,r2]
        0x00001b14:    9a0d        ..      LDR      r2,[sp,#0x34]
        0x00001b16:    1e52        R.      SUBS     r2,r2,#1
        0x00001b18:    920d        ..      STR      r2,[sp,#0x34]
        0x00001b1a:    7013        .p      STRB     r3,[r2,#0]
        0x00001b1c:    4661        aF      MOV      r1,r12
        0x00001b1e:    4301        .C      ORRS     r1,r1,r0
        0x00001b20:    d1f0        ..      BNE      0x1b04 ; _printf_core + 848
        0x00001b22:    980d        ..      LDR      r0,[sp,#0x34]
        0x00001b24:    a905        ..      ADD      r1,sp,#0x14
        0x00001b26:    1a08        ..      SUBS     r0,r1,r0
        0x00001b28:    3020         0      ADDS     r0,r0,#0x20
        0x00001b2a:    9001        ..      STR      r0,[sp,#4]
        0x00001b2c:    0760        `.      LSLS     r0,r4,#29
        0x00001b2e:    d503        ..      BPL      0x1b38 ; _printf_core + 900
        0x00001b30:    2001        .       MOVS     r0,#1
        0x00001b32:    0400        ..      LSLS     r0,r0,#16
        0x00001b34:    4384        .C      BICS     r4,r4,r0
        0x00001b36:    e000        ..      B        0x1b3a ; _printf_core + 902
        0x00001b38:    2701        .'      MOVS     r7,#1
        0x00001b3a:    9801        ..      LDR      r0,[sp,#4]
        0x00001b3c:    4287        .B      CMP      r7,r0
        0x00001b3e:    dd01        ..      BLE      0x1b44 ; _printf_core + 912
        0x00001b40:    1a38        8.      SUBS     r0,r7,r0
        0x00001b42:    e000        ..      B        0x1b46 ; _printf_core + 914
        0x00001b44:    2000        .       MOVS     r0,#0
        0x00001b46:    9901        ..      LDR      r1,[sp,#4]
        0x00001b48:    9000        ..      STR      r0,[sp,#0]
        0x00001b4a:    1841        A.      ADDS     r1,r0,r1
        0x00001b4c:    9802        ..      LDR      r0,[sp,#8]
        0x00001b4e:    1809        ..      ADDS     r1,r1,r0
        0x00001b50:    9804        ..      LDR      r0,[sp,#0x10]
        0x00001b52:    1a40        @.      SUBS     r0,r0,r1
        0x00001b54:    9004        ..      STR      r0,[sp,#0x10]
        0x00001b56:    03e0        ..      LSLS     r0,r4,#15
        0x00001b58:    d406        ..      BMI      0x1b68 ; _printf_core + 948
        0x00001b5a:    4621        !F      MOV      r1,r4
        0x00001b5c:    9b1a        ..      LDR      r3,[sp,#0x68]
        0x00001b5e:    9a19        ..      LDR      r2,[sp,#0x64]
        0x00001b60:    9804        ..      LDR      r0,[sp,#0x10]
        0x00001b62:    f000f9b3    ....    BL       _printf_pre_padding ; 0x1ecc
        0x00001b66:    1945        E.      ADDS     r5,r0,r5
        0x00001b68:    2700        .'      MOVS     r7,#0
        0x00001b6a:    e006        ..      B        0x1b7a ; _printf_core + 966
        0x00001b6c:    a803        ..      ADD      r0,sp,#0xc
        0x00001b6e:    9a1a        ..      LDR      r2,[sp,#0x68]
        0x00001b70:    5dc0        .]      LDRB     r0,[r0,r7]
        0x00001b72:    9919        ..      LDR      r1,[sp,#0x64]
        0x00001b74:    4790        .G      BLX      r2
        0x00001b76:    1c6d        m.      ADDS     r5,r5,#1
        0x00001b78:    1c7f        ..      ADDS     r7,r7,#1
        0x00001b7a:    9802        ..      LDR      r0,[sp,#8]
        0x00001b7c:    4287        .B      CMP      r7,r0
        0x00001b7e:    dbf5        ..      BLT      0x1b6c ; _printf_core + 952
        0x00001b80:    03e0        ..      LSLS     r0,r4,#15
        0x00001b82:    d50c        ..      BPL      0x1b9e ; _printf_core + 1002
        0x00001b84:    4621        !F      MOV      r1,r4
        0x00001b86:    9b1a        ..      LDR      r3,[sp,#0x68]
        0x00001b88:    9a19        ..      LDR      r2,[sp,#0x64]
        0x00001b8a:    9804        ..      LDR      r0,[sp,#0x10]
        0x00001b8c:    f000f99e    ....    BL       _printf_pre_padding ; 0x1ecc
        0x00001b90:    1945        E.      ADDS     r5,r0,r5
        0x00001b92:    e004        ..      B        0x1b9e ; _printf_core + 1002
        0x00001b94:    9a1a        ..      LDR      r2,[sp,#0x68]
        0x00001b96:    2030        0       MOVS     r0,#0x30
        0x00001b98:    9919        ..      LDR      r1,[sp,#0x64]
        0x00001b9a:    4790        .G      BLX      r2
        0x00001b9c:    1c6d        m.      ADDS     r5,r5,#1
        0x00001b9e:    9900        ..      LDR      r1,[sp,#0]
        0x00001ba0:    1e48        H.      SUBS     r0,r1,#1
