747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
        0x00001ba2:    9000        ..      STR      r0,[sp,#0]
        0x00001ba4:    2900        .)      CMP      r1,#0
        0x00001ba6:    dcf5        ..      BGT      0x1b94 ; _printf_core + 992
        0x00001ba8:    e01f        ..      B        0x1bea ; _printf_core + 1078
    $d
        0x00001baa:    0000        ..      DCW    0
        0x00001bac:    00012809    .(..    DCD    75785
        0x00001bb0:    33323130    0123    DCD    858927408
        0x00001bb4:    37363534    4567    DCD    926299444
        0x00001bb8:    62613938    89ab    DCD    1650538808
        0x00001bbc:    66656463    cdef    DCD    1717920867
        0x00001bc0:    00000000    ....    DCD    0
        0x00001bc4:    33323130    0123    DCD    858927408
        0x00001bc8:    37363534    4567    DCD    926299444
        0x00001bcc:    42413938    89AB    DCD    1111570744
        0x00001bd0:    46454443    CDEF    DCD    1178944579
        0x00001bd4:    00000000    ....    DCD    0
    $t
        0x00001bd8:    980d        ..      LDR      r0,[sp,#0x34]
        0x00001bda:    990d        ..      LDR      r1,[sp,#0x34]
        0x00001bdc:    7800        .x      LDRB     r0,[r0,#0]
        0x00001bde:    1c49        I.      ADDS     r1,r1,#1
        0x00001be0:    910d        ..      STR      r1,[sp,#0x34]
        0x00001be2:    9a1a        ..      LDR      r2,[sp,#0x68]
        0x00001be4:    9919        ..      LDR      r1,[sp,#0x64]
        0x00001be6:    4790        .G      BLX      r2
        0x00001be8:    1c6d        m.      ADDS     r5,r5,#1
        0x00001bea:    9901        ..      LDR      r1,[sp,#4]
        0x00001bec:    1e48        H.      SUBS     r0,r1,#1
        0x00001bee:    9001        ..      STR      r0,[sp,#4]
        0x00001bf0:    2900        .)      CMP      r1,#0
        0x00001bf2:    dcf1        ..      BGT      0x1bd8 ; _printf_core + 1060
        0x00001bf4:    e14c        L.      B        0x1e90 ; _printf_core + 1756
        0x00001bf6:    f000f959    ..Y.    BL       _printf_post_padding ; 0x1eac
        0x00001bfa:    1945        E.      ADDS     r5,r0,r5
        0x00001bfc:    1c76        v.      ADDS     r6,r6,#1
        0x00001bfe:    7830        0x      LDRB     r0,[r6,#0]
        0x00001c00:    2800        .(      CMP      r0,#0
        0x00001c02:    d000        ..      BEQ      0x1c06 ; _printf_core + 1106
        0x00001c04:    e5db        ..      B        0x17be ; _printf_core + 10
        0x00001c06:    4628        (F      MOV      r0,r5
        0x00001c08:    b01b        ..      ADD      sp,sp,#0x6c
        0x00001c0a:    bdf0        ..      POP      {r4-r7,pc}
        0x00001c0c:    0760        `.      LSLS     r0,r4,#29
        0x00001c0e:    d400        ..      BMI      0x1c12 ; _printf_core + 1118
        0x00001c10:    2706        .'      MOVS     r7,#6
        0x00001c12:    9818        ..      LDR      r0,[sp,#0x60]
        0x00001c14:    1dc0        ..      ADDS     r0,r0,#7
        0x00001c16:    08c1        ..      LSRS     r1,r0,#3
        0x00001c18:    00c9        ..      LSLS     r1,r1,#3
        0x00001c1a:    6848        Hh      LDR      r0,[r1,#4]
        0x00001c1c:    680a        .h      LDR      r2,[r1,#0]
        0x00001c1e:    3108        .1      ADDS     r1,r1,#8
        0x00001c20:    0fc3        ..      LSRS     r3,r0,#31
        0x00001c22:    07db        ..      LSLS     r3,r3,#31
        0x00001c24:    9118        ..      STR      r1,[sp,#0x60]
        0x00001c26:    0019        ..      MOVS     r1,r3
        0x00001c28:    d001        ..      BEQ      0x1c2e ; _printf_core + 1146
        0x00001c2a:    a19c        ..      ADR      r1,{pc}+0x272 ; 0x1e9c
        0x00001c2c:    e008        ..      B        0x1c40 ; _printf_core + 1164
        0x00001c2e:    0521        !.      LSLS     r1,r4,#20
        0x00001c30:    d501        ..      BPL      0x1c36 ; _printf_core + 1154
        0x00001c32:    a19b        ..      ADR      r1,{pc}+0x26e ; 0x1ea0
        0x00001c34:    e004        ..      B        0x1c40 ; _printf_core + 1164
        0x00001c36:    07e1        ..      LSLS     r1,r4,#31
        0x00001c38:    d001        ..      BEQ      0x1c3e ; _printf_core + 1162
        0x00001c3a:    a19a        ..      ADR      r1,{pc}+0x26a ; 0x1ea4
        0x00001c3c:    e000        ..      B        0x1c40 ; _printf_core + 1164
        0x00001c3e:    a19a        ..      ADR      r1,{pc}+0x26a ; 0x1ea8
        0x00001c40:    0043        C.      LSLS     r3,r0,#1
        0x00001c42:    9811        ..      LDR      r0,[sp,#0x44]
        0x00001c44:    085b        [.      LSRS     r3,r3,#1
        0x00001c46:    9110        ..      STR      r1,[sp,#0x40]
        0x00001c48:    2865        e(      CMP      r0,#0x65
        0x00001c4a:    d00c        ..      BEQ      0x1c66 ; _printf_core + 1202
        0x00001c4c:    dc06        ..      BGT      0x1c5c ; _printf_core + 1192
        0x00001c4e:    2845        E(      CMP      r0,#0x45
        0x00001c50:    d009        ..      BEQ      0x1c66 ; _printf_core + 1202
        0x00001c52:    2846        F(      CMP      r0,#0x46
        0x00001c54:    d01d        ..      BEQ      0x1c92 ; _printf_core + 1246
        0x00001c56:    2847        G(      CMP      r0,#0x47
        0x00001c58:    d141        A.      BNE      0x1cde ; _printf_core + 1322
        0x00001c5a:    e041        A.      B        0x1ce0 ; _printf_core + 1324
        0x00001c5c:    2866        f(      CMP      r0,#0x66
        0x00001c5e:    d018        ..      BEQ      0x1c92 ; _printf_core + 1246
        0x00001c60:    2867        g(      CMP      r0,#0x67
        0x00001c62:    d13c        <.      BNE      0x1cde ; _printf_core + 1322
        0x00001c64:    e03c        <.      B        0x1ce0 ; _printf_core + 1324
        0x00001c66:    2100        .!      MOVS     r1,#0
        0x00001c68:    2f11        ./      CMP      r7,#0x11
        0x00001c6a:    db01        ..      BLT      0x1c70 ; _printf_core + 1212
        0x00001c6c:    2011        .       MOVS     r0,#0x11
        0x00001c6e:    e000        ..      B        0x1c72 ; _printf_core + 1214
        0x00001c70:    1c78        x.      ADDS     r0,r7,#1
        0x00001c72:    9101        ..      STR      r1,[sp,#4]
        0x00001c74:    9000        ..      STR      r0,[sp,#0]
        0x00001c76:    a908        ..      ADD      r1,sp,#0x20
        0x00001c78:    a811        ..      ADD      r0,sp,#0x44
        0x00001c7a:    f7fffcef    ....    BL       _fp_digits ; 0x165c
        0x00001c7e:    9913        ..      LDR      r1,[sp,#0x4c]
        0x00001c80:    9105        ..      STR      r1,[sp,#0x14]
        0x00001c82:    2100        .!      MOVS     r1,#0
        0x00001c84:    9a11        ..      LDR      r2,[sp,#0x44]
        0x00001c86:    9215        ..      STR      r2,[sp,#0x54]
        0x00001c88:    1c7f        ..      ADDS     r7,r7,#1
        0x00001c8a:    9812        ..      LDR      r0,[sp,#0x48]
        0x00001c8c:    9701        ..      STR      r7,[sp,#4]
        0x00001c8e:    9100        ..      STR      r1,[sp,#0]
        0x00001c90:    e050        P.      B        0x1d34 ; _printf_core + 1408
        0x00001c92:    2001        .       MOVS     r0,#1
        0x00001c94:    07c0        ..      LSLS     r0,r0,#31
        0x00001c96:    9003        ..      STR      r0,[sp,#0xc]
        0x00001c98:    2001        .       MOVS     r0,#1
        0x00001c9a:    9001        ..      STR      r0,[sp,#4]
        0x00001c9c:    a908        ..      ADD      r1,sp,#0x20
        0x00001c9e:    9700        ..      STR      r7,[sp,#0]
        0x00001ca0:    a811        ..      ADD      r0,sp,#0x44
        0x00001ca2:    f7fffcdb    ....    BL       _fp_digits ; 0x165c
        0x00001ca6:    9a13        ..      LDR      r2,[sp,#0x4c]
        0x00001ca8:    9914        ..      LDR      r1,[sp,#0x50]
        0x00001caa:    9205        ..      STR      r2,[sp,#0x14]
        0x00001cac:    2200        ."      MOVS     r2,#0
        0x00001cae:    9b11        ..      LDR      r3,[sp,#0x44]
        0x00001cb0:    9200        ..      STR      r2,[sp,#0]
        0x00001cb2:    9812        ..      LDR      r0,[sp,#0x48]
        0x00001cb4:    9315        ..      STR      r3,[sp,#0x54]
        0x00001cb6:    9a05        ..      LDR      r2,[sp,#0x14]
        0x00001cb8:    9201        ..      STR      r2,[sp,#4]
        0x00001cba:    2900        .)      CMP      r1,#0
        0x00001cbc:    d001        ..      BEQ      0x1cc2 ; _printf_core + 1294
        0x00001cbe:    4610        .F      MOV      r0,r2
        0x00001cc0:    e002        ..      B        0x1cc8 ; _printf_core + 1300
        0x00001cc2:    1c79        y.      ADDS     r1,r7,#1
        0x00001cc4:    1840        @.      ADDS     r0,r0,r1
        0x00001cc6:    9001        ..      STR      r0,[sp,#4]
        0x00001cc8:    1a38        8.      SUBS     r0,r7,r0
        0x00001cca:    d501        ..      BPL      0x1cd0 ; _printf_core + 1308
        0x00001ccc:    9801        ..      LDR      r0,[sp,#4]
        0x00001cce:    e004        ..      B        0x1cda ; _printf_core + 1318
        0x00001cd0:    4240        @B      RSBS     r0,r0,#0
        0x00001cd2:    1e40        @.      SUBS     r0,r0,#1
        0x00001cd4:    9000        ..      STR      r0,[sp,#0]
        0x00001cd6:    1c78        x.      ADDS     r0,r7,#1
        0x00001cd8:    9001        ..      STR      r0,[sp,#4]
        0x00001cda:    1bc0        ..      SUBS     r0,r0,r7
        0x00001cdc:    9002        ..      STR      r0,[sp,#8]
        0x00001cde:    e043        C.      B        0x1d68 ; _printf_core + 1460
        0x00001ce0:    2f01        ./      CMP      r7,#1
        0x00001ce2:    da00        ..      BGE      0x1ce6 ; _printf_core + 1330
        0x00001ce4:    2701        .'      MOVS     r7,#1
        0x00001ce6:    2100        .!      MOVS     r1,#0
        0x00001ce8:    2f11        ./      CMP      r7,#0x11
        0x00001cea:    dd01        ..      BLE      0x1cf0 ; _printf_core + 1340
        0x00001cec:    2011        .       MOVS     r0,#0x11
        0x00001cee:    e000        ..      B        0x1cf2 ; _printf_core + 1342
        0x00001cf0:    4638        8F      MOV      r0,r7
        0x00001cf2:    9101        ..      STR      r1,[sp,#4]
        0x00001cf4:    9000        ..      STR      r0,[sp,#0]
        0x00001cf6:    a908        ..      ADD      r1,sp,#0x20
        0x00001cf8:    a811        ..      ADD      r0,sp,#0x44
        0x00001cfa:    f7fffcaf    ....    BL       _fp_digits ; 0x165c
        0x00001cfe:    9913        ..      LDR      r1,[sp,#0x4c]
        0x00001d00:    9105        ..      STR      r1,[sp,#0x14]
        0x00001d02:    9a11        ..      LDR      r2,[sp,#0x44]
        0x00001d04:    2100        .!      MOVS     r1,#0
        0x00001d06:    9812        ..      LDR      r0,[sp,#0x48]
        0x00001d08:    9215        ..      STR      r2,[sp,#0x54]
        0x00001d0a:    9100        ..      STR      r1,[sp,#0]
        0x00001d0c:    9701        ..      STR      r7,[sp,#4]
        0x00001d0e:    0721        !.      LSLS     r1,r4,#28
        0x00001d10:    d40c        ..      BMI      0x1d2c ; _printf_core + 1400
        0x00001d12:    9905        ..      LDR      r1,[sp,#0x14]
        0x00001d14:    42b9        .B      CMP      r1,r7
        0x00001d16:    db01        ..      BLT      0x1d1c ; _printf_core + 1384
        0x00001d18:    9901        ..      LDR      r1,[sp,#4]
        0x00001d1a:    e000        ..      B        0x1d1e ; _printf_core + 1386
        0x00001d1c:    9101        ..      STR      r1,[sp,#4]
        0x00001d1e:    2901        .)      CMP      r1,#1
        0x00001d20:    dd04        ..      BLE      0x1d2c ; _printf_core + 1400
        0x00001d22:    9a15        ..      LDR      r2,[sp,#0x54]
        0x00001d24:    1e49        I.      SUBS     r1,r1,#1
        0x00001d26:    5c51        Q\      LDRB     r1,[r2,r1]
        0x00001d28:    2930        0)      CMP      r1,#0x30
        0x00001d2a:    d006        ..      BEQ      0x1d3a ; _printf_core + 1414
        0x00001d2c:    42b8        .B      CMP      r0,r7
        0x00001d2e:    da01        ..      BGE      0x1d34 ; _printf_core + 1408
        0x00001d30:    1d01        ..      ADDS     r1,r0,#4
        0x00001d32:    da05        ..      BGE      0x1d40 ; _printf_core + 1420
        0x00001d34:    2101        .!      MOVS     r1,#1
        0x00001d36:    9102        ..      STR      r1,[sp,#8]
        0x00001d38:    e015        ..      B        0x1d66 ; _printf_core + 1458
        0x00001d3a:    9901        ..      LDR      r1,[sp,#4]
        0x00001d3c:    1e49        I.      SUBS     r1,r1,#1
        0x00001d3e:    e7ed        ..      B        0x1d1c ; _printf_core + 1384
        0x00001d40:    2800        .(      CMP      r0,#0
        0x00001d42:    dc05        ..      BGT      0x1d50 ; _printf_core + 1436
        0x00001d44:    9900        ..      LDR      r1,[sp,#0]
        0x00001d46:    1841        A.      ADDS     r1,r0,r1
        0x00001d48:    9100        ..      STR      r1,[sp,#0]
        0x00001d4a:    9901        ..      LDR      r1,[sp,#4]
        0x00001d4c:    1a09        ..      SUBS     r1,r1,r0
        0x00001d4e:    e003        ..      B        0x1d58 ; _printf_core + 1444
        0x00001d50:    9a01        ..      LDR      r2,[sp,#4]
        0x00001d52:    1c41        A.      ADDS     r1,r0,#1
        0x00001d54:    4291        .B      CMP      r1,r2
        0x00001d56:    dd00        ..      BLE      0x1d5a ; _printf_core + 1446
        0x00001d58:    9101        ..      STR      r1,[sp,#4]
        0x00001d5a:    9900        ..      LDR      r1,[sp,#0]
        0x00001d5c:    1a40        @.      SUBS     r0,r0,r1
        0x00001d5e:    1c40        @.      ADDS     r0,r0,#1
        0x00001d60:    9002        ..      STR      r0,[sp,#8]
        0x00001d62:    2001        .       MOVS     r0,#1
        0x00001d64:    07c0        ..      LSLS     r0,r0,#31
        0x00001d66:    9003        ..      STR      r0,[sp,#0xc]
        0x00001d68:    0720         .      LSLS     r0,r4,#28
        0x00001d6a:    d406        ..      BMI      0x1d7a ; _printf_core + 1478
        0x00001d6c:    9902        ..      LDR      r1,[sp,#8]
        0x00001d6e:    9801        ..      LDR      r0,[sp,#4]
        0x00001d70:    4281        .B      CMP      r1,r0
        0x00001d72:    db02        ..      BLT      0x1d7a ; _printf_core + 1478
        0x00001d74:    2000        .       MOVS     r0,#0
        0x00001d76:    43c0        .C      MVNS     r0,r0
        0x00001d78:    9002        ..      STR      r0,[sp,#8]
        0x00001d7a:    2000        .       MOVS     r0,#0
        0x00001d7c:    4669        iF      MOV      r1,sp
        0x00001d7e:    77c8        .w      STRB     r0,[r1,#0x1f]
        0x00001d80:    af07        ..      ADD      r7,sp,#0x1c
        0x00001d82:    2101        .!      MOVS     r1,#1
        0x00001d84:    9803        ..      LDR      r0,[sp,#0xc]
        0x00001d86:    3703        .7      ADDS     r7,#3
        0x00001d88:    07c9        ..      LSLS     r1,r1,#31
        0x00001d8a:    4288        .B      CMP      r0,r1
        0x00001d8c:    d024        $.      BEQ      0x1dd8 ; _printf_core + 1572
        0x00001d8e:    2002        .       MOVS     r0,#2
        0x00001d90:    9011        ..      STR      r0,[sp,#0x44]
        0x00001d92:    202b        +       MOVS     r0,#0x2b
        0x00001d94:    9012        ..      STR      r0,[sp,#0x48]
        0x00001d96:    9803        ..      LDR      r0,[sp,#0xc]
        0x00001d98:    2800        .(      CMP      r0,#0
        0x00001d9a:    da0c        ..      BGE      0x1db6 ; _printf_core + 1538
        0x00001d9c:    4240        @B      RSBS     r0,r0,#0
        0x00001d9e:    9003        ..      STR      r0,[sp,#0xc]
        0x00001da0:    202d        -       MOVS     r0,#0x2d
        0x00001da2:    9012        ..      STR      r0,[sp,#0x48]
        0x00001da4:    e007        ..      B        0x1db6 ; _printf_core + 1538
        0x00001da6:    210a        .!      MOVS     r1,#0xa
        0x00001da8:    9803        ..      LDR      r0,[sp,#0xc]
        0x00001daa:    f7fef9c3    ....    BL       __aeabi_uidiv ; 0x134
        0x00001dae:    3130        01      ADDS     r1,r1,#0x30
        0x00001db0:    1e7f        ..      SUBS     r7,r7,#1
        0x00001db2:    9003        ..      STR      r0,[sp,#0xc]
        0x00001db4:    7039        9p      STRB     r1,[r7,#0]
        0x00001db6:    9911        ..      LDR      r1,[sp,#0x44]
        0x00001db8:    1e48        H.      SUBS     r0,r1,#1
        0x00001dba:    9011        ..      STR      r0,[sp,#0x44]
        0x00001dbc:    2900        .)      CMP      r1,#0
        0x00001dbe:    dcf2        ..      BGT      0x1da6 ; _printf_core + 1522
        0x00001dc0:    9803        ..      LDR      r0,[sp,#0xc]
        0x00001dc2:    2800        .(      CMP      r0,#0
        0x00001dc4:    d1ef        ..      BNE      0x1da6 ; _printf_core + 1522
        0x00001dc6:    1e79        y.      SUBS     r1,r7,#1
        0x00001dc8:    9812        ..      LDR      r0,[sp,#0x48]
        0x00001dca:    7008        .p      STRB     r0,[r1,#0]
        0x00001dcc:    7830        0x      LDRB     r0,[r6,#0]
        0x00001dce:    2120         !      MOVS     r1,#0x20
        0x00001dd0:    4008        .@      ANDS     r0,r0,r1
        0x00001dd2:    3045        E0      ADDS     r0,r0,#0x45
        0x00001dd4:    1ebf        ..      SUBS     r7,r7,#2
        0x00001dd6:    7038        8p      STRB     r0,[r7,#0]
        0x00001dd8:    a806        ..      ADD      r0,sp,#0x18
        0x00001dda:    1bc0        ..      SUBS     r0,r0,r7
        0x00001ddc:    1dc0        ..      ADDS     r0,r0,#7
        0x00001dde:    9003        ..      STR      r0,[sp,#0xc]
        0x00001de0:    9810        ..      LDR      r0,[sp,#0x40]
        0x00001de2:    7800        .x      LDRB     r0,[r0,#0]
        0x00001de4:    2800        .(      CMP      r0,#0
        0x00001de6:    d000        ..      BEQ      0x1dea ; _printf_core + 1590
        0x00001de8:    2001        .       MOVS     r0,#1
        0x00001dea:    9901        ..      LDR      r1,[sp,#4]
        0x00001dec:    1841        A.      ADDS     r1,r0,r1
        0x00001dee:    9802        ..      LDR      r0,[sp,#8]
        0x00001df0:    17c0        ..      ASRS     r0,r0,#31
        0x00001df2:    1809        ..      ADDS     r1,r1,r0
        0x00001df4:    9803        ..      LDR      r0,[sp,#0xc]
        0x00001df6:    1809        ..      ADDS     r1,r1,r0
        0x00001df8:    9804        ..      LDR      r0,[sp,#0x10]
        0x00001dfa:    1a40        @.      SUBS     r0,r0,r1
        0x00001dfc:    1e40        @.      SUBS     r0,r0,#1
        0x00001dfe:    9004        ..      STR      r0,[sp,#0x10]
        0x00001e00:    03e0        ..      LSLS     r0,r4,#15
        0x00001e02:    d406        ..      BMI      0x1e12 ; _printf_core + 1630
        0x00001e04:    4621        !F      MOV      r1,r4
        0x00001e06:    9b1a        ..      LDR      r3,[sp,#0x68]
        0x00001e08:    9a19        ..      LDR      r2,[sp,#0x64]
        0x00001e0a:    9804        ..      LDR      r0,[sp,#0x10]
        0x00001e0c:    f000f85e    ..^.    BL       _printf_pre_padding ; 0x1ecc
        0x00001e10:    1945        E.      ADDS     r5,r0,r5
        0x00001e12:    9810        ..      LDR      r0,[sp,#0x40]
        0x00001e14:    7800        .x      LDRB     r0,[r0,#0]
        0x00001e16:    2800        .(      CMP      r0,#0
        0x00001e18:    d003        ..      BEQ      0x1e22 ; _printf_core + 1646
        0x00001e1a:    9a1a        ..      LDR      r2,[sp,#0x68]
        0x00001e1c:    9919        ..      LDR      r1,[sp,#0x64]
        0x00001e1e:    4790        .G      BLX      r2
        0x00001e20:    1c6d        m.      ADDS     r5,r5,#1
        0x00001e22:    03e0        ..      LSLS     r0,r4,#15
        0x00001e24:    d523        #.      BPL      0x1e6e ; _printf_core + 1722
        0x00001e26:    4621        !F      MOV      r1,r4
        0x00001e28:    9b1a        ..      LDR      r3,[sp,#0x68]
        0x00001e2a:    9a19        ..      LDR      r2,[sp,#0x64]
        0x00001e2c:    9804        ..      LDR      r0,[sp,#0x10]
        0x00001e2e:    f000f84d    ..M.    BL       _printf_pre_padding ; 0x1ecc
        0x00001e32:    1945        E.      ADDS     r5,r0,r5
        0x00001e34:    e01b        ..      B        0x1e6e ; _printf_core + 1722
        0x00001e36:    9800        ..      LDR      r0,[sp,#0]
        0x00001e38:    2800        .(      CMP      r0,#0
        0x00001e3a:    db07        ..      BLT      0x1e4c ; _printf_core + 1688
        0x00001e3c:    9900        ..      LDR      r1,[sp,#0]
        0x00001e3e:    9805        ..      LDR      r0,[sp,#0x14]
        0x00001e40:    4288        .B      CMP      r0,r1
        0x00001e42:    dd03        ..      BLE      0x1e4c ; _printf_core + 1688
        0x00001e44:    9815        ..      LDR      r0,[sp,#0x54]
        0x00001e46:    5c40        @\      LDRB     r0,[r0,r1]
        0x00001e48:    9919        ..      LDR      r1,[sp,#0x64]
        0x00001e4a:    e001        ..      B        0x1e50 ; _printf_core + 1692
        0x00001e4c:    9919        ..      LDR      r1,[sp,#0x64]
        0x00001e4e:    2030        0       MOVS     r0,#0x30
        0x00001e50:    9a1a        ..      LDR      r2,[sp,#0x68]
        0x00001e52:    4790        .G      BLX      r2
        0x00001e54:    9800        ..      LDR      r0,[sp,#0]
        0x00001e56:    1c6d        m.      ADDS     r5,r5,#1
        0x00001e58:    1c40        @.      ADDS     r0,r0,#1
        0x00001e5a:    9000        ..      STR      r0,[sp,#0]
        0x00001e5c:    9802        ..      LDR      r0,[sp,#8]
        0x00001e5e:    1e40        @.      SUBS     r0,r0,#1
        0x00001e60:    9002        ..      STR      r0,[sp,#8]
        0x00001e62:    d104        ..      BNE      0x1e6e ; _printf_core + 1722
        0x00001e64:    9a1a        ..      LDR      r2,[sp,#0x68]
        0x00001e66:    202e        .       MOVS     r0,#0x2e
        0x00001e68:    9919        ..      LDR      r1,[sp,#0x64]
        0x00001e6a:    4790        .G      BLX      r2
        0x00001e6c:    1c6d        m.      ADDS     r5,r5,#1
        0x00001e6e:    9901        ..      LDR      r1,[sp,#4]
        0x00001e70:    1e48        H.      SUBS     r0,r1,#1
        0x00001e72:    9001        ..      STR      r0,[sp,#4]
        0x00001e74:    2900        .)      CMP      r1,#0
        0x00001e76:    dcde        ..      BGT      0x1e36 ; _printf_core + 1666
        0x00001e78:    e005        ..      B        0x1e86 ; _printf_core + 1746
        0x00001e7a:    7838        8x      LDRB     r0,[r7,#0]
        0x00001e7c:    9a1a        ..      LDR      r2,[sp,#0x68]
        0x00001e7e:    1c7f        ..      ADDS     r7,r7,#1
        0x00001e80:    9919        ..      LDR      r1,[sp,#0x64]
        0x00001e82:    4790        .G      BLX      r2
        0x00001e84:    1c6d        m.      ADDS     r5,r5,#1
        0x00001e86:    9903        ..      LDR      r1,[sp,#0xc]
        0x00001e88:    1e48        H.      SUBS     r0,r1,#1
        0x00001e8a:    9003        ..      STR      r0,[sp,#0xc]
        0x00001e8c:    2900        .)      CMP      r1,#0
        0x00001e8e:    dcf4        ..      BGT      0x1e7a ; _printf_core + 1734
        0x00001e90:    4621        !F      MOV      r1,r4
        0x00001e92:    9b1a        ..      LDR      r3,[sp,#0x68]
        0x00001e94:    9a19        ..      LDR      r2,[sp,#0x64]
        0x00001e96:    9804        ..      LDR      r0,[sp,#0x10]
        0x00001e98:    e6ad        ..      B        0x1bf6 ; _printf_core + 1090
    $d
        0x00001e9a:    0000        ..      DCW    0
        0x00001e9c:    0000002d    -...    DCD    45
