747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
        0x00001ea0:    0000002b    +...    DCD    43
        0x00001ea4:    00000020     ...    DCD    32
        0x00001ea8:    00000000    ....    DCD    0
    $t
    i._printf_post_padding
    _printf_post_padding
        0x00001eac:    b5f8        ..      PUSH     {r3-r7,lr}
        0x00001eae:    4604        .F      MOV      r4,r0
        0x00001eb0:    2500        .%      MOVS     r5,#0
        0x00001eb2:    461e        .F      MOV      r6,r3
        0x00001eb4:    4617        .F      MOV      r7,r2
        0x00001eb6:    0488        ..      LSLS     r0,r1,#18
        0x00001eb8:    d404        ..      BMI      0x1ec4 ; _printf_post_padding + 24
        0x00001eba:    e005        ..      B        0x1ec8 ; _printf_post_padding + 28
        0x00001ebc:    4639        9F      MOV      r1,r7
        0x00001ebe:    2020                MOVS     r0,#0x20
        0x00001ec0:    47b0        .G      BLX      r6
        0x00001ec2:    1c6d        m.      ADDS     r5,r5,#1
        0x00001ec4:    1e64        d.      SUBS     r4,r4,#1
        0x00001ec6:    d5f9        ..      BPL      0x1ebc ; _printf_post_padding + 16
        0x00001ec8:    4628        (F      MOV      r0,r5
        0x00001eca:    bdf8        ..      POP      {r3-r7,pc}
    i._printf_pre_padding
    _printf_pre_padding
        0x00001ecc:    b5ff        ..      PUSH     {r0-r7,lr}
        0x00001ece:    4604        .F      MOV      r4,r0
        0x00001ed0:    2500        .%      MOVS     r5,#0
        0x00001ed2:    b081        ..      SUB      sp,sp,#4
        0x00001ed4:    461e        .F      MOV      r6,r3
        0x00001ed6:    03c8        ..      LSLS     r0,r1,#15
        0x00001ed8:    d501        ..      BPL      0x1ede ; _printf_pre_padding + 18
        0x00001eda:    2730        0'      MOVS     r7,#0x30
        0x00001edc:    e000        ..      B        0x1ee0 ; _printf_pre_padding + 20
        0x00001ede:    2720         '      MOVS     r7,#0x20
        0x00001ee0:    0488        ..      LSLS     r0,r1,#18
        0x00001ee2:    d504        ..      BPL      0x1eee ; _printf_pre_padding + 34
        0x00001ee4:    e005        ..      B        0x1ef2 ; _printf_pre_padding + 38
        0x00001ee6:    4638        8F      MOV      r0,r7
        0x00001ee8:    9903        ..      LDR      r1,[sp,#0xc]
        0x00001eea:    47b0        .G      BLX      r6
        0x00001eec:    1c6d        m.      ADDS     r5,r5,#1
        0x00001eee:    1e64        d.      SUBS     r4,r4,#1
        0x00001ef0:    d5f9        ..      BPL      0x1ee6 ; _printf_pre_padding + 26
        0x00001ef2:    4628        (F      MOV      r0,r5
        0x00001ef4:    b005        ..      ADD      sp,sp,#0x14
        0x00001ef6:    bdf0        ..      POP      {r4-r7,pc}
    i.anti_cogging_calibration_roud
    anti_cogging_calibration_roud
        0x00001ef8:    b5f8        ..      PUSH     {r3-r7,lr}
        0x00001efa:    2001        .       MOVS     r0,#1
        0x00001efc:    f000fca0    ....    BL       foc_set_ctrl_mode ; 0x2840
        0x00001f00:    482d        -H      LDR      r0,[pc,#180] ; [0x1fb8] = 0x200010e0
        0x00001f02:    7800        .x      LDRB     r0,[r0,#0]
        0x00001f04:    2800        .(      CMP      r0,#0
        0x00001f06:    d002        ..      BEQ      0x1f0e ; anti_cogging_calibration_roud + 22
        0x00001f08:    f000f860    ..`.    BL       anti_cogging_calibration_round_test ; 0x1fcc
        0x00001f0c:    bdf8        ..      POP      {r3-r7,pc}
        0x00001f0e:    4d2b        +M      LDR      r5,[pc,#172] ; [0x1fbc] = 0x20000e58
        0x00001f10:    2002        .       MOVS     r0,#2
        0x00001f12:    4a2c        ,J      LDR      r2,[pc,#176] ; [0x1fc4] = 0xfffe6de1
        0x00001f14:    5628        (V      LDRSB    r0,[r5,r0]
        0x00001f16:    2400        .$      MOVS     r4,#0
        0x00001f18:    4b29        )K      LDR      r3,[pc,#164] ; [0x1fc0] = 0x200010e1
        0x00001f1a:    4e2b        +N      LDR      r6,[pc,#172] ; [0x1fc8] = 0x410f6a6c
        0x00001f1c:    4251        QB      RSBS     r1,r2,#0
        0x00001f1e:    2801        .(      CMP      r0,#1
        0x00001f20:    d008        ..      BEQ      0x1f34 ; anti_cogging_calibration_roud + 60
        0x00001f22:    1c47        G.      ADDS     r7,r0,#1
        0x00001f24:    d024        $.      BEQ      0x1f70 ; anti_cogging_calibration_roud + 120
        0x00001f26:    2800        .(      CMP      r0,#0
        0x00001f28:    d040        @.      BEQ      0x1fac ; anti_cogging_calibration_roud + 180
        0x00001f2a:    280a        .(      CMP      r0,#0xa
        0x00001f2c:    d1ee        ..      BNE      0x1f0c ; anti_cogging_calibration_roud + 20
        0x00001f2e:    f000f84d    ..M.    BL       anti_cogging_calibration_round_test ; 0x1fcc
        0x00001f32:    bdf8        ..      POP      {r3-r7,pc}
        0x00001f34:    2001        .       MOVS     r0,#1
        0x00001f36:    7018        .p      STRB     r0,[r3,#0]
        0x00001f38:    6a28        (j      LDR      r0,[r5,#0x20]
        0x00001f3a:    1c80        ..      ADDS     r0,r0,#2
        0x00001f3c:    6228        (b      STR      r0,[r5,#0x20]
        0x00001f3e:    2800        .(      CMP      r0,#0
        0x00001f40:    da01        ..      BGE      0x1f46 ; anti_cogging_calibration_roud + 78
        0x00001f42:    1840        @.      ADDS     r0,r0,r1
        0x00001f44:    6228        (b      STR      r0,[r5,#0x20]
        0x00001f46:    6a28        (j      LDR      r0,[r5,#0x20]
        0x00001f48:    4288        .B      CMP      r0,r1
        0x00001f4a:    dd01        ..      BLE      0x1f50 ; anti_cogging_calibration_roud + 88
        0x00001f4c:    1880        ..      ADDS     r0,r0,r2
        0x00001f4e:    6228        (b      STR      r0,[r5,#0x20]
        0x00001f50:    6a28        (j      LDR      r0,[r5,#0x20]
        0x00001f52:    f000fc6f    ..o.    BL       foc_pos_set ; 0x2834
        0x00001f56:    6a68        hj      LDR      r0,[r5,#0x24]
        0x00001f58:    1c80        ..      ADDS     r0,r0,#2
        0x00001f5a:    6268        hb      STR      r0,[r5,#0x24]
        0x00001f5c:    f7fefaba    ....    BL       __aeabi_i2d ; 0x4d4
        0x00001f60:    2200        ."      MOVS     r2,#0
        0x00001f62:    4633        3F      MOV      r3,r6
        0x00001f64:    f7fefb1a    ....    BL       __aeabi_cdrcmple ; 0x59c
        0x00001f68:    d2e3        ..      BCS      0x1f32 ; anti_cogging_calibration_roud + 58
        0x00001f6a:    70ac        .p      STRB     r4,[r5,#2]
        0x00001f6c:    626c        lb      STR      r4,[r5,#0x24]
        0x00001f6e:    bdf8        ..      POP      {r3-r7,pc}
        0x00001f70:    2000        .       MOVS     r0,#0
        0x00001f72:    43c0        .C      MVNS     r0,r0
        0x00001f74:    7018        .p      STRB     r0,[r3,#0]
        0x00001f76:    6a28        (j      LDR      r0,[r5,#0x20]
        0x00001f78:    1e80        ..      SUBS     r0,r0,#2
        0x00001f7a:    6228        (b      STR      r0,[r5,#0x20]
        0x00001f7c:    2800        .(      CMP      r0,#0
        0x00001f7e:    da01        ..      BGE      0x1f84 ; anti_cogging_calibration_roud + 140
        0x00001f80:    1840        @.      ADDS     r0,r0,r1
        0x00001f82:    6228        (b      STR      r0,[r5,#0x20]
        0x00001f84:    6a28        (j      LDR      r0,[r5,#0x20]
        0x00001f86:    4288        .B      CMP      r0,r1
        0x00001f88:    dd01        ..      BLE      0x1f8e ; anti_cogging_calibration_roud + 150
        0x00001f8a:    1880        ..      ADDS     r0,r0,r2
        0x00001f8c:    6228        (b      STR      r0,[r5,#0x20]
        0x00001f8e:    6a28        (j      LDR      r0,[r5,#0x20]
        0x00001f90:    f000fc50    ..P.    BL       foc_pos_set ; 0x2834
        0x00001f94:    6a68        hj      LDR      r0,[r5,#0x24]
        0x00001f96:    1c80        ..      ADDS     r0,r0,#2
        0x00001f98:    6268        hb      STR      r0,[r5,#0x24]
        0x00001f9a:    f7fefa9b    ....    BL       __aeabi_i2d ; 0x4d4
        0x00001f9e:    2200        ."      MOVS     r2,#0
        0x00001fa0:    4633        3F      MOV      r3,r6
        0x00001fa2:    f7fefafb    ....    BL       __aeabi_cdrcmple ; 0x59c
        0x00001fa6:    d2e2        ..      BCS      0x1f6e ; anti_cogging_calibration_roud + 118
        0x00001fa8:    70ac        .p      STRB     r4,[r5,#2]
        0x00001faa:    bdf8        ..      POP      {r3-r7,pc}
        0x00001fac:    f000f87c    ..|.    BL       anti_cogging_compesation_save ; 0x20a8
        0x00001fb0:    200a        .       MOVS     r0,#0xa
        0x00001fb2:    70a8        .p      STRB     r0,[r5,#2]
        0x00001fb4:    bdf8        ..      POP      {r3-r7,pc}
    $d
        0x00001fb6:    0000        ..      DCW    0
        0x00001fb8:    200010e0    ...     DCD    536875232
        0x00001fbc:    20000e58    X..     DCD    536874584
        0x00001fc0:    200010e1    ...     DCD    536875233
        0x00001fc4:    fffe6de1    .m..    DCD    4294864353
        0x00001fc8:    410f6a6c    lj.A    DCD    1091529324
    $t
    i.anti_cogging_calibration_round_test
    anti_cogging_calibration_round_test
        0x00001fcc:    b5f8        ..      PUSH     {r3-r7,lr}
        0x00001fce:    2001        .       MOVS     r0,#1
        0x00001fd0:    f000fc36    ..6.    BL       foc_set_ctrl_mode ; 0x2840
        0x00001fd4:    4c20         L      LDR      r4,[pc,#128] ; [0x2058] = 0x20000e58
        0x00001fd6:    4922        "I      LDR      r1,[pc,#136] ; [0x2060] = 0xfffe6de1
        0x00001fd8:    2204        ."      MOVS     r2,#4
        0x00001fda:    56a2        .V      LDRSB    r2,[r4,r2]
        0x00001fdc:    2700        .'      MOVS     r7,#0
        0x00001fde:    2501        .%      MOVS     r5,#1
        0x00001fe0:    4b1e        .K      LDR      r3,[pc,#120] ; [0x205c] = 0x200010e1
        0x00001fe2:    144e        N.      ASRS     r6,r1,#17
        0x00001fe4:    4248        HB      RSBS     r0,r1,#0
        0x00001fe6:    2a00        .*      CMP      r2,#0
        0x00001fe8:    dd19        ..      BLE      0x201e ; anti_cogging_calibration_round_test + 82
        0x00001fea:    701d        .p      STRB     r5,[r3,#0]
        0x00001fec:    6ae2        .j      LDR      r2,[r4,#0x2c]
        0x00001fee:    3228        (2      ADDS     r2,r2,#0x28
        0x00001ff0:    62e2        .b      STR      r2,[r4,#0x2c]
        0x00001ff2:    6b23        #k      LDR      r3,[r4,#0x30]
        0x00001ff4:    3328        (3      ADDS     r3,r3,#0x28
        0x00001ff6:    6323        #c      STR      r3,[r4,#0x30]
        0x00001ff8:    2a00        .*      CMP      r2,#0
        0x00001ffa:    da01        ..      BGE      0x2000 ; anti_cogging_calibration_round_test + 52
        0x00001ffc:    1812        ..      ADDS     r2,r2,r0
        0x00001ffe:    62e2        .b      STR      r2,[r4,#0x2c]
        0x00002000:    6ae2        .j      LDR      r2,[r4,#0x2c]
        0x00002002:    4282        .B      CMP      r2,r0
        0x00002004:    dd01        ..      BLE      0x200a ; anti_cogging_calibration_round_test + 62
        0x00002006:    1850        P.      ADDS     r0,r2,r1
        0x00002008:    62e0        .b      STR      r0,[r4,#0x2c]
        0x0000200a:    6ae0        .j      LDR      r0,[r4,#0x2c]
        0x0000200c:    f000fc12    ....    BL       foc_pos_set ; 0x2834
        0x00002010:    4814        .H      LDR      r0,[pc,#80] ; [0x2064] = 0x7da9b
        0x00002012:    6b21        !k      LDR      r1,[r4,#0x30]
        0x00002014:    4281        .B      CMP      r1,r0
        0x00002016:    dd01        ..      BLE      0x201c ; anti_cogging_calibration_round_test + 80
        0x00002018:    6327        'c      STR      r7,[r4,#0x30]
        0x0000201a:    7126        &q      STRB     r6,[r4,#4]
        0x0000201c:    bdf8        ..      POP      {r3-r7,pc}
        0x0000201e:    2a00        .*      CMP      r2,#0
        0x00002020:    dafc        ..      BGE      0x201c ; anti_cogging_calibration_round_test + 80
        0x00002022:    701e        .p      STRB     r6,[r3,#0]
        0x00002024:    6ae2        .j      LDR      r2,[r4,#0x2c]
        0x00002026:    3a28        (:      SUBS     r2,r2,#0x28
        0x00002028:    62e2        .b      STR      r2,[r4,#0x2c]
        0x0000202a:    6b23        #k      LDR      r3,[r4,#0x30]
        0x0000202c:    3328        (3      ADDS     r3,r3,#0x28
        0x0000202e:    6323        #c      STR      r3,[r4,#0x30]
        0x00002030:    2a00        .*      CMP      r2,#0
        0x00002032:    da01        ..      BGE      0x2038 ; anti_cogging_calibration_round_test + 108
        0x00002034:    1812        ..      ADDS     r2,r2,r0
        0x00002036:    62e2        .b      STR      r2,[r4,#0x2c]
        0x00002038:    6ae2        .j      LDR      r2,[r4,#0x2c]
        0x0000203a:    4282        .B      CMP      r2,r0
        0x0000203c:    dd01        ..      BLE      0x2042 ; anti_cogging_calibration_round_test + 118
        0x0000203e:    1850        P.      ADDS     r0,r2,r1
        0x00002040:    62e0        .b      STR      r0,[r4,#0x2c]
        0x00002042:    6ae0        .j      LDR      r0,[r4,#0x2c]
        0x00002044:    f000fbf6    ....    BL       foc_pos_set ; 0x2834
        0x00002048:    4806        .H      LDR      r0,[pc,#24] ; [0x2064] = 0x7da9b
        0x0000204a:    6b21        !k      LDR      r1,[r4,#0x30]
        0x0000204c:    4281        .B      CMP      r1,r0
        0x0000204e:    dde5        ..      BLE      0x201c ; anti_cogging_calibration_round_test + 80
        0x00002050:    6327        'c      STR      r7,[r4,#0x30]
        0x00002052:    7125        %q      STRB     r5,[r4,#4]
        0x00002054:    bdf8        ..      POP      {r3-r7,pc}
    $d
        0x00002056:    0000        ..      DCW    0
        0x00002058:    20000e58    X..     DCD    536874584
        0x0000205c:    200010e1    ...     DCD    536875233
        0x00002060:    fffe6de1    .m..    DCD    4294864353
        0x00002064:    0007da9b    ....    DCD    514715
    $t
    i.anti_cogging_compesation_read
    anti_cogging_compesation_read
        0x00002068:    b508        ..      PUSH     {r3,lr}
        0x0000206a:    200d        .       MOVS     r0,#0xd
        0x0000206c:    2201        ."      MOVS     r2,#1
        0x0000206e:    4669        iF      MOV      r1,sp
        0x00002070:    02c0        ..      LSLS     r0,r0,#11
        0x00002072:    f7fefe03    ....    BL       Flash_ReadDate ; 0xc7c
        0x00002076:    4a08        .J      LDR      r2,[pc,#32] ; [0x2098] = 0xa5a5a5a5
        0x00002078:    9900        ..      LDR      r1,[sp,#0]
        0x0000207a:    4808        .H      LDR      r0,[pc,#32] ; [0x209c] = 0x200010e0
        0x0000207c:    4291        .B      CMP      r1,r2
        0x0000207e:    d108        ..      BNE      0x2092 ; anti_cogging_compesation_read + 42
        0x00002080:    2101        .!      MOVS     r1,#1
        0x00002082:    7001        .p      STRB     r1,[r0,#0]
        0x00002084:    22ff        ."      MOVS     r2,#0xff
        0x00002086:    32f5        .2      ADDS     r2,r2,#0xf5
        0x00002088:    4905        .I      LDR      r1,[pc,#20] ; [0x20a0] = 0x2000117c
        0x0000208a:    4806        .H      LDR      r0,[pc,#24] ; [0x20a4] = 0x6808
        0x0000208c:    f7fefdf6    ....    BL       Flash_ReadDate ; 0xc7c
        0x00002090:    bd08        ..      POP      {r3,pc}
        0x00002092:    2100        .!      MOVS     r1,#0
        0x00002094:    7001        .p      STRB     r1,[r0,#0]
        0x00002096:    bd08        ..      POP      {r3,pc}
    $d
        0x00002098:    a5a5a5a5    ....    DCD    2779096485
        0x0000209c:    200010e0    ...     DCD    536875232
        0x000020a0:    2000117c    |..     DCD    536875388
        0x000020a4:    00006808    .h..    DCD    26632
    $t
    i.anti_cogging_compesation_save
    anti_cogging_compesation_save
        0x000020a8:    b538        8.      PUSH     {r3-r5,lr}
        0x000020aa:    480d        .H      LDR      r0,[pc,#52] ; [0x20e0] = 0xa5a5a5a5
        0x000020ac:    9000        ..      STR      r0,[sp,#0]
        0x000020ae:    240d        .$      MOVS     r4,#0xd
        0x000020b0:    02e4        ..      LSLS     r4,r4,#11
        0x000020b2:    4620         F      MOV      r0,r4
        0x000020b4:    f7fefd9c    ....    BL       FLASH_Erase ; 0xbf0
        0x000020b8:    201b        .       MOVS     r0,#0x1b
        0x000020ba:    0280        ..      LSLS     r0,r0,#10
        0x000020bc:    f7fefd98    ....    BL       FLASH_Erase ; 0xbf0
        0x000020c0:    2202        ."      MOVS     r2,#2
        0x000020c2:    4669        iF      MOV      r1,sp
        0x000020c4:    4620         F      MOV      r0,r4
        0x000020c6:    f7fefde5    ....    BL       Flash_WriteData ; 0xc94
        0x000020ca:    22ff        ."      MOVS     r2,#0xff
        0x000020cc:    32f5        .2      ADDS     r2,r2,#0xf5
        0x000020ce:    4905        .I      LDR      r1,[pc,#20] ; [0x20e4] = 0x2000117c
        0x000020d0:    4805        .H      LDR      r0,[pc,#20] ; [0x20e8] = 0x6808
        0x000020d2:    f7fefddf    ....    BL       Flash_WriteData ; 0xc94
        0x000020d6:    4905        .I      LDR      r1,[pc,#20] ; [0x20ec] = 0x200010e0
        0x000020d8:    2001        .       MOVS     r0,#1
        0x000020da:    7008        .p      STRB     r0,[r1,#0]
        0x000020dc:    bd38        8.      POP      {r3-r5,pc}
    $d
        0x000020de:    0000        ..      DCW    0
        0x000020e0:    a5a5a5a5    ....    DCD    2779096485
        0x000020e4:    2000117c    |..     DCD    536875388
        0x000020e8:    00006808    .h..    DCD    26632
        0x000020ec:    200010e0    ...     DCD    536875232
    $t
    i.chn2idx
    chn2idx
        0x000020f0:    4601        .F      MOV      r1,r0
        0x000020f2:    2000        .       MOVS     r0,#0
        0x000020f4:    2940        @)      CMP      r1,#0x40
        0x000020f6:    d02e        ..      BEQ      0x2156 ; chn2idx + 102
        0x000020f8:    dc10        ..      BGT      0x211c ; chn2idx + 44
        0x000020fa:    2908        .)      CMP      r1,#8
        0x000020fc:    d027        '.      BEQ      0x214e ; chn2idx + 94
        0x000020fe:    dc07        ..      BGT      0x2110 ; chn2idx + 32
        0x00002100:    2901        .)      CMP      r1,#1
        0x00002102:    d004        ..      BEQ      0x210e ; chn2idx + 30
        0x00002104:    2902        .)      CMP      r1,#2
        0x00002106:    d020         .      BEQ      0x214a ; chn2idx + 90
        0x00002108:    2904        .)      CMP      r1,#4
        0x0000210a:    d100        ..      BNE      0x210e ; chn2idx + 30
        0x0000210c:    2002        .       MOVS     r0,#2
        0x0000210e:    4770        pG      BX       lr
        0x00002110:    2910        .)      CMP      r1,#0x10
        0x00002112:    d01e        ..      BEQ      0x2152 ; chn2idx + 98
        0x00002114:    2920         )      CMP      r1,#0x20
        0x00002116:    d1fa        ..      BNE      0x210e ; chn2idx + 30
        0x00002118:    2005        .       MOVS     r0,#5
        0x0000211a:    4770        pG      BX       lr
        0x0000211c:    2301        .#      MOVS     r3,#1
        0x0000211e:    025b        [.      LSLS     r3,r3,#9
        0x00002120:    1aca        ..      SUBS     r2,r1,r3
        0x00002122:    4299        .B      CMP      r1,r3
        0x00002124:    d01b        ..      BEQ      0x215e ; chn2idx + 110
        0x00002126:    dc06        ..      BGT      0x2136 ; chn2idx + 70
        0x00002128:    2980        .)      CMP      r1,#0x80
        0x0000212a:    d016        ..      BEQ      0x215a ; chn2idx + 106
        0x0000212c:    39ff        .9      SUBS     r1,r1,#0xff
        0x0000212e:    3901        .9      SUBS     r1,#1
        0x00002130:    d1f3        ..      BNE      0x211a ; chn2idx + 42
        0x00002132:    2008        .       MOVS     r0,#8
        0x00002134:    4770        pG      BX       lr
        0x00002136:    3aff        .:      SUBS     r2,r2,#0xff
        0x00002138:    3aff        .:      SUBS     r2,r2,#0xff
        0x0000213a:    3a02        .:      SUBS     r2,#2
        0x0000213c:    d011        ..      BEQ      0x2162 ; chn2idx + 114
        0x0000213e:    2101        .!      MOVS     r1,#1
        0x00002140:    0289        ..      LSLS     r1,r1,#10
        0x00002142:    1a51        Q.      SUBS     r1,r2,r1
        0x00002144:    d1f6        ..      BNE      0x2134 ; chn2idx + 68
        0x00002146:    200b        .       MOVS     r0,#0xb
        0x00002148:    4770        pG      BX       lr
        0x0000214a:    2001        .       MOVS     r0,#1
        0x0000214c:    4770        pG      BX       lr
        0x0000214e:    2003        .       MOVS     r0,#3
        0x00002150:    4770        pG      BX       lr
        0x00002152:    2004        .       MOVS     r0,#4
        0x00002154:    4770        pG      BX       lr
        0x00002156:    2006        .       MOVS     r0,#6
        0x00002158:    4770        pG      BX       lr
        0x0000215a:    2007        .       MOVS     r0,#7
        0x0000215c:    4770        pG      BX       lr
        0x0000215e:    2009        .       MOVS     r0,#9
        0x00002160:    4770        pG      BX       lr
        0x00002162:    200a        .       MOVS     r0,#0xa
        0x00002164:    4770        pG      BX       lr
        0x00002166:    0000        ..      MOVS     r0,r0
    i.debug_gpio_init
    debug_gpio_init
        0x00002168:    b500        ..      PUSH     {lr}
        0x0000216a:    b083        ..      SUB      sp,sp,#0xc
        0x0000216c:    2000        .       MOVS     r0,#0
        0x0000216e:    9000        ..      STR      r0,[sp,#0]
        0x00002170:    2301        .#      MOVS     r3,#1
        0x00002172:    9001        ..      STR      r0,[sp,#4]
        0x00002174:    461a        .F      MOV      r2,r3
        0x00002176:    210b        .!      MOVS     r1,#0xb
        0x00002178:    4802        .H      LDR      r0,[pc,#8] ; [0x2184] = 0x40040800
        0x0000217a:    f7fefd91    ....    BL       GPIO_Init ; 0xca0
        0x0000217e:    b003        ..      ADD      sp,sp,#0xc
        0x00002180:    bd00        ..      POP      {pc}
    $d
        0x00002182:    0000        ..      DCW    0
        0x00002184:    40040800    ...@    DCD    1074006016
    $t
    i.foc_if_charge
    foc_if_charge
        0x00002188:    b410        ..      PUSH     {r4}
        0x0000218a:    4925        %I      LDR      r1,[pc,#148] ; [0x2220] = 0x200010e4
        0x0000218c:    2200        ."      MOVS     r2,#0
        0x0000218e:    78cc        .x      LDRB     r4,[r1,#3]
        0x00002190:    4824        $H      LDR      r0,[pc,#144] ; [0x2224] = 0x40046400
        0x00002192:    2c04        .,      CMP      r4,#4
        0x00002194:    d214        ..      BCS      0x21c0 ; foc_if_charge + 56
        0x00002196:    0023        #.      MOVS     r3,r4
        0x00002198:    447b        {D      ADD      r3,r3,pc
        0x0000219a:    791b        .y      LDRB     r3,[r3,#4]
        0x0000219c:    18db        ..      ADDS     r3,r3,r3
        0x0000219e:    449f        .D      ADD      pc,pc,r3
    $d
        0x000021a0:    2f1f1101    .../    DCD    790565121
    $t
        0x000021a4:    820a        ..      STRH     r2,[r1,#0x10]
        0x000021a6:    4a20         J      LDR      r2,[pc,#128] ; [0x2228] = 0xffff
        0x000021a8:    6042        B`      STR      r2,[r0,#4]
        0x000021aa:    11d0        ..      ASRS     r0,r2,#7
        0x000021ac:    4a1f        .J      LDR      r2,[pc,#124] ; [0x222c] = 0x40046080
        0x000021ae:    6250        Pb      STR      r0,[r2,#0x24]
