747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
        0x000021b0:    6290        .b      STR      r0,[r2,#0x28]
        0x000021b2:    4b1f        .K      LDR      r3,[pc,#124] ; [0x2230] = 0x40046000
        0x000021b4:    6258        Xb      STR      r0,[r3,#0x24]
        0x000021b6:    6350        Pc      STR      r0,[r2,#0x34]
        0x000021b8:    6390        .c      STR      r0,[r2,#0x38]
        0x000021ba:    6358        Xc      STR      r0,[r3,#0x34]
        0x000021bc:    2001        .       MOVS     r0,#1
        0x000021be:    70c8        .p      STRB     r0,[r1,#3]
        0x000021c0:    bc10        ..      POP      {r4}
        0x000021c2:    4770        pG      BX       lr
        0x000021c4:    6844        Dh      LDR      r4,[r0,#4]
        0x000021c6:    2302        .#      MOVS     r3,#2
        0x000021c8:    439c        .C      BICS     r4,r4,r3
        0x000021ca:    6044        D`      STR      r4,[r0,#4]
        0x000021cc:    8a08        ..      LDRH     r0,[r1,#0x10]
        0x000021ce:    1c40        @.      ADDS     r0,r0,#1
        0x000021d0:    b280        ..      UXTH     r0,r0
        0x000021d2:    8208        ..      STRH     r0,[r1,#0x10]
        0x000021d4:    2805        .(      CMP      r0,#5
        0x000021d6:    d9f3        ..      BLS      0x21c0 ; foc_if_charge + 56
        0x000021d8:    820a        ..      STRH     r2,[r1,#0x10]
        0x000021da:    70cb        .p      STRB     r3,[r1,#3]
        0x000021dc:    bc10        ..      POP      {r4}
        0x000021de:    4770        pG      BX       lr
        0x000021e0:    6843        Ch      LDR      r3,[r0,#4]
        0x000021e2:    2401        .$      MOVS     r4,#1
        0x000021e4:    0264        d.      LSLS     r4,r4,#9
        0x000021e6:    43a3        .C      BICS     r3,r3,r4
        0x000021e8:    6043        C`      STR      r3,[r0,#4]
        0x000021ea:    8a08        ..      LDRH     r0,[r1,#0x10]
        0x000021ec:    1c40        @.      ADDS     r0,r0,#1
        0x000021ee:    b280        ..      UXTH     r0,r0
        0x000021f0:    8208        ..      STRH     r0,[r1,#0x10]
        0x000021f2:    2805        .(      CMP      r0,#5
        0x000021f4:    d9f2        ..      BLS      0x21dc ; foc_if_charge + 84
        0x000021f6:    820a        ..      STRH     r2,[r1,#0x10]
        0x000021f8:    2003        .       MOVS     r0,#3
        0x000021fa:    70c8        .p      STRB     r0,[r1,#3]
        0x000021fc:    bc10        ..      POP      {r4}
        0x000021fe:    4770        pG      BX       lr
        0x00002200:    6843        Ch      LDR      r3,[r0,#4]
        0x00002202:    085b        [.      LSRS     r3,r3,#1
        0x00002204:    005b        [.      LSLS     r3,r3,#1
        0x00002206:    6043        C`      STR      r3,[r0,#4]
        0x00002208:    8a08        ..      LDRH     r0,[r1,#0x10]
        0x0000220a:    1c40        @.      ADDS     r0,r0,#1
        0x0000220c:    b280        ..      UXTH     r0,r0
        0x0000220e:    8208        ..      STRH     r0,[r1,#0x10]
        0x00002210:    2805        .(      CMP      r0,#5
        0x00002212:    d9f3        ..      BLS      0x21fc ; foc_if_charge + 116
        0x00002214:    820a        ..      STRH     r2,[r1,#0x10]
        0x00002216:    2004        .       MOVS     r0,#4
        0x00002218:    70c8        .p      STRB     r0,[r1,#3]
        0x0000221a:    bc10        ..      POP      {r4}
        0x0000221c:    4770        pG      BX       lr
    $d
        0x0000221e:    0000        ..      DCW    0
        0x00002220:    200010e4    ...     DCD    536875236
        0x00002224:    40046400    .d.@    DCD    1074029568
        0x00002228:    0000ffff    ....    DCD    65535
        0x0000222c:    40046080    .`.@    DCD    1074028672
        0x00002230:    40046000    .`.@    DCD    1074028544
    $t
    i.foc_if_init
    foc_if_init
        0x00002234:    b510        ..      PUSH     {r4,lr}
        0x00002236:    2214        ."      MOVS     r2,#0x14
        0x00002238:    2100        .!      MOVS     r1,#0
        0x0000223a:    4809        .H      LDR      r0,[pc,#36] ; [0x2260] = 0x2000194c
        0x0000223c:    f7fdff90    ....    BL       __aeabi_memset ; 0x160
        0x00002240:    4807        .H      LDR      r0,[pc,#28] ; [0x2260] = 0x2000194c
        0x00002242:    2200        ."      MOVS     r2,#0
        0x00002244:    7002        .p      STRB     r2,[r0,#0]
        0x00002246:    7042        Bp      STRB     r2,[r0,#1]
        0x00002248:    2101        .!      MOVS     r1,#1
        0x0000224a:    7081        .p      STRB     r1,[r0,#2]
        0x0000224c:    4905        .I      LDR      r1,[pc,#20] ; [0x2264] = 0x200010e4
        0x0000224e:    700a        .p      STRB     r2,[r1,#0]
        0x00002250:    708a        .p      STRB     r2,[r1,#2]
        0x00002252:    1e50        P.      SUBS     r0,r2,#1
        0x00002254:    81c8        ..      STRH     r0,[r1,#0xe]
        0x00002256:    8188        ..      STRH     r0,[r1,#0xc]
        0x00002258:    8148        H.      STRH     r0,[r1,#0xa]
        0x0000225a:    70ca        .p      STRB     r2,[r1,#3]
        0x0000225c:    704a        Jp      STRB     r2,[r1,#1]
        0x0000225e:    bd10        ..      POP      {r4,pc}
    $d
        0x00002260:    2000194c    L..     DCD    536877388
        0x00002264:    200010e4    ...     DCD    536875236
    $t
    i.foc_if_loop
    foc_if_loop
        0x00002268:    b5f8        ..      PUSH     {r3-r7,lr}
        0x0000226a:    4c33        3L      LDR      r4,[pc,#204] ; [0x2338] = 0x200010e4
        0x0000226c:    2604        .&      MOVS     r6,#4
        0x0000226e:    7821        !x      LDRB     r1,[r4,#0]
        0x00002270:    2001        .       MOVS     r0,#1
        0x00002272:    4f32        2O      LDR      r7,[pc,#200] ; [0x233c] = 0xffff
        0x00002274:    2500        .%      MOVS     r5,#0
        0x00002276:    2904        .)      CMP      r1,#4
        0x00002278:    d24a        J.      BCS      0x2310 ; foc_if_loop + 168
        0x0000227a:    000b        ..      MOVS     r3,r1
        0x0000227c:    447b        {D      ADD      r3,r3,pc
        0x0000227e:    791b        .y      LDRB     r3,[r3,#4]
        0x00002280:    18db        ..      ADDS     r3,r3,r3
        0x00002282:    449f        .D      ADD      pc,pc,r3
    $d
        0x00002284:    2f2b2101    .!+/    DCD    791355649
    $t
        0x00002288:    492d        -I      LDR      r1,[pc,#180] ; [0x2340] = 0x2000194c
        0x0000228a:    7809        .x      LDRB     r1,[r1,#0]
        0x0000228c:    2900        .)      CMP      r1,#0
        0x0000228e:    d03f        ?.      BEQ      0x2310 ; foc_if_loop + 168
        0x00002290:    6961        ai      LDR      r1,[r4,#0x14]
        0x00002292:    1c49        I.      ADDS     r1,r1,#1
        0x00002294:    6161        aa      STR      r1,[r4,#0x14]
        0x00002296:    2900        .)      CMP      r1,#0
        0x00002298:    d03a        :.      BEQ      0x2310 ; foc_if_loop + 168
        0x0000229a:    6165        ea      STR      r5,[r4,#0x14]
        0x0000229c:    7861        ax      LDRB     r1,[r4,#1]
        0x0000229e:    2900        .)      CMP      r1,#0
        0x000022a0:    d00c        ..      BEQ      0x22bc ; foc_if_loop + 84
        0x000022a2:    70a5        .p      STRB     r5,[r4,#2]
        0x000022a4:    4927        'I      LDR      r1,[pc,#156] ; [0x2344] = 0x40046400
        0x000022a6:    604f        O`      STR      r7,[r1,#4]
        0x000022a8:    8125        %.      STRH     r5,[r4,#8]
        0x000022aa:    80e5        ..      STRH     r5,[r4,#6]
        0x000022ac:    80a5        ..      STRH     r5,[r4,#4]
        0x000022ae:    4926        &I      LDR      r1,[pc,#152] ; [0x2348] = 0x2000111c
        0x000022b0:    828d        ..      STRH     r5,[r1,#0x14]
        0x000022b2:    608d        .`      STR      r5,[r1,#8]
        0x000022b4:    8265        e.      STRH     r5,[r4,#0x12]
        0x000022b6:    61a5        .a      STR      r5,[r4,#0x18]
        0x000022b8:    7020         p      STRB     r0,[r4,#0]
        0x000022ba:    e029        ).      B        0x2310 ; foc_if_loop + 168
        0x000022bc:    78a0        .x      LDRB     r0,[r4,#2]
        0x000022be:    2802        .(      CMP      r0,#2
        0x000022c0:    d026        &.      BEQ      0x2310 ; foc_if_loop + 168
        0x000022c2:    f000f85b    ..[.    BL       foc_if_measure_ibus_offset ; 0x237c
        0x000022c6:    e023        #.      B        0x2310 ; foc_if_loop + 168
        0x000022c8:    78e0        .x      LDRB     r0,[r4,#3]
        0x000022ca:    2804        .(      CMP      r0,#4
        0x000022cc:    d002        ..      BEQ      0x22d4 ; foc_if_loop + 108
        0x000022ce:    f7ffff5b    ..[.    BL       foc_if_charge ; 0x2188
        0x000022d2:    e01d        ..      B        0x2310 ; foc_if_loop + 168
        0x000022d4:    70e5        .p      STRB     r5,[r4,#3]
        0x000022d6:    2002        .       MOVS     r0,#2
        0x000022d8:    7020         p      STRB     r0,[r4,#0]
        0x000022da:    e019        ..      B        0x2310 ; foc_if_loop + 168
        0x000022dc:    f000f92e    ....    BL       foc_init ; 0x253c
        0x000022e0:    7026        &p      STRB     r6,[r4,#0]
        0x000022e2:    e015        ..      B        0x2310 ; foc_if_loop + 168
        0x000022e4:    4819        .H      LDR      r0,[pc,#100] ; [0x234c] = 0x20000ea2
        0x000022e6:    7800        .x      LDRB     r0,[r0,#0]
        0x000022e8:    2800        .(      CMP      r0,#0
        0x000022ea:    d011        ..      BEQ      0x2310 ; foc_if_loop + 168
        0x000022ec:    4818        .H      LDR      r0,[pc,#96] ; [0x2350] = 0x20000f24
        0x000022ee:    6800        .h      LDR      r0,[r0,#0]
        0x000022f0:    f7fef8f0    ....    BL       __aeabi_i2d ; 0x4d4
        0x000022f4:    2200        ."      MOVS     r2,#0
        0x000022f6:    4b17        .K      LDR      r3,[pc,#92] ; [0x2354] = 0x40768000
        0x000022f8:    f7fdfff6    ....    BL       __aeabi_dmul ; 0x2e8
        0x000022fc:    2200        ."      MOVS     r2,#0
        0x000022fe:    4b16        .K      LDR      r3,[pc,#88] ; [0x2358] = 0x40f921f0
        0x00002300:    f7fef85a    ..Z.    BL       __aeabi_ddiv ; 0x3b8
        0x00002304:    4602        .F      MOV      r2,r0
        0x00002306:    460b        .F      MOV      r3,r1
        0x00002308:    a014        ..      ADR      r0,{pc}+0x54 ; 0x235c
        0x0000230a:    f7fff971    ..q.    BL       __0printf ; 0x15f0
        0x0000230e:    7026        &p      STRB     r6,[r4,#0]
        0x00002310:    480b        .H      LDR      r0,[pc,#44] ; [0x2340] = 0x2000194c
        0x00002312:    7800        .x      LDRB     r0,[r0,#0]
        0x00002314:    2800        .(      CMP      r0,#0
        0x00002316:    d003        ..      BEQ      0x2320 ; foc_if_loop + 184
        0x00002318:    4809        .H      LDR      r0,[pc,#36] ; [0x2340] = 0x2000194c
        0x0000231a:    f000fa6d    ..m.    BL       foc_make_dir ; 0x27f8
        0x0000231e:    bdf8        ..      POP      {r3-r7,pc}
        0x00002320:    2001        .       MOVS     r0,#1
        0x00002322:    4915        .I      LDR      r1,[pc,#84] ; [0x2378] = 0xe000e180
        0x00002324:    0380        ..      LSLS     r0,r0,#14
        0x00002326:    6008        .`      STR      r0,[r1,#0]
        0x00002328:    4806        .H      LDR      r0,[pc,#24] ; [0x2344] = 0x40046400
        0x0000232a:    6047        G`      STR      r7,[r0,#4]
        0x0000232c:    7025        %p      STRB     r5,[r4,#0]
        0x0000232e:    70a5        .p      STRB     r5,[r4,#2]
        0x00002330:    70e5        .p      STRB     r5,[r4,#3]
        0x00002332:    6165        ea      STR      r5,[r4,#0x14]
        0x00002334:    bdf8        ..      POP      {r3-r7,pc}
    $d
        0x00002336:    0000        ..      DCW    0
        0x00002338:    200010e4    ...     DCD    536875236
        0x0000233c:    0000ffff    ....    DCD    65535
        0x00002340:    2000194c    L..     DCD    536877388
        0x00002344:    40046400    .d.@    DCD    1074029568
        0x00002348:    2000111c    ...     DCD    536875292
        0x0000234c:    20000ea2    ...     DCD    536874658
        0x00002350:    20000f24    $..     DCD    536874788
        0x00002354:    40768000    ..v@    DCD    1081507840
        0x00002358:    40f921f0    .!.@    DCD    1090068976
        0x0000235c:    6b726f77    work    DCD    1802661751
        0x00002360:    5f676e69    ing_    DCD    1600613993
        0x00002364:    74656874    thet    DCD    1952802932
        0x00002368:    6c615f61    a_al    DCD    1818320737
        0x0000236c:    206e6769    ign     DCD    544106345
        0x00002370:    25207369    is %    DCD    622883689
        0x00002374:    00000a66    f...    DCD    2662
        0x00002378:    e000e180    ....    DCD    3758154112
    $t
    i.foc_if_measure_ibus_offset
    foc_if_measure_ibus_offset
        0x0000237c:    b5f0        ..      PUSH     {r4-r7,lr}
        0x0000237e:    b085        ..      SUB      sp,sp,#0x14
        0x00002380:    4e51        QN      LDR      r6,[pc,#324] ; [0x24c8] = 0x200010e4
        0x00002382:    2401        .$      MOVS     r4,#1
        0x00002384:    78b0        .x      LDRB     r0,[r6,#2]
        0x00002386:    03a1        ..      LSLS     r1,r4,#14
        0x00002388:    2800        .(      CMP      r0,#0
        0x0000238a:    d03e        >.      BEQ      0x240a ; foc_if_measure_ibus_offset + 142
        0x0000238c:    2801        .(      CMP      r0,#1
        0x0000238e:    d13a        :.      BNE      0x2406 ; foc_if_measure_ibus_offset + 138
        0x00002390:    227d        }"      MOVS     r2,#0x7d
        0x00002392:    69f0        .i      LDR      r0,[r6,#0x1c]
        0x00002394:    00d2        ..      LSLS     r2,r2,#3
        0x00002396:    4f4d        MO      LDR      r7,[pc,#308] ; [0x24cc] = 0x400490c0
        0x00002398:    4d4d        MM      LDR      r5,[pc,#308] ; [0x24d0] = 0x40049000
        0x0000239a:    4290        .B      CMP      r0,r2
        0x0000239c:    da45        E.      BGE      0x242a ; foc_if_measure_ibus_offset + 174
        0x0000239e:    2463        c$      MOVS     r4,#0x63
        0x000023a0:    2000        .       MOVS     r0,#0
        0x000023a2:    494c        LI      LDR      r1,[pc,#304] ; [0x24d4] = 0x40049400
        0x000023a4:    43c0        .C      MVNS     r0,r0
        0x000023a6:    6108        .a      STR      r0,[r1,#0x10]
        0x000023a8:    2006        .       MOVS     r0,#6
        0x000023aa:    6138        8a      STR      r0,[r7,#0x10]
        0x000023ac:    6829        )h      LDR      r1,[r5,#0]
        0x000023ae:    4628        (F      MOV      r0,r5
        0x000023b0:    2207        ."      MOVS     r2,#7
        0x000023b2:    0392        ..      LSLS     r2,r2,#14
        0x000023b4:    4391        .C      BICS     r1,r1,r2
        0x000023b6:    6029        )`      STR      r1,[r5,#0]
        0x000023b8:    6801        .h      LDR      r1,[r0,#0]
        0x000023ba:    6001        .`      STR      r1,[r0,#0]
        0x000023bc:    f7fefbcd    ....    BL       ADC_Start ; 0xb5a
        0x000023c0:    2102        .!      MOVS     r1,#2
        0x000023c2:    4628        (F      MOV      r0,r5
        0x000023c4:    f7fefbb8    ....    BL       ADC_IsEOC ; 0xb38
        0x000023c8:    2800        .(      CMP      r0,#0
        0x000023ca:    d0f9        ..      BEQ      0x23c0 ; foc_if_measure_ibus_offset + 68
        0x000023cc:    2104        .!      MOVS     r1,#4
        0x000023ce:    4628        (F      MOV      r0,r5
        0x000023d0:    f7fefbb2    ....    BL       ADC_IsEOC ; 0xb38
        0x000023d4:    2800        .(      CMP      r0,#0
        0x000023d6:    d0f9        ..      BEQ      0x23cc ; foc_if_measure_ibus_offset + 80
        0x000023d8:    6a68        hj      LDR      r0,[r5,#0x24]
        0x000023da:    6a71        qj      LDR      r1,[r6,#0x24]
        0x000023dc:    0500        ..      LSLS     r0,r0,#20
        0x000023de:    0c40        @.      LSRS     r0,r0,#17
        0x000023e0:    1840        @.      ADDS     r0,r0,r1
        0x000023e2:    1101        ..      ASRS     r1,r0,#4
        0x000023e4:    6331        1c      STR      r1,[r6,#0x30]
        0x000023e6:    1a40        @.      SUBS     r0,r0,r1
        0x000023e8:    6270        pb      STR      r0,[r6,#0x24]
        0x000023ea:    6b68        hk      LDR      r0,[r5,#0x34]
        0x000023ec:    6ab1        .j      LDR      r1,[r6,#0x28]
        0x000023ee:    0500        ..      LSLS     r0,r0,#20
        0x000023f0:    0c40        @.      LSRS     r0,r0,#17
        0x000023f2:    1840        @.      ADDS     r0,r0,r1
        0x000023f4:    1101        ..      ASRS     r1,r0,#4
        0x000023f6:    6371        qc      STR      r1,[r6,#0x34]
        0x000023f8:    1a40        @.      SUBS     r0,r0,r1
        0x000023fa:    62b0        .b      STR      r0,[r6,#0x28]
        0x000023fc:    69f0        .i      LDR      r0,[r6,#0x1c]
        0x000023fe:    1c40        @.      ADDS     r0,r0,#1
        0x00002400:    61f0        .a      STR      r0,[r6,#0x1c]
        0x00002402:    1e64        d.      SUBS     r4,r4,#1
        0x00002404:    d2cc        ..      BCS      0x23a0 ; foc_if_measure_ibus_offset + 36
        0x00002406:    b005        ..      ADD      sp,sp,#0x14
        0x00002408:    bdf0        ..      POP      {r4-r7,pc}
        0x0000240a:    2000        .       MOVS     r0,#0
        0x0000240c:    6370        pc      STR      r0,[r6,#0x34]
        0x0000240e:    6330        0c      STR      r0,[r6,#0x30]
        0x00002410:    62f0        .b      STR      r0,[r6,#0x2c]
        0x00002412:    62b0        .b      STR      r0,[r6,#0x28]
        0x00002414:    6270        pb      STR      r0,[r6,#0x24]
        0x00002416:    6230        0b      STR      r0,[r6,#0x20]
        0x00002418:    61f0        .a      STR      r0,[r6,#0x1c]
        0x0000241a:    70b4        .p      STRB     r4,[r6,#2]
        0x0000241c:    4a2f        /J      LDR      r2,[pc,#188] ; [0x24dc] = 0x40046400
        0x0000241e:    482e        .H      LDR      r0,[pc,#184] ; [0x24d8] = 0xffff
        0x00002420:    6050        P`      STR      r0,[r2,#4]
        0x00002422:    482f        /H      LDR      r0,[pc,#188] ; [0x24e0] = 0xe000e180
        0x00002424:    6001        .`      STR      r1,[r0,#0]
        0x00002426:    b005        ..      ADD      sp,sp,#0x14
        0x00002428:    bdf0        ..      POP      {r4-r7,pc}
        0x0000242a:    482e        .H      LDR      r0,[pc,#184] ; [0x24e4] = 0x1c701c7
        0x0000242c:    6138        8a      STR      r0,[r7,#0x10]
        0x0000242e:    6828        (h      LDR      r0,[r5,#0]
        0x00002430:    4308        .C      ORRS     r0,r0,r1
        0x00002432:    6028        (`      STR      r0,[r5,#0]
        0x00002434:    4824        $H      LDR      r0,[pc,#144] ; [0x24c8] = 0x200010e4
        0x00002436:    8d80        ..      LDRH     r0,[r0,#0x2c]
        0x00002438:    b201        ..      SXTH     r1,r0
        0x0000243a:    4823        #H      LDR      r0,[pc,#140] ; [0x24c8] = 0x200010e4
        0x0000243c:    8141        A.      STRH     r1,[r0,#0xa]
        0x0000243e:    8e00        ..      LDRH     r0,[r0,#0x30]
        0x00002440:    b202        ..      SXTH     r2,r0
        0x00002442:    4821        !H      LDR      r0,[pc,#132] ; [0x24c8] = 0x200010e4
        0x00002444:    8182        ..      STRH     r2,[r0,#0xc]
        0x00002446:    8e80        ..      LDRH     r0,[r0,#0x34]
        0x00002448:    b203        ..      SXTH     r3,r0
        0x0000244a:    481f        .H      LDR      r0,[pc,#124] ; [0x24c8] = 0x200010e4
        0x0000244c:    81c3        ..      STRH     r3,[r0,#0xe]
        0x0000244e:    2502        .%      MOVS     r5,#2
        0x00002450:    7085        .p      STRB     r5,[r0,#2]
        0x00002452:    7044        Dp      STRB     r4,[r0,#1]
        0x00002454:    a024        $.      ADR      r0,{pc}+0x94 ; 0x24e8
        0x00002456:    f7fff8cb    ....    BL       __0printf ; 0x15f0
        0x0000245a:    481b        .H      LDR      r0,[pc,#108] ; [0x24c8] = 0x200010e4
        0x0000245c:    210e        .!      MOVS     r1,#0xe
        0x0000245e:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00002460:    10c8        ..      ASRS     r0,r1,#3
        0x00002462:    f7fef837    ..7.    BL       __aeabi_i2d ; 0x4d4
        0x00002466:    4a2e        .J      LDR      r2,[pc,#184] ; [0x2520] = 0xcccccccd
        0x00002468:    4b2e        .K      LDR      r3,[pc,#184] ; [0x2524] = 0x400ccccc
        0x0000246a:    f7fdff3d    ..=.    BL       __aeabi_dmul ; 0x2e8
        0x0000246e:    220b        ."      MOVS     r2,#0xb
        0x00002470:    43d2        .C      MVNS     r2,r2
        0x00002472:    f7fef819    ....    BL       __ARM_scalbn ; 0x4a8
        0x00002476:    4606        .F      MOV      r6,r0
        0x00002478:    460f        .F      MOV      r7,r1
        0x0000247a:    4813        .H      LDR      r0,[pc,#76] ; [0x24c8] = 0x200010e4
        0x0000247c:    210c        .!      MOVS     r1,#0xc
        0x0000247e:    5e41        A^      LDRSH    r1,[r0,r1]
        0x00002480:    10c8        ..      ASRS     r0,r1,#3
        0x00002482:    f7fef827    ..'.    BL       __aeabi_i2d ; 0x4d4
        0x00002486:    4a26        &J      LDR      r2,[pc,#152] ; [0x2520] = 0xcccccccd
        0x00002488:    4b26        &K      LDR      r3,[pc,#152] ; [0x2524] = 0x400ccccc
        0x0000248a:    f7fdff2d    ..-.    BL       __aeabi_dmul ; 0x2e8
        0x0000248e:    220b        ."      MOVS     r2,#0xb
        0x00002490:    43d2        .C      MVNS     r2,r2
        0x00002492:    f7fef809    ....    BL       __ARM_scalbn ; 0x4a8
        0x00002496:    4604        .F      MOV      r4,r0
        0x00002498:    460d        .F      MOV      r5,r1
        0x0000249a:    480b        .H      LDR      r0,[pc,#44] ; [0x24c8] = 0x200010e4
        0x0000249c:    210a        .!      MOVS     r1,#0xa
        0x0000249e:    5e41        A^      LDRSH    r1,[r0,r1]
        0x000024a0:    10c8        ..      ASRS     r0,r1,#3
        0x000024a2:    f7fef817    ....    BL       __aeabi_i2d ; 0x4d4
        0x000024a6:    4a1e        .J      LDR      r2,[pc,#120] ; [0x2520] = 0xcccccccd
        0x000024a8:    4b1e        .K      LDR      r3,[pc,#120] ; [0x2524] = 0x400ccccc
        0x000024aa:    f7fdff1d    ....    BL       __aeabi_dmul ; 0x2e8
        0x000024ae:    220b        ."      MOVS     r2,#0xb
        0x000024b0:    43d2        .C      MVNS     r2,r2
        0x000024b2:    f7fdfff9    ....    BL       __ARM_scalbn ; 0x4a8
        0x000024b6:    460b        .F      MOV      r3,r1
        0x000024b8:    4669        iF      MOV      r1,sp
        0x000024ba:    c1f0        ..      STM      r1!,{r4-r7}
        0x000024bc:    4602        .F      MOV      r2,r0
        0x000024be:    a01a        ..      ADR      r0,{pc}+0x6a ; 0x2528
        0x000024c0:    f7fff896    ....    BL       __0printf ; 0x15f0
        0x000024c4:    b005        ..      ADD      sp,sp,#0x14
        0x000024c6:    bdf0        ..      POP      {r4-r7,pc}
    $d
        0x000024c8:    200010e4    ...     DCD    536875236
        0x000024cc:    400490c0    ...@    DCD    1074041024
        0x000024d0:    40049000    ...@    DCD    1074040832
        0x000024d4:    40049400    ...@    DCD    1074041856
        0x000024d8:    0000ffff    ....    DCD    65535
        0x000024dc:    40046400    .d.@    DCD    1074029568
        0x000024e0:    e000e180    ....    DCD    3758154112
        0x000024e4:    01c701c7    ....    DCD    29819335
        0x000024e8:    7543636d    mcCu    DCD    1967350637
        0x000024ec:    66664f72    rOff    DCD    1717981042
