747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
        0x000024f0:    5f746573    set_    DCD    1601463667
        0x000024f4:    64252075    u %d    DCD    1680154741
        0x000024f8:    636d202c    , mc    DCD    1668096044
        0x000024fc:    4f727543    CurO    DCD    1332901187
        0x00002500:    65736666    ffse    DCD    1702061670
        0x00002504:    20765f74    t_v     DCD    544628596
        0x00002508:    202c6425    %d,     DCD    539780133
        0x0000250c:    7543636d    mcCu    DCD    1967350637
        0x00002510:    66664f72    rOff    DCD    1717981042
        0x00002514:    5f746573    set_    DCD    1601463667
        0x00002518:    64252077    w %d    DCD    1680154743
        0x0000251c:    0000000a    ....    DCD    10
        0x00002520:    cccccccd    ....    DCD    3435973837
        0x00002524:    400ccccc    ...@    DCD    1074580684
        0x00002528:    66252075    u %f    DCD    1713709173
        0x0000252c:    2076202c    , v     DCD    544612396
        0x00002530:    202c6625    %f,     DCD    539780645
        0x00002534:    66252077    w %f    DCD    1713709175
        0x00002538:    0000000a    ....    DCD    10
    $t
    i.foc_init
    foc_init
        0x0000253c:    b5f0        ..      PUSH     {r4-r7,lr}
        0x0000253e:    b083        ..      SUB      sp,sp,#0xc
        0x00002540:    b672        r.      CPSID    i
        0x00002542:    2001        .       MOVS     r0,#1
        0x00002544:    4981        .I      LDR      r1,[pc,#516] ; [0x274c] = 0xe000e180
        0x00002546:    0380        ..      LSLS     r0,r0,#14
        0x00002548:    6008        .`      STR      r0,[r1,#0]
        0x0000254a:    4982        .I      LDR      r1,[pc,#520] ; [0x2754] = 0x40046400
        0x0000254c:    4880        .H      LDR      r0,[pc,#512] ; [0x2750] = 0xffff
        0x0000254e:    6048        H`      STR      r0,[r1,#4]
        0x00002550:    2400        .$      MOVS     r4,#0
        0x00002552:    4608        .F      MOV      r0,r1
        0x00002554:    6004        .`      STR      r4,[r0,#0]
        0x00002556:    4880        .H      LDR      r0,[pc,#512] ; [0x2758] = 0x40046000
        0x00002558:    6881        .h      LDR      r1,[r0,#8]
        0x0000255a:    0a89        ..      LSRS     r1,r1,#10
        0x0000255c:    0289        ..      LSLS     r1,r1,#10
        0x0000255e:    6081        .`      STR      r1,[r0,#8]
        0x00002560:    6881        .h      LDR      r1,[r0,#8]
        0x00002562:    0849        I.      LSRS     r1,r1,#1
        0x00002564:    0049        I.      LSLS     r1,r1,#1
        0x00002566:    6081        .`      STR      r1,[r0,#8]
        0x00002568:    6881        .h      LDR      r1,[r0,#8]
        0x0000256a:    2210        ."      MOVS     r2,#0x10
        0x0000256c:    4391        .C      BICS     r1,r1,r2
        0x0000256e:    6081        .`      STR      r1,[r0,#8]
        0x00002570:    487a        zH      LDR      r0,[pc,#488] ; [0x275c] = 0x40046080
        0x00002572:    6881        .h      LDR      r1,[r0,#8]
        0x00002574:    0a89        ..      LSRS     r1,r1,#10
        0x00002576:    0289        ..      LSLS     r1,r1,#10
        0x00002578:    6081        .`      STR      r1,[r0,#8]
        0x0000257a:    6881        .h      LDR      r1,[r0,#8]
        0x0000257c:    0849        I.      LSRS     r1,r1,#1
        0x0000257e:    0049        I.      LSLS     r1,r1,#1
        0x00002580:    6081        .`      STR      r1,[r0,#8]
        0x00002582:    6881        .h      LDR      r1,[r0,#8]
        0x00002584:    4391        .C      BICS     r1,r1,r2
        0x00002586:    6081        .`      STR      r1,[r0,#8]
        0x00002588:    4875        uH      LDR      r0,[pc,#468] ; [0x2760] = 0x40049000
        0x0000258a:    6801        .h      LDR      r1,[r0,#0]
        0x0000258c:    0212        ..      LSLS     r2,r2,#8
        0x0000258e:    4391        .C      BICS     r1,r1,r2
        0x00002590:    6001        .`      STR      r1,[r0,#0]
        0x00002592:    6801        .h      LDR      r1,[r0,#0]
        0x00002594:    0192        ..      LSLS     r2,r2,#6
        0x00002596:    4391        .C      BICS     r1,r1,r2
        0x00002598:    6001        .`      STR      r1,[r0,#0]
        0x0000259a:    6801        .h      LDR      r1,[r0,#0]
        0x0000259c:    1112        ..      ASRS     r2,r2,#4
        0x0000259e:    4311        .C      ORRS     r1,r1,r2
        0x000025a0:    6001        .`      STR      r1,[r0,#0]
        0x000025a2:    1e61        a.      SUBS     r1,r4,#1
        0x000025a4:    60c1        .`      STR      r1,[r0,#0xc]
        0x000025a6:    4d6f        oM      LDR      r5,[pc,#444] ; [0x2764] = 0x20000ea0
        0x000025a8:    84ec        ..      STRH     r4,[r5,#0x26]
        0x000025aa:    84ac        ..      STRH     r4,[r5,#0x24]
        0x000025ac:    856c        l.      STRH     r4,[r5,#0x2a]
        0x000025ae:    852c        ,.      STRH     r4,[r5,#0x28]
        0x000025b0:    486d        mH      LDR      r0,[pc,#436] ; [0x2768] = 0x20001068
        0x000025b2:    8284        ..      STRH     r4,[r0,#0x14]
        0x000025b4:    6084        .`      STR      r4,[r0,#8]
        0x000025b6:    486d        mH      LDR      r0,[pc,#436] ; [0x276c] = 0x20001040
        0x000025b8:    8284        ..      STRH     r4,[r0,#0x14]
        0x000025ba:    6084        .`      STR      r4,[r0,#8]
        0x000025bc:    70ac        .p      STRB     r4,[r5,#2]
        0x000025be:    67ec        .g      STR      r4,[r5,#0x7c]
        0x000025c0:    4e6b        kN      LDR      r6,[pc,#428] ; [0x2770] = 0x20000f20
        0x000025c2:    6034        4`      STR      r4,[r6,#0]
        0x000025c4:    486b        kH      LDR      r0,[pc,#428] ; [0x2774] = 0x16124
        0x000025c6:    6070        p`      STR      r0,[r6,#4]
        0x000025c8:    486b        kH      LDR      r0,[pc,#428] ; [0x2778] = 0x20000f00
        0x000025ca:    9002        ..      STR      r0,[sp,#8]
        0x000025cc:    8004        ..      STRH     r4,[r0,#0]
        0x000025ce:    67b4        .g      STR      r4,[r6,#0x78]
        0x000025d0:    486a        jH      LDR      r0,[pc,#424] ; [0x277c] = 0x40366666
        0x000025d2:    6530        0e      STR      r0,[r6,#0x50]
        0x000025d4:    1e8a        ..      SUBS     r2,r1,#2
        0x000025d6:    0740        @.      LSLS     r0,r0,#29
        0x000025d8:    4969        iI      LDR      r1,[pc,#420] ; [0x2780] = 0x4006cccc
        0x000025da:    f7fdff65    ..e.    BL       __ARM_scalbn ; 0x4a8
        0x000025de:    2200        ."      MOVS     r2,#0
        0x000025e0:    4b68        hK      LDR      r3,[pc,#416] ; [0x2784] = 0x40dfffc0
        0x000025e2:    f7fdfe81    ....    BL       __aeabi_dmul ; 0x2e8
        0x000025e6:    f7fdff97    ....    BL       __aeabi_d2iz ; 0x518
        0x000025ea:    4f67        gO      LDR      r7,[pc,#412] ; [0x2788] = 0x20000ee0
        0x000025ec:    83f8        ..      STRH     r0,[r7,#0x1e]
        0x000025ee:    4867        gH      LDR      r0,[pc,#412] ; [0x278c] = 0x2eea
        0x000025f0:    6570        pe      STR      r0,[r6,#0x54]
        0x000025f2:    4867        gH      LDR      r0,[pc,#412] ; [0x2790] = 0xba666666
        0x000025f4:    4967        gI      LDR      r1,[pc,#412] ; [0x2794] = 0x403f1de7
        0x000025f6:    f7fdff8f    ....    BL       __aeabi_d2iz ; 0x518
        0x000025fa:    6770        pg      STR      r0,[r6,#0x74]
        0x000025fc:    4966        fI      LDR      r1,[pc,#408] ; [0x2798] = 0xa78c
        0x000025fe:    6631        1f      STR      r1,[r6,#0x60]
        0x00002600:    6671        qf      STR      r1,[r6,#0x64]
        0x00002602:    4966        fI      LDR      r1,[pc,#408] ; [0x279c] = 0xd676
        0x00002604:    65b1        .e      STR      r1,[r6,#0x58]
        0x00002606:    4966        fI      LDR      r1,[pc,#408] ; [0x27a0] = 0x78a2
        0x00002608:    65f1        .e      STR      r1,[r6,#0x5c]
        0x0000260a:    2101        .!      MOVS     r1,#1
        0x0000260c:    70e9        .p      STRB     r1,[r5,#3]
        0x0000260e:    4965        eI      LDR      r1,[pc,#404] ; [0x27a4] = 0x20000fa0
        0x00002610:    6048        H`      STR      r0,[r1,#4]
        0x00002612:    4865        eH      LDR      r0,[pc,#404] ; [0x27a8] = 0x9017
        0x00002614:    67f0        .g      STR      r0,[r6,#0x7c]
        0x00002616:    4861        aH      LDR      r0,[pc,#388] ; [0x279c] = 0xd676
        0x00002618:    6088        .`      STR      r0,[r1,#8]
        0x0000261a:    4861        aH      LDR      r0,[pc,#388] ; [0x27a0] = 0x78a2
        0x0000261c:    60c8        .`      STR      r0,[r1,#0xc]
        0x0000261e:    2001        .       MOVS     r0,#1
        0x00002620:    7168        hq      STRB     r0,[r5,#5]
        0x00002622:    4862        bH      LDR      r0,[pc,#392] ; [0x27ac] = 0xb325682d
        0x00002624:    4962        bI      LDR      r1,[pc,#392] ; [0x27b0] = 0x40ca0bbd
        0x00002626:    f7fdff77    ..w.    BL       __aeabi_d2iz ; 0x518
        0x0000262a:    8628        (.      STRH     r0,[r5,#0x30]
        0x0000262c:    8668        h.      STRH     r0,[r5,#0x32]
        0x0000262e:    485d        ]H      LDR      r0,[pc,#372] ; [0x27a4] = 0x20000fa0
        0x00002630:    6104        .a      STR      r4,[r0,#0x10]
        0x00002632:    71ac        .q      STRB     r4,[r5,#6]
        0x00002634:    485f        _H      LDR      r0,[pc,#380] ; [0x27b4] = 0xccc
        0x00002636:    83b8        ..      STRH     r0,[r7,#0x1c]
        0x00002638:    485f        _H      LDR      r0,[pc,#380] ; [0x27b8] = 0xca7bba7f
        0x0000263a:    4960        `I      LDR      r1,[pc,#384] ; [0x27bc] = 0x40666243
        0x0000263c:    f7fdff6c    ..l.    BL       __aeabi_d2iz ; 0x518
        0x00002640:    b204        ..      SXTH     r4,r0
        0x00002642:    485f        _H      LDR      r0,[pc,#380] ; [0x27c0] = 0x20000fc8
        0x00002644:    8044        D.      STRH     r4,[r0,#2]
        0x00002646:    485f        _H      LDR      r0,[pc,#380] ; [0x27c4] = 0x5fb65d8a
        0x00002648:    495f        _I      LDR      r1,[pc,#380] ; [0x27c8] = 0x409750b6
        0x0000264a:    f7fdff65    ..e.    BL       __aeabi_d2iz ; 0x518
        0x0000264e:    495c        \I      LDR      r1,[pc,#368] ; [0x27c0] = 0x20000fc8
        0x00002650:    b200        ..      SXTH     r0,r0
        0x00002652:    8088        ..      STRH     r0,[r1,#4]
        0x00002654:    2c3e        >,      CMP      r4,#0x3e
        0x00002656:    da02        ..      BGE      0x265e ; foc_init + 290
        0x00002658:    4a59        YJ      LDR      r2,[pc,#356] ; [0x27c0] = 0x20000fc8
        0x0000265a:    213e        >!      MOVS     r1,#0x3e
        0x0000265c:    8051        Q.      STRH     r1,[r2,#2]
        0x0000265e:    4c58        XL      LDR      r4,[pc,#352] ; [0x27c0] = 0x20000fc8
        0x00002660:    25b7        .%      MOVS     r5,#0xb7
        0x00002662:    28b7        .(      CMP      r0,#0xb7
        0x00002664:    da00        ..      BGE      0x2668 ; foc_init + 300
        0x00002666:    80a5        ..      STRH     r5,[r4,#4]
        0x00002668:    2003        .       MOVS     r0,#3
        0x0000266a:    2201        ."      MOVS     r2,#1
        0x0000266c:    0780        ..      LSLS     r0,r0,#30
        0x0000266e:    4944        DI      LDR      r1,[pc,#272] ; [0x2780] = 0x4006cccc
        0x00002670:    f7fdff1a    ....    BL       __ARM_scalbn ; 0x4a8
        0x00002674:    4a55        UJ      LDR      r2,[pc,#340] ; [0x27cc] = 0x54442d18
        0x00002676:    4b56        VK      LDR      r3,[pc,#344] ; [0x27d0] = 0x401921fb
        0x00002678:    f7fdfe36    ..6.    BL       __aeabi_dmul ; 0x2e8
        0x0000267c:    f7fdff4c    ..L.    BL       __aeabi_d2iz ; 0x518
        0x00002680:    b206        ..      SXTH     r6,r0
        0x00002682:    4854        TH      LDR      r0,[pc,#336] ; [0x27d4] = 0x20000ff0
        0x00002684:    8046        F.      STRH     r6,[r0,#2]
        0x00002686:    4854        TH      LDR      r0,[pc,#336] ; [0x27d8] = 0xadb63a4a
        0x00002688:    4954        TI      LDR      r1,[pc,#336] ; [0x27dc] = 0x404dd7f3
        0x0000268a:    f7fdff45    ..E.    BL       __aeabi_d2iz ; 0x518
        0x0000268e:    4951        QI      LDR      r1,[pc,#324] ; [0x27d4] = 0x20000ff0
        0x00002690:    b200        ..      SXTH     r0,r0
        0x00002692:    8088        ..      STRH     r0,[r1,#4]
        0x00002694:    2e3e        >.      CMP      r6,#0x3e
        0x00002696:    da01        ..      BGE      0x269c ; foc_init + 352
        0x00002698:    213e        >!      MOVS     r1,#0x3e
        0x0000269a:    8061        a.      STRH     r1,[r4,#2]
        0x0000269c:    28b7        .(      CMP      r0,#0xb7
        0x0000269e:    da00        ..      BGE      0x26a2 ; foc_init + 358
        0x000026a0:    80a5        ..      STRH     r5,[r4,#4]
        0x000026a2:    494f        OI      LDR      r1,[pc,#316] ; [0x27e0] = 0x20001018
        0x000026a4:    804e        N.      STRH     r6,[r1,#2]
        0x000026a6:    8088        ..      STRH     r0,[r1,#4]
        0x000026a8:    2e3e        >.      CMP      r6,#0x3e
        0x000026aa:    da01        ..      BGE      0x26b0 ; foc_init + 372
        0x000026ac:    213e        >!      MOVS     r1,#0x3e
        0x000026ae:    8061        a.      STRH     r1,[r4,#2]
        0x000026b0:    28b7        .(      CMP      r0,#0xb7
        0x000026b2:    da00        ..      BGE      0x26b6 ; foc_init + 378
        0x000026b4:    80a5        ..      STRH     r5,[r4,#4]
        0x000026b6:    4e2b        +N      LDR      r6,[pc,#172] ; [0x2764] = 0x20000ea0
        0x000026b8:    2400        .$      MOVS     r4,#0
        0x000026ba:    7134        4q      STRB     r4,[r6,#4]
        0x000026bc:    2020                MOVS     r0,#0x20
        0x000026be:    87b0        ..      STRH     r0,[r6,#0x3c]
        0x000026c0:    2001        .       MOVS     r0,#1
        0x000026c2:    71f0        .q      STRB     r0,[r6,#7]
        0x000026c4:    4d37        7M      LDR      r5,[pc,#220] ; [0x27a4] = 0x20000fa0
        0x000026c6:    20dc        .       MOVS     r0,#0xdc
        0x000026c8:    6168        ha      STR      r0,[r5,#0x14]
        0x000026ca:    9802        ..      LDR      r0,[sp,#8]
        0x000026cc:    8144        D.      STRH     r4,[r0,#0xa]
        0x000026ce:    9802        ..      LDR      r0,[sp,#8]
        0x000026d0:    8184        ..      STRH     r4,[r0,#0xc]
        0x000026d2:    1e62        b.      SUBS     r2,r4,#1
        0x000026d4:    2000        .       MOVS     r0,#0
        0x000026d6:    4943        CI      LDR      r1,[pc,#268] ; [0x27e4] = 0x40590000
        0x000026d8:    f7fdfee6    ....    BL       __ARM_scalbn ; 0x4a8
        0x000026dc:    f7fdff1c    ....    BL       __aeabi_d2iz ; 0x518
        0x000026e0:    61a8        .a      STR      r0,[r5,#0x18]
        0x000026e2:    61ec        .a      STR      r4,[r5,#0x1c]
        0x000026e4:    622c        ,b      STR      r4,[r5,#0x20]
        0x000026e6:    4840        @H      LDR      r0,[pc,#256] ; [0x27e8] = 0x51eb851f
        0x000026e8:    4940        @I      LDR      r1,[pc,#256] ; [0x27ec] = 0x409015b8
        0x000026ea:    f7fdff15    ....    BL       __aeabi_d2iz ; 0x518
        0x000026ee:    6268        hb      STR      r0,[r5,#0x24]
        0x000026f0:    7234        4r      STRB     r4,[r6,#8]
        0x000026f2:    481f        .H      LDR      r0,[pc,#124] ; [0x2770] = 0x20000f20
        0x000026f4:    60c4        .`      STR      r4,[r0,#0xc]
        0x000026f6:    2100        .!      MOVS     r1,#0
        0x000026f8:    4608        .F      MOV      r0,r1
        0x000026fa:    f7fef885    ....    BL       $Ven$TT$L$$foc_svm_gen ; 0x808
        0x000026fe:    4817        .H      LDR      r0,[pc,#92] ; [0x275c] = 0x40046080
        0x00002700:    89b9        ..      LDRH     r1,[r7,#0xc]
        0x00002702:    6241        Ab      STR      r1,[r0,#0x24]
        0x00002704:    8a79        y.      LDRH     r1,[r7,#0x12]
        0x00002706:    6341        Ac      STR      r1,[r0,#0x34]
        0x00002708:    89f9        ..      LDRH     r1,[r7,#0xe]
        0x0000270a:    6281        .b      STR      r1,[r0,#0x28]
        0x0000270c:    8ab9        ..      LDRH     r1,[r7,#0x14]
        0x0000270e:    6381        .c      STR      r1,[r0,#0x38]
        0x00002710:    4811        .H      LDR      r0,[pc,#68] ; [0x2758] = 0x40046000
        0x00002712:    8a39        9.      LDRH     r1,[r7,#0x10]
        0x00002714:    6241        Ab      STR      r1,[r0,#0x24]
        0x00002716:    8af9        ..      LDRH     r1,[r7,#0x16]
        0x00002718:    6341        Ac      STR      r1,[r0,#0x34]
        0x0000271a:    2300        .#      MOVS     r3,#0
        0x0000271c:    9400        ..      STR      r4,[sp,#0]
        0x0000271e:    461a        .F      MOV      r2,r3
        0x00002720:    4933        3I      LDR      r1,[pc,#204] ; [0x27f0] = 0x7a3
        0x00002722:    9401        ..      STR      r4,[sp,#4]
        0x00002724:    f7fefd2c    ..,.    BL       PWM_CmpTrigger ; 0x1180
        0x00002728:    480d        .H      LDR      r0,[pc,#52] ; [0x2760] = 0x40049000
        0x0000272a:    1e61        a.      SUBS     r1,r4,#1
        0x0000272c:    60c1        .`      STR      r1,[r0,#0xc]
        0x0000272e:    6801        .h      LDR      r1,[r0,#0]
        0x00002730:    2201        ."      MOVS     r2,#1
        0x00002732:    0312        ..      LSLS     r2,r2,#12
        0x00002734:    4311        .C      ORRS     r1,r1,r2
        0x00002736:    6001        .`      STR      r1,[r0,#0]
        0x00002738:    4806        .H      LDR      r0,[pc,#24] ; [0x2754] = 0x40046400
        0x0000273a:    6044        D`      STR      r4,[r0,#4]
        0x0000273c:    2103        .!      MOVS     r1,#3
        0x0000273e:    6001        .`      STR      r1,[r0,#0]
        0x00002740:    492c        ,I      LDR      r1,[pc,#176] ; [0x27f4] = 0xe000e100
        0x00002742:    2080        .       MOVS     r0,#0x80
        0x00002744:    6008        .`      STR      r0,[r1,#0]
        0x00002746:    b662        b.      CPSIE    i
        0x00002748:    b003        ..      ADD      sp,sp,#0xc
        0x0000274a:    bdf0        ..      POP      {r4-r7,pc}
    $d
        0x0000274c:    e000e180    ....    DCD    3758154112
        0x00002750:    0000ffff    ....    DCD    65535
        0x00002754:    40046400    .d.@    DCD    1074029568
        0x00002758:    40046000    .`.@    DCD    1074028544
        0x0000275c:    40046080    .`.@    DCD    1074028672
        0x00002760:    40049000    ...@    DCD    1074040832
        0x00002764:    20000ea0    ...     DCD    536874656
        0x00002768:    20001068    h..     DCD    536875112
        0x0000276c:    20001040    @..     DCD    536875072
        0x00002770:    20000f20     ..     DCD    536874784
        0x00002774:    00016124    $a..    DCD    90404
        0x00002778:    20000f00    ...     DCD    536874752
        0x0000277c:    40366666    ff6@    DCD    1077306982
        0x00002780:    4006cccc    ...@    DCD    1074187468
        0x00002784:    40dfffc0    ...@    DCD    1088421824
        0x00002788:    20000ee0    ...     DCD    536874720
        0x0000278c:    00002eea    ....    DCD    12010
        0x00002790:    ba666666    fff.    DCD    3127273062
        0x00002794:    403f1de7    ..?@    DCD    1077878247
        0x00002798:    0000a78c    ....    DCD    42892
        0x0000279c:    0000d676    v...    DCD    54902
        0x000027a0:    000078a2    .x..    DCD    30882
        0x000027a4:    20000fa0    ...     DCD    536874912
        0x000027a8:    00009017    ....    DCD    36887
        0x000027ac:    b325682d    -h%.    DCD    3005573165
        0x000027b0:    40ca0bbd    ...@    DCD    1086983101
        0x000027b4:    00000ccc    ....    DCD    3276
        0x000027b8:    ca7bba7f    ..{.    DCD    3397106303
        0x000027bc:    40666243    Cbf@    DCD    1080451651
        0x000027c0:    20000fc8    ...     DCD    536874952
        0x000027c4:    5fb65d8a    .]._    DCD    1605787018
        0x000027c8:    409750b6    .P.@    DCD    1083658422
        0x000027cc:    54442d18    .-DT    DCD    1413754136
        0x000027d0:    401921fb    .!.@    DCD    1075388923
        0x000027d4:    20000ff0    ...     DCD    536874992
        0x000027d8:    adb63a4a    J:..    DCD    2914400842
        0x000027dc:    404dd7f3    ..M@    DCD    1078843379
        0x000027e0:    20001018    ...     DCD    536875032
        0x000027e4:    40590000    ..Y@    DCD    1079574528
        0x000027e8:    51eb851f    ...Q    DCD    1374389535
        0x000027ec:    409015b8    ...@    DCD    1083184568
        0x000027f0:    000007a3    ....    DCD    1955
        0x000027f4:    e000e100    ....    DCD    3758153984
    $t
    i.foc_make_dir
    foc_make_dir
        0x000027f8:    7881        .x      LDRB     r1,[r0,#2]
        0x000027fa:    2900        .)      CMP      r1,#0
        0x000027fc:    d00a        ..      BEQ      0x2814 ; foc_make_dir + 28
        0x000027fe:    2200        ."      MOVS     r2,#0
        0x00002800:    2301        .#      MOVS     r3,#1
        0x00002802:    2901        .)      CMP      r1,#1
        0x00002804:    d007        ..      BEQ      0x2816 ; foc_make_dir + 30
        0x00002806:    2902        .)      CMP      r1,#2
        0x00002808:    d104        ..      BNE      0x2814 ; foc_make_dir + 28
        0x0000280a:    2108        .!      MOVS     r1,#8
        0x0000280c:    5e41        A^      LDRSH    r1,[r0,r1]
        0x0000280e:    2900        .)      CMP      r1,#0
        0x00002810:    dd0b        ..      BLE      0x282a ; foc_make_dir + 50
        0x00002812:    7042        Bp      STRB     r2,[r0,#1]
        0x00002814:    4770        pG      BX       lr
        0x00002816:    2106        .!      MOVS     r1,#6
        0x00002818:    5e41        A^      LDRSH    r1,[r0,r1]
        0x0000281a:    2900        .)      CMP      r1,#0
        0x0000281c:    dd01        ..      BLE      0x2822 ; foc_make_dir + 42
        0x0000281e:    7042        Bp      STRB     r2,[r0,#1]
        0x00002820:    4770        pG      BX       lr
        0x00002822:    2900        .)      CMP      r1,#0
        0x00002824:    dafc        ..      BGE      0x2820 ; foc_make_dir + 40
        0x00002826:    7043        Cp      STRB     r3,[r0,#1]
        0x00002828:    4770        pG      BX       lr
        0x0000282a:    2900        .)      CMP      r1,#0
        0x0000282c:    dafc        ..      BGE      0x2828 ; foc_make_dir + 48
        0x0000282e:    7043        Cp      STRB     r3,[r0,#1]
        0x00002830:    4770        pG      BX       lr
        0x00002832:    0000        ..      MOVS     r0,r0
    i.foc_pos_set
    foc_pos_set
        0x00002834:    4901        .I      LDR      r1,[pc,#4] ; [0x283c] = 0x20000ea0
        0x00002836:    6748        Hg      STR      r0,[r1,#0x74]
        0x00002838:    4770        pG      BX       lr
    $d
        0x0000283a:    0000        ..      DCW    0
        0x0000283c:    20000ea0    ...     DCD    536874656
    $t
    i.foc_set_ctrl_mode
    foc_set_ctrl_mode
        0x00002840:    4901        .I      LDR      r1,[pc,#4] ; [0x2848] = 0x20000ea0
        0x00002842:    7008        .p      STRB     r0,[r1,#0]
        0x00002844:    4770        pG      BX       lr
    $d
        0x00002846:    0000        ..      DCW    0
        0x00002848:    20000ea0    ...     DCD    536874656
    $t
    i.fputc
    fputc
        0x0000284c:    b570        p.      PUSH     {r4-r6,lr}
        0x0000284e:    4604        .F      MOV      r4,r0
        0x00002850:    4d05        .M      LDR      r5,[pc,#20] ; [0x2868] = 0x40042000
