747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
        0x00002852:    4628        (F      MOV      r0,r5
        0x00002854:    f7fefec0    ....    BL       UART_IsTXFIFOFull ; 0x15d8
        0x00002858:    2800        .(      CMP      r0,#0
        0x0000285a:    d1fa        ..      BNE      0x2852 ; fputc + 6
        0x0000285c:    b2e1        ..      UXTB     r1,r4
        0x0000285e:    4628        (F      MOV      r0,r5
        0x00002860:    f7fefec4    ....    BL       UART_WriteByte ; 0x15ec
        0x00002864:    4620         F      MOV      r0,r4
        0x00002866:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x00002868:    40042000    . .@    DCD    1074012160
    $t
    i.main
    main
        0x0000286c:    2400        .$      MOVS     r4,#0
        0x0000286e:    b672        r.      CPSID    i
        0x00002870:    f7fefdb0    ....    BL       SystemInit ; 0x13d4
        0x00002874:    f7fefb06    ....    BL       Init_BOD ; 0xe84
        0x00002878:    490c        .I      LDR      r1,[pc,#48] ; [0x28ac] = 0x186a0
        0x0000287a:    bf00        ..      NOP      
        0x0000287c:    bf00        ..      NOP      
        0x0000287e:    bf00        ..      NOP      
        0x00002880:    1c64        d.      ADDS     r4,r4,#1
        0x00002882:    428c        .B      CMP      r4,r1
        0x00002884:    d3f9        ..      BCC      0x287a ; main + 14
        0x00002886:    2000        .       MOVS     r0,#0
        0x00002888:    bf00        ..      NOP      
        0x0000288a:    bf00        ..      NOP      
        0x0000288c:    bf00        ..      NOP      
        0x0000288e:    1c40        @.      ADDS     r0,r0,#1
        0x00002890:    4288        .B      CMP      r0,r1
        0x00002892:    d3f9        ..      BCC      0x2888 ; main + 28
        0x00002894:    f7fefa70    ..p.    BL       HardwareInit ; 0xd78
        0x00002898:    f7fefd44    ..D.    BL       SoftwareInit ; 0x1324
        0x0000289c:    b662        b.      CPSIE    i
        0x0000289e:    f7fffbe3    ....    BL       anti_cogging_compesation_read ; 0x2068
        0x000028a2:    a003        ..      ADR      r0,{pc}+0xe ; 0x28b0
        0x000028a4:    f7fefea4    ....    BL       __0printf ; 0x15f0
        0x000028a8:    e7fe        ..      B        0x28a8 ; main + 60
    $d
        0x000028aa:    0000        ..      DCW    0
        0x000028ac:    000186a0    ....    DCD    100000
        0x000028b0:    72617473    star    DCD    1918989427
        0x000028b4:    00000a74    t...    DCD    2676
    $t
    i.pll
    pll
        0x000028b8:    b5ff        ..      PUSH     {r0-r7,lr}
        0x000028ba:    b081        ..      SUB      sp,sp,#4
        0x000028bc:    9d0b        ..      LDR      r5,[sp,#0x2c]
        0x000028be:    9c0a        ..      LDR      r4,[sp,#0x28]
        0x000028c0:    4696        .F      MOV      lr,r2
        0x000028c2:    461e        .F      MOV      r6,r3
        0x000028c4:    493d        =I      LDR      r1,[pc,#244] ; [0x29bc] = 0x6487
        0x000028c6:    6820         h      LDR      r0,[r4,#0]
        0x000028c8:    4288        .B      CMP      r0,r1
        0x000028ca:    da03        ..      BGE      0x28d4 ; pll + 28
        0x000028cc:    b281        ..      UXTH     r1,r0
        0x000028ce:    2301        .#      MOVS     r3,#1
        0x000028d0:    2701        .'      MOVS     r7,#1
        0x000028d2:    e016        ..      B        0x2902 ; pll + 74
        0x000028d4:    493a        :I      LDR      r1,[pc,#232] ; [0x29c0] = 0xc90f
        0x000028d6:    2700        .'      MOVS     r7,#0
        0x000028d8:    43ff        .C      MVNS     r7,r7
        0x000028da:    4288        .B      CMP      r0,r1
        0x000028dc:    da03        ..      BGE      0x28e6 ; pll + 46
        0x000028de:    1a08        ..      SUBS     r0,r1,r0
        0x000028e0:    b281        ..      UXTH     r1,r0
        0x000028e2:    2301        .#      MOVS     r3,#1
        0x000028e4:    e00d        ..      B        0x2902 ; pll + 74
        0x000028e6:    4937        7I      LDR      r1,[pc,#220] ; [0x29c4] = 0x12d97
        0x000028e8:    4288        .B      CMP      r0,r1
        0x000028ea:    da05        ..      BGE      0x28f8 ; pll + 64
        0x000028ec:    4936        6I      LDR      r1,[pc,#216] ; [0x29c8] = 0xffff36f1
        0x000028ee:    1840        @.      ADDS     r0,r0,r1
        0x000028f0:    b281        ..      UXTH     r1,r0
        0x000028f2:    463b        ;F      MOV      r3,r7
        0x000028f4:    461f        .F      MOV      r7,r3
        0x000028f6:    e004        ..      B        0x2902 ; pll + 74
        0x000028f8:    4934        4I      LDR      r1,[pc,#208] ; [0x29cc] = 0x1921f
        0x000028fa:    1a08        ..      SUBS     r0,r1,r0
        0x000028fc:    b281        ..      UXTH     r1,r0
        0x000028fe:    463b        ;F      MOV      r3,r7
        0x00002900:    2701        .'      MOVS     r7,#1
        0x00002902:    4a33        3J      LDR      r2,[pc,#204] ; [0x29d0] = 0x40003000
        0x00002904:    6051        Q`      STR      r1,[r2,#4]
        0x00002906:    2009        .       MOVS     r0,#9
        0x00002908:    6010        .`      STR      r0,[r2,#0]
        0x0000290a:    6890        .h      LDR      r0,[r2,#8]
        0x0000290c:    03c0        ..      LSLS     r0,r0,#15
        0x0000290e:    0fc0        ..      LSRS     r0,r0,#31
        0x00002910:    2800        .(      CMP      r0,#0
        0x00002912:    d0fa        ..      BEQ      0x290a ; pll + 82
        0x00002914:    6890        .h      LDR      r0,[r2,#8]
        0x00002916:    b200        ..      SXTH     r0,r0
        0x00002918:    6051        Q`      STR      r1,[r2,#4]
        0x0000291a:    2109        .!      MOVS     r1,#9
        0x0000291c:    6011        .`      STR      r1,[r2,#0]
        0x0000291e:    68d1        .h      LDR      r1,[r2,#0xc]
        0x00002920:    03c9        ..      LSLS     r1,r1,#15
        0x00002922:    0fc9        ..      LSRS     r1,r1,#31
        0x00002924:    2900        .)      CMP      r1,#0
        0x00002926:    d0fa        ..      BEQ      0x291e ; pll + 102
        0x00002928:    68d1        .h      LDR      r1,[r2,#0xc]
        0x0000292a:    b209        ..      SXTH     r1,r1
        0x0000292c:    2b00        .+      CMP      r3,#0
        0x0000292e:    dd01        ..      BLE      0x2934 ; pll + 124
        0x00002930:    0049        I.      LSLS     r1,r1,#1
        0x00002932:    e001        ..      B        0x2938 ; pll + 128
        0x00002934:    0049        I.      LSLS     r1,r1,#1
        0x00002936:    4249        IB      RSBS     r1,r1,#0
        0x00002938:    b209        ..      SXTH     r1,r1
        0x0000293a:    2f00        ./      CMP      r7,#0
        0x0000293c:    dd01        ..      BLE      0x2942 ; pll + 138
        0x0000293e:    0040        @.      LSLS     r0,r0,#1
        0x00002940:    e001        ..      B        0x2946 ; pll + 142
        0x00002942:    0040        @.      LSLS     r0,r0,#1
        0x00002944:    4240        @B      RSBS     r0,r0,#0
        0x00002946:    b200        ..      SXTH     r0,r0
        0x00002948:    4a22        "J      LDR      r2,[pc,#136] ; [0x29d4] = 0x20001178
        0x0000294a:    8011        ..      STRH     r1,[r2,#0]
        0x0000294c:    9a01        ..      LDR      r2,[sp,#4]
        0x0000294e:    4342        BC      MULS     r2,r0,r2
        0x00002950:    9802        ..      LDR      r0,[sp,#8]
        0x00002952:    4348        HC      MULS     r0,r1,r0
        0x00002954:    1a10        ..      SUBS     r0,r2,r0
        0x00002956:    13c0        ..      ASRS     r0,r0,#15
        0x00002958:    4671        qF      MOV      r1,lr
        0x0000295a:    7809        .x      LDRB     r1,[r1,#0]
        0x0000295c:    2900        .)      CMP      r1,#0
        0x0000295e:    d006        ..      BEQ      0x296e ; pll + 182
        0x00002960:    b201        ..      SXTH     r1,r0
        0x00002962:    4670        pF      MOV      r0,lr
        0x00002964:    f7fdff56    ..V.    BL       $Ven$TT$L$$pi_controller ; 0x814
        0x00002968:    4130        0A      ASRS     r0,r0,r6
        0x0000296a:    6028        (`      STR      r0,[r5,#0]
        0x0000296c:    e007        ..      B        0x297e ; pll + 198
        0x0000296e:    b201        ..      SXTH     r1,r0
        0x00002970:    4670        pF      MOV      r0,lr
        0x00002972:    f7fdff4f    ..O.    BL       $Ven$TT$L$$pi_controller ; 0x814
        0x00002976:    6829        )h      LDR      r1,[r5,#0]
        0x00002978:    4130        0A      ASRS     r0,r0,r6
        0x0000297a:    1840        @.      ADDS     r0,r0,r1
        0x0000297c:    6028        (`      STR      r0,[r5,#0]
        0x0000297e:    6820         h      LDR      r0,[r4,#0]
        0x00002980:    6829        )h      LDR      r1,[r5,#0]
        0x00002982:    1840        @.      ADDS     r0,r0,r1
        0x00002984:    6020         `      STR      r0,[r4,#0]
        0x00002986:    4a11        .J      LDR      r2,[pc,#68] ; [0x29cc] = 0x1921f
        0x00002988:    4913        .I      LDR      r1,[pc,#76] ; [0x29d8] = 0x40003800
        0x0000298a:    6108        .a      STR      r0,[r1,#0x10]
        0x0000298c:    614a        Ja      STR      r2,[r1,#0x14]
        0x0000298e:    2001        .       MOVS     r0,#1
        0x00002990:    6008        .`      STR      r0,[r1,#0]
        0x00002992:    6848        Hh      LDR      r0,[r1,#4]
        0x00002994:    0780        ..      LSLS     r0,r0,#30
        0x00002996:    0fc0        ..      LSRS     r0,r0,#31
        0x00002998:    2800        .(      CMP      r0,#0
        0x0000299a:    d1fa        ..      BNE      0x2992 ; pll + 218
        0x0000299c:    6988        .i      LDR      r0,[r1,#0x18]
        0x0000299e:    6988        .i      LDR      r0,[r1,#0x18]
        0x000029a0:    69c8        .i      LDR      r0,[r1,#0x1c]
        0x000029a2:    0040        @.      LSLS     r0,r0,#1
        0x000029a4:    0840        @.      LSRS     r0,r0,#1
        0x000029a6:    69c9        .i      LDR      r1,[r1,#0x1c]
        0x000029a8:    2900        .)      CMP      r1,#0
        0x000029aa:    da00        ..      BGE      0x29ae ; pll + 246
        0x000029ac:    4240        @B      RSBS     r0,r0,#0
        0x000029ae:    6020         `      STR      r0,[r4,#0]
        0x000029b0:    2800        .(      CMP      r0,#0
        0x000029b2:    da01        ..      BGE      0x29b8 ; pll + 256
        0x000029b4:    1880        ..      ADDS     r0,r0,r2
        0x000029b6:    6020         `      STR      r0,[r4,#0]
        0x000029b8:    b005        ..      ADD      sp,sp,#0x14
        0x000029ba:    bdf0        ..      POP      {r4-r7,pc}
    $d
        0x000029bc:    00006487    .d..    DCD    25735
        0x000029c0:    0000c90f    ....    DCD    51471
        0x000029c4:    00012d97    .-..    DCD    77207
        0x000029c8:    ffff36f1    .6..    DCD    4294915825
        0x000029cc:    0001921f    ....    DCD    102943
        0x000029d0:    40003000    .0.@    DCD    1073754112
        0x000029d4:    20001178    x..     DCD    536875384
        0x000029d8:    40003800    .8.@    DCD    1073756160
    $t
    i.switchTo12MHz
    switchTo12MHz
        0x000029dc:    4903        .I      LDR      r1,[pc,#12] ; [0x29ec] = 0x400aa000
        0x000029de:    2001        .       MOVS     r0,#1
        0x000029e0:    6008        .`      STR      r0,[r1,#0]
        0x000029e2:    0781        ..      LSLS     r1,r0,#30
        0x000029e4:    680a        .h      LDR      r2,[r1,#0]
        0x000029e6:    4302        .C      ORRS     r2,r2,r0
        0x000029e8:    600a        .`      STR      r2,[r1,#0]
        0x000029ea:    4770        pG      BX       lr
    $d
        0x000029ec:    400aa000    ...@    DCD    1074438144
    $t
    i.switchToPLL
    switchToPLL
        0x000029f0:    b510        ..      PUSH     {r4,lr}
        0x000029f2:    4604        .F      MOV      r4,r0
        0x000029f4:    f7fffff2    ....    BL       switchTo12MHz ; 0x29dc
        0x000029f8:    f7fefb4a    ..J.    BL       PLLInit ; 0x1090
        0x000029fc:    2001        .       MOVS     r0,#1
        0x000029fe:    0781        ..      LSLS     r1,r0,#30
        0x00002a00:    6048        H`      STR      r0,[r1,#4]
        0x00002a02:    6808        .h      LDR      r0,[r1,#0]
        0x00002a04:    221c        ."      MOVS     r2,#0x1c
        0x00002a06:    4390        .C      BICS     r0,r0,r2
        0x00002a08:    6008        .`      STR      r0,[r1,#0]
        0x00002a0a:    6808        .h      LDR      r0,[r1,#0]
        0x00002a0c:    2204        ."      MOVS     r2,#4
        0x00002a0e:    4310        .C      ORRS     r0,r0,r2
        0x00002a10:    6008        .`      STR      r0,[r1,#0]
        0x00002a12:    2202        ."      MOVS     r2,#2
        0x00002a14:    2c00        .,      CMP      r4,#0
        0x00002a16:    d003        ..      BEQ      0x2a20 ; switchToPLL + 48
        0x00002a18:    6808        .h      LDR      r0,[r1,#0]
        0x00002a1a:    4310        .C      ORRS     r0,r0,r2
        0x00002a1c:    6008        .`      STR      r0,[r1,#0]
        0x00002a1e:    e002        ..      B        0x2a26 ; switchToPLL + 54
        0x00002a20:    6808        .h      LDR      r0,[r1,#0]
        0x00002a22:    4390        .C      BICS     r0,r0,r2
        0x00002a24:    6008        .`      STR      r0,[r1,#0]
        0x00002a26:    6808        .h      LDR      r0,[r1,#0]
        0x00002a28:    0840        @.      LSRS     r0,r0,#1
        0x00002a2a:    0040        @.      LSLS     r0,r0,#1
        0x00002a2c:    6008        .`      STR      r0,[r1,#0]
        0x00002a2e:    bd10        ..      POP      {r4,pc}
    i.user_1ms_task
    user_1ms_task
        0x00002a30:    b510        ..      PUSH     {r4,lr}
        0x00002a32:    f7fffa61    ..a.    BL       anti_cogging_calibration_roud ; 0x1ef8
        0x00002a36:    bd10        ..      POP      {r4,pc}
    $d.realdata
    Region$$Table$$Base
        0x00002a38:    00002a68    h*..    DCD    10856
        0x00002a3c:    20000000    ...     DCD    536870912
        0x00002a40:    00000e58    X...    DCD    3672
        0x00002a44:    0000163e    >...    DCD    5694
        0x00002a48:    000038c0    .8..    DCD    14528
        0x00002a4c:    20000e58    X..     DCD    536874584
        0x00002a50:    00000324    $...    DCD    804
        0x00002a54:    000007b0    ....    DCD    1968
        0x00002a58:    00003968    h9..    DCD    14696
        0x00002a5c:    2000117c    |..     DCD    536875388
        0x00002a60:    00000be4    ....    DCD    3044
        0x00002a64:    0000164e    N...    DCD    5710
    Region$$Table$$Limit

** Section #2 'RW_IRAM1' (SHT_PROGBITS) [SHF_ALLOC + SHF_EXECINSTR]
    Size   : 3672 bytes (alignment 4)
    Address: 0x20000000

