747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
    $t
    PlaceInRAM
    PWM0_Handler
        0x20000000:    b510        ..      PUSH     {r4,lr}
        0x20000002:    f000fa29    ..).    BL       foc_loop_isr ; 0x20000458
        0x20000006:    4904        .I      LDR      r1,[pc,#16] ; [0x20000018] = 0x40046040
        0x20000008:    2001        .       MOVS     r0,#1
        0x2000000a:    6348        Hc      STR      r0,[r1,#0x34]
        0x2000000c:    bd10        ..      POP      {r4,pc}
    ADC0_Handler
        0x2000000e:    2000        .       MOVS     r0,#0
        0x20000010:    4902        .I      LDR      r1,[pc,#8] ; [0x2000001c] = 0x40049000
        0x20000012:    43c0        .C      MVNS     r0,r0
        0x20000014:    60c8        .`      STR      r0,[r1,#0xc]
        0x20000016:    4770        pG      BX       lr
    $d
        0x20000018:    40046040    @`.@    DCD    1074028608
        0x2000001c:    40049000    ...@    DCD    1074040832
    $t
    PlaceInRAM
    foc_svm_gen
        0x20000020:    b5f0        ..      PUSH     {r4-r7,lr}
        0x20000022:    b085        ..      SUB      sp,sp,#0x14
        0x20000024:    4afe        .J      LDR      r2,[pc,#1016] ; [0x20000420] = 0xffffb61a
        0x20000026:    4cff        .L      LDR      r4,[pc,#1020] ; [0x20000424] = 0x49e6
        0x20000028:    460d        .F      MOV      r5,r1
        0x2000002a:    460e        .F      MOV      r6,r1
        0x2000002c:    4355        UC      MULS     r5,r2,r5
        0x2000002e:    4366        fC      MULS     r6,r4,r6
        0x20000030:    2201        ."      MOVS     r2,#1
        0x20000032:    03c3        ..      LSLS     r3,r0,#15
        0x20000034:    4cfc        .L      LDR      r4,[pc,#1008] ; [0x20000428] = 0x20000ee0
        0x20000036:    2900        .)      CMP      r1,#0
        0x20000038:    db0f        ..      BLT      0x2000005a ; foc_svm_gen + 58
        0x2000003a:    2702        .'      MOVS     r7,#2
        0x2000003c:    2800        .(      CMP      r0,#0
        0x2000003e:    db05        ..      BLT      0x2000004c ; foc_svm_gen + 44
        0x20000040:    429e        .B      CMP      r6,r3
        0x20000042:    db01        ..      BLT      0x20000048 ; foc_svm_gen + 40
        0x20000044:    8167        g.      STRH     r7,[r4,#0xa]
        0x20000046:    e018        ..      B        0x2000007a ; foc_svm_gen + 90
        0x20000048:    8162        b.      STRH     r2,[r4,#0xa]
        0x2000004a:    e016        ..      B        0x2000007a ; foc_svm_gen + 90
        0x2000004c:    429d        .B      CMP      r5,r3
        0x2000004e:    db02        ..      BLT      0x20000056 ; foc_svm_gen + 54
        0x20000050:    2303        .#      MOVS     r3,#3
        0x20000052:    8163        c.      STRH     r3,[r4,#0xa]
        0x20000054:    e011        ..      B        0x2000007a ; foc_svm_gen + 90
        0x20000056:    8167        g.      STRH     r7,[r4,#0xa]
        0x20000058:    e00f        ..      B        0x2000007a ; foc_svm_gen + 90
        0x2000005a:    2705        .'      MOVS     r7,#5
        0x2000005c:    2800        .(      CMP      r0,#0
        0x2000005e:    db06        ..      BLT      0x2000006e ; foc_svm_gen + 78
        0x20000060:    429d        .B      CMP      r5,r3
        0x20000062:    db01        ..      BLT      0x20000068 ; foc_svm_gen + 72
        0x20000064:    8167        g.      STRH     r7,[r4,#0xa]
        0x20000066:    e008        ..      B        0x2000007a ; foc_svm_gen + 90
        0x20000068:    2306        .#      MOVS     r3,#6
        0x2000006a:    8163        c.      STRH     r3,[r4,#0xa]
        0x2000006c:    e005        ..      B        0x2000007a ; foc_svm_gen + 90
        0x2000006e:    429e        .B      CMP      r6,r3
        0x20000070:    db02        ..      BLT      0x20000078 ; foc_svm_gen + 88
        0x20000072:    2304        .#      MOVS     r3,#4
        0x20000074:    8163        c.      STRH     r3,[r4,#0xa]
        0x20000076:    e000        ..      B        0x2000007a ; foc_svm_gen + 90
        0x20000078:    8167        g.      STRH     r7,[r4,#0xa]
        0x2000007a:    03c6        ..      LSLS     r6,r0,#15
        0x2000007c:    4be9        .K      LDR      r3,[pc,#932] ; [0x20000424] = 0x49e6
        0x2000007e:    4608        .F      MOV      r0,r1
        0x20000080:    4358        XC      MULS     r0,r3,r0
        0x20000082:    4686        .F      MOV      lr,r0
        0x20000084:    1a30        0.      SUBS     r0,r6,r0
        0x20000086:    4be9        .K      LDR      r3,[pc,#932] ; [0x2000042c] = 0x7fd
        0x20000088:    12c0        ..      ASRS     r0,r0,#11
        0x2000008a:    4358        XC      MULS     r0,r3,r0
        0x2000008c:    4684        .F      MOV      r12,r0
        0x2000008e:    4be8        .K      LDR      r3,[pc,#928] ; [0x20000430] = 0x93cc
        0x20000090:    4608        .F      MOV      r0,r1
        0x20000092:    4358        XC      MULS     r0,r3,r0
        0x20000094:    12c7        ..      ASRS     r7,r0,#11
        0x20000096:    8965        e.      LDRH     r5,[r4,#0xa]
        0x20000098:    48e4        .H      LDR      r0,[pc,#912] ; [0x2000042c] = 0x7fd
        0x2000009a:    9603        ..      STR      r6,[sp,#0xc]
        0x2000009c:    4347        GC      MULS     r7,r0,r7
        0x2000009e:    9e03        ..      LDR      r6,[sp,#0xc]
        0x200000a0:    4670        pF      MOV      r0,lr
        0x200000a2:    1833        3.      ADDS     r3,r6,r0
        0x200000a4:    12d8        ..      ASRS     r0,r3,#11
        0x200000a6:    4ee1        .N      LDR      r6,[pc,#900] ; [0x2000042c] = 0x7fd
        0x200000a8:    425b        [B      RSBS     r3,r3,#0
        0x200000aa:    4370        pC      MULS     r0,r6,r0
        0x200000ac:    9004        ..      STR      r0,[sp,#0x10]
        0x200000ae:    9e03        ..      LDR      r6,[sp,#0xc]
        0x200000b0:    4670        pF      MOV      r0,lr
        0x200000b2:    1b80        ..      SUBS     r0,r0,r6
        0x200000b4:    4edd        .N      LDR      r6,[pc,#884] ; [0x2000042c] = 0x7fd
        0x200000b6:    12c0        ..      ASRS     r0,r0,#11
        0x200000b8:    4370        pC      MULS     r0,r6,r0
        0x200000ba:    12de        ..      ASRS     r6,r3,#11
        0x200000bc:    4bdb        .K      LDR      r3,[pc,#876] ; [0x2000042c] = 0x7fd
        0x200000be:    435e        ^C      MULS     r6,r3,r6
        0x200000c0:    4bdc        .K      LDR      r3,[pc,#880] ; [0x20000434] = 0xffff6c34
        0x200000c2:    4359        YC      MULS     r1,r3,r1
        0x200000c4:    4bd9        .K      LDR      r3,[pc,#868] ; [0x2000042c] = 0x7fd
        0x200000c6:    12c9        ..      ASRS     r1,r1,#11
        0x200000c8:    4359        YC      MULS     r1,r3,r1
        0x200000ca:    2d07        .-      CMP      r5,#7
        0x200000cc:    d275        u.      BCS      0x200001ba ; foc_svm_gen + 410
        0x200000ce:    002b        +.      MOVS     r3,r5
        0x200000d0:    447b        {D      ADD      r3,r3,pc
        0x200000d2:    791b        .y      LDRB     r3,[r3,#4]
        0x200000d4:    18db        ..      ADDS     r3,r3,r3
        0x200000d6:    449f        .D      ADD      pc,pc,r3
    $d
        0x200000d8:    71390370    p.9q    DCD    1899561840
        0x200000dc:    00fddfa8    ....    DCD    16637864
    $t
        0x200000e0:    4660        `F      MOV      r0,r12
        0x200000e2:    14c0        ..      ASRS     r0,r0,#19
        0x200000e4:    14fd        ..      ASRS     r5,r7,#19
        0x200000e6:    1946        F.      ADDS     r6,r0,r5
        0x200000e8:    49d0        .I      LDR      r1,[pc,#832] ; [0x2000042c] = 0x7fd
        0x200000ea:    428e        .B      CMP      r6,r1
        0x200000ec:    d923        #.      BLS      0x20000136 ; foc_svm_gen + 278
        0x200000ee:    4348        HC      MULS     r0,r1,r0
        0x200000f0:    4fd1        .O      LDR      r7,[pc,#836] ; [0x20000438] = 0x40003800
        0x200000f2:    6138        8a      STR      r0,[r7,#0x10]
        0x200000f4:    617e        ~a      STR      r6,[r7,#0x14]
        0x200000f6:    2001        .       MOVS     r0,#1
        0x200000f8:    6038        8`      STR      r0,[r7,#0]
        0x200000fa:    6878        xh      LDR      r0,[r7,#4]
        0x200000fc:    0780        ..      LSLS     r0,r0,#30
        0x200000fe:    0fc0        ..      LSRS     r0,r0,#31
        0x20000100:    2800        .(      CMP      r0,#0
        0x20000102:    d1fa        ..      BNE      0x200000fa ; foc_svm_gen + 218
        0x20000104:    a901        ..      ADD      r1,sp,#4
        0x20000106:    a802        ..      ADD      r0,sp,#8
        0x20000108:    f000fe8e    ....    BL       $Ven$TT$L$$DIV_SDiv_Result ; 0x20000e28
        0x2000010c:    49c7        .I      LDR      r1,[pc,#796] ; [0x2000042c] = 0x7fd
        0x2000010e:    4628        (F      MOV      r0,r5
        0x20000110:    4348        HC      MULS     r0,r1,r0
        0x20000112:    6138        8a      STR      r0,[r7,#0x10]
        0x20000114:    617e        ~a      STR      r6,[r7,#0x14]
        0x20000116:    2001        .       MOVS     r0,#1
        0x20000118:    6038        8`      STR      r0,[r7,#0]
        0x2000011a:    6878        xh      LDR      r0,[r7,#4]
        0x2000011c:    0780        ..      LSLS     r0,r0,#30
        0x2000011e:    0fc0        ..      LSRS     r0,r0,#31
        0x20000120:    2800        .(      CMP      r0,#0
        0x20000122:    d1fa        ..      BNE      0x2000011a ; foc_svm_gen + 250
        0x20000124:    a901        ..      ADD      r1,sp,#4
        0x20000126:    a802        ..      ADD      r0,sp,#8
        0x20000128:    f000fe7e    ..~.    BL       $Ven$TT$L$$DIV_SDiv_Result ; 0x20000e28
        0x2000012c:    9802        ..      LDR      r0,[sp,#8]
        0x2000012e:    49c3        .I      LDR      r1,[pc,#780] ; [0x2000043c] = 0x20000ea0
        0x20000130:    6f0a        .o      LDR      r2,[r1,#0x70]
        0x20000132:    1c52        R.      ADDS     r2,r2,#1
        0x20000134:    670a        .g      STR      r2,[r1,#0x70]
        0x20000136:    49bd        .I      LDR      r1,[pc,#756] ; [0x2000042c] = 0x7fd
        0x20000138:    1942        B.      ADDS     r2,r0,r5
        0x2000013a:    1851        Q.      ADDS     r1,r2,r1
        0x2000013c:    03c9        ..      LSLS     r1,r1,#15
        0x2000013e:    0c09        ..      LSRS     r1,r1,#16
        0x20000140:    81a1        ..      STRH     r1,[r4,#0xc]
        0x20000142:    1a08        ..      SUBS     r0,r1,r0
        0x20000144:    81e0        ..      STRH     r0,[r4,#0xe]
        0x20000146:    1b40        @.      SUBS     r0,r0,r5
        0x20000148:    8220         .      STRH     r0,[r4,#0x10]
        0x2000014a:    e116        ..      B        0x2000037a ; foc_svm_gen + 858
        0x2000014c:    9904        ..      LDR      r1,[sp,#0x10]
        0x2000014e:    14cd        ..      ASRS     r5,r1,#19
        0x20000150:    14c6        ..      ASRS     r6,r0,#19
        0x20000152:    19af        ..      ADDS     r7,r5,r6
        0x20000154:    48b5        .H      LDR      r0,[pc,#724] ; [0x2000042c] = 0x7fd
        0x20000156:    4287        .B      CMP      r7,r0
        0x20000158:    d925        %.      BLS      0x200001a6 ; foc_svm_gen + 390
        0x2000015a:    4345        EC      MULS     r5,r0,r5
        0x2000015c:    48b6        .H      LDR      r0,[pc,#728] ; [0x20000438] = 0x40003800
        0x2000015e:    6105        .a      STR      r5,[r0,#0x10]
        0x20000160:    6147        Ga      STR      r7,[r0,#0x14]
        0x20000162:    2101        .!      MOVS     r1,#1
        0x20000164:    6001        .`      STR      r1,[r0,#0]
        0x20000166:    48b4        .H      LDR      r0,[pc,#720] ; [0x20000438] = 0x40003800
        0x20000168:    6840        @h      LDR      r0,[r0,#4]
        0x2000016a:    0780        ..      LSLS     r0,r0,#30
        0x2000016c:    0fc0        ..      LSRS     r0,r0,#31
        0x2000016e:    2800        .(      CMP      r0,#0
        0x20000170:    d1f9        ..      BNE      0x20000166 ; foc_svm_gen + 326
        0x20000172:    a901        ..      ADD      r1,sp,#4
        0x20000174:    a802        ..      ADD      r0,sp,#8
        0x20000176:    f000fe57    ..W.    BL       $Ven$TT$L$$DIV_SDiv_Result ; 0x20000e28
        0x2000017a:    9d02        ..      LDR      r5,[sp,#8]
        0x2000017c:    48ab        .H      LDR      r0,[pc,#684] ; [0x2000042c] = 0x7fd
        0x2000017e:    4346        FC      MULS     r6,r0,r6
        0x20000180:    48ad        .H      LDR      r0,[pc,#692] ; [0x20000438] = 0x40003800
        0x20000182:    6106        .a      STR      r6,[r0,#0x10]
        0x20000184:    6147        Ga      STR      r7,[r0,#0x14]
        0x20000186:    2101        .!      MOVS     r1,#1
        0x20000188:    6001        .`      STR      r1,[r0,#0]
        0x2000018a:    6841        Ah      LDR      r1,[r0,#4]
        0x2000018c:    0789        ..      LSLS     r1,r1,#30
        0x2000018e:    0fc9        ..      LSRS     r1,r1,#31
        0x20000190:    2900        .)      CMP      r1,#0
        0x20000192:    d1fa        ..      BNE      0x2000018a ; foc_svm_gen + 362
        0x20000194:    a901        ..      ADD      r1,sp,#4
        0x20000196:    a802        ..      ADD      r0,sp,#8
        0x20000198:    f000fe46    ..F.    BL       $Ven$TT$L$$DIV_SDiv_Result ; 0x20000e28
        0x2000019c:    9e02        ..      LDR      r6,[sp,#8]
        0x2000019e:    48a7        .H      LDR      r0,[pc,#668] ; [0x2000043c] = 0x20000ea0
        0x200001a0:    6f01        .o      LDR      r1,[r0,#0x70]
        0x200001a2:    1c49        I.      ADDS     r1,r1,#1
        0x200001a4:    6701        .g      STR      r1,[r0,#0x70]
        0x200001a6:    48a1        .H      LDR      r0,[pc,#644] ; [0x2000042c] = 0x7fd
        0x200001a8:    19a9        ..      ADDS     r1,r5,r6
        0x200001aa:    1808        ..      ADDS     r0,r1,r0
        0x200001ac:    03c0        ..      LSLS     r0,r0,#15
        0x200001ae:    0c00        ..      LSRS     r0,r0,#16
        0x200001b0:    81e0        ..      STRH     r0,[r4,#0xe]
        0x200001b2:    1b80        ..      SUBS     r0,r0,r6
        0x200001b4:    81a0        ..      STRH     r0,[r4,#0xc]
        0x200001b6:    1b40        @.      SUBS     r0,r0,r5
        0x200001b8:    8220         .      STRH     r0,[r4,#0x10]
        0x200001ba:    e0de        ..      B        0x2000037a ; foc_svm_gen + 858
        0x200001bc:    14fd        ..      ASRS     r5,r7,#19
        0x200001be:    14f6        ..      ASRS     r6,r6,#19
        0x200001c0:    19af        ..      ADDS     r7,r5,r6
        0x200001c2:    489a        .H      LDR      r0,[pc,#616] ; [0x2000042c] = 0x7fd
        0x200001c4:    4287        .B      CMP      r7,r0
        0x200001c6:    d925        %.      BLS      0x20000214 ; foc_svm_gen + 500
        0x200001c8:    4345        EC      MULS     r5,r0,r5
        0x200001ca:    489b        .H      LDR      r0,[pc,#620] ; [0x20000438] = 0x40003800
        0x200001cc:    6105        .a      STR      r5,[r0,#0x10]
        0x200001ce:    6147        Ga      STR      r7,[r0,#0x14]
        0x200001d0:    2101        .!      MOVS     r1,#1
        0x200001d2:    6001        .`      STR      r1,[r0,#0]
        0x200001d4:    4898        .H      LDR      r0,[pc,#608] ; [0x20000438] = 0x40003800
        0x200001d6:    6840        @h      LDR      r0,[r0,#4]
        0x200001d8:    0780        ..      LSLS     r0,r0,#30
        0x200001da:    0fc0        ..      LSRS     r0,r0,#31
        0x200001dc:    2800        .(      CMP      r0,#0
        0x200001de:    d1f9        ..      BNE      0x200001d4 ; foc_svm_gen + 436
        0x200001e0:    a901        ..      ADD      r1,sp,#4
        0x200001e2:    a802        ..      ADD      r0,sp,#8
        0x200001e4:    f000fe20    .. .    BL       $Ven$TT$L$$DIV_SDiv_Result ; 0x20000e28
        0x200001e8:    9d02        ..      LDR      r5,[sp,#8]
        0x200001ea:    4890        .H      LDR      r0,[pc,#576] ; [0x2000042c] = 0x7fd
        0x200001ec:    4346        FC      MULS     r6,r0,r6
        0x200001ee:    4892        .H      LDR      r0,[pc,#584] ; [0x20000438] = 0x40003800
        0x200001f0:    6106        .a      STR      r6,[r0,#0x10]
        0x200001f2:    6147        Ga      STR      r7,[r0,#0x14]
        0x200001f4:    2101        .!      MOVS     r1,#1
        0x200001f6:    6001        .`      STR      r1,[r0,#0]
        0x200001f8:    6841        Ah      LDR      r1,[r0,#4]
        0x200001fa:    0789        ..      LSLS     r1,r1,#30
        0x200001fc:    0fc9        ..      LSRS     r1,r1,#31
        0x200001fe:    2900        .)      CMP      r1,#0
        0x20000200:    d1fa        ..      BNE      0x200001f8 ; foc_svm_gen + 472
        0x20000202:    a901        ..      ADD      r1,sp,#4
        0x20000204:    a802        ..      ADD      r0,sp,#8
        0x20000206:    f000fe0f    ....    BL       $Ven$TT$L$$DIV_SDiv_Result ; 0x20000e28
        0x2000020a:    9e02        ..      LDR      r6,[sp,#8]
        0x2000020c:    488b        .H      LDR      r0,[pc,#556] ; [0x2000043c] = 0x20000ea0
        0x2000020e:    6f01        .o      LDR      r1,[r0,#0x70]
        0x20000210:    1c49        I.      ADDS     r1,r1,#1
        0x20000212:    6701        .g      STR      r1,[r0,#0x70]
        0x20000214:    4885        .H      LDR      r0,[pc,#532] ; [0x2000042c] = 0x7fd
        0x20000216:    19a9        ..      ADDS     r1,r5,r6
        0x20000218:    1808        ..      ADDS     r0,r1,r0
        0x2000021a:    03c0        ..      LSLS     r0,r0,#15
        0x2000021c:    0c00        ..      LSRS     r0,r0,#16
        0x2000021e:    81e0        ..      STRH     r0,[r4,#0xe]
        0x20000220:    1b40        @.      SUBS     r0,r0,r5
        0x20000222:    8220         .      STRH     r0,[r4,#0x10]
        0x20000224:    1b80        ..      SUBS     r0,r0,r6
        0x20000226:    81a0        ..      STRH     r0,[r4,#0xc]
        0x20000228:    e0a7        ..      B        0x2000037a ; foc_svm_gen + 858
        0x2000022a:    14c5        ..      ASRS     r5,r0,#19
        0x2000022c:    14ce        ..      ASRS     r6,r1,#19
        0x2000022e:    19af        ..      ADDS     r7,r5,r6
        0x20000230:    487e        ~H      LDR      r0,[pc,#504] ; [0x2000042c] = 0x7fd
        0x20000232:    4287        .B      CMP      r7,r0
        0x20000234:    d925        %.      BLS      0x20000282 ; foc_svm_gen + 610
        0x20000236:    4345        EC      MULS     r5,r0,r5
        0x20000238:    487f        .H      LDR      r0,[pc,#508] ; [0x20000438] = 0x40003800
        0x2000023a:    6105        .a      STR      r5,[r0,#0x10]
        0x2000023c:    6147        Ga      STR      r7,[r0,#0x14]
        0x2000023e:    2101        .!      MOVS     r1,#1
        0x20000240:    6001        .`      STR      r1,[r0,#0]
        0x20000242:    487d        }H      LDR      r0,[pc,#500] ; [0x20000438] = 0x40003800
        0x20000244:    6840        @h      LDR      r0,[r0,#4]
        0x20000246:    0780        ..      LSLS     r0,r0,#30
        0x20000248:    0fc0        ..      LSRS     r0,r0,#31
        0x2000024a:    2800        .(      CMP      r0,#0
        0x2000024c:    d1f9        ..      BNE      0x20000242 ; foc_svm_gen + 546
        0x2000024e:    a901        ..      ADD      r1,sp,#4
        0x20000250:    a802        ..      ADD      r0,sp,#8
        0x20000252:    f000fde9    ....    BL       $Ven$TT$L$$DIV_SDiv_Result ; 0x20000e28
        0x20000256:    9d02        ..      LDR      r5,[sp,#8]
        0x20000258:    4874        tH      LDR      r0,[pc,#464] ; [0x2000042c] = 0x7fd
        0x2000025a:    4346        FC      MULS     r6,r0,r6
        0x2000025c:    4876        vH      LDR      r0,[pc,#472] ; [0x20000438] = 0x40003800
        0x2000025e:    6106        .a      STR      r6,[r0,#0x10]
        0x20000260:    6147        Ga      STR      r7,[r0,#0x14]
        0x20000262:    2101        .!      MOVS     r1,#1
        0x20000264:    6001        .`      STR      r1,[r0,#0]
        0x20000266:    6841        Ah      LDR      r1,[r0,#4]
        0x20000268:    0789        ..      LSLS     r1,r1,#30
        0x2000026a:    0fc9        ..      LSRS     r1,r1,#31
        0x2000026c:    2900        .)      CMP      r1,#0
        0x2000026e:    d1fa        ..      BNE      0x20000266 ; foc_svm_gen + 582
        0x20000270:    a901        ..      ADD      r1,sp,#4
        0x20000272:    a802        ..      ADD      r0,sp,#8
        0x20000274:    f000fdd8    ....    BL       $Ven$TT$L$$DIV_SDiv_Result ; 0x20000e28
        0x20000278:    9e02        ..      LDR      r6,[sp,#8]
        0x2000027a:    4870        pH      LDR      r0,[pc,#448] ; [0x2000043c] = 0x20000ea0
        0x2000027c:    6f01        .o      LDR      r1,[r0,#0x70]
        0x2000027e:    1c49        I.      ADDS     r1,r1,#1
        0x20000280:    6701        .g      STR      r1,[r0,#0x70]
        0x20000282:    486a        jH      LDR      r0,[pc,#424] ; [0x2000042c] = 0x7fd
        0x20000284:    19a9        ..      ADDS     r1,r5,r6
        0x20000286:    1808        ..      ADDS     r0,r1,r0
        0x20000288:    03c0        ..      LSLS     r0,r0,#15
        0x2000028a:    0c00        ..      LSRS     r0,r0,#16
        0x2000028c:    8220         .      STRH     r0,[r4,#0x10]
        0x2000028e:    1b80        ..      SUBS     r0,r0,r6
        0x20000290:    81e0        ..      STRH     r0,[r4,#0xe]
        0x20000292:    1b40        @.      SUBS     r0,r0,r5
        0x20000294:    81a0        ..      STRH     r0,[r4,#0xc]
        0x20000296:    e070        p.      B        0x2000037a ; foc_svm_gen + 858
        0x20000298:    14f5        ..      ASRS     r5,r6,#19
        0x2000029a:    4660        `F      MOV      r0,r12
        0x2000029c:    14c6        ..      ASRS     r6,r0,#19
        0x2000029e:    19af        ..      ADDS     r7,r5,r6
        0x200002a0:    4862        bH      LDR      r0,[pc,#392] ; [0x2000042c] = 0x7fd
        0x200002a2:    4287        .B      CMP      r7,r0
        0x200002a4:    d927        '.      BLS      0x200002f6 ; foc_svm_gen + 726
        0x200002a6:    4345        EC      MULS     r5,r0,r5
        0x200002a8:    4863        cH      LDR      r0,[pc,#396] ; [0x20000438] = 0x40003800
        0x200002aa:    6105        .a      STR      r5,[r0,#0x10]
        0x200002ac:    6147        Ga      STR      r7,[r0,#0x14]
        0x200002ae:    2101        .!      MOVS     r1,#1
        0x200002b0:    6001        .`      STR      r1,[r0,#0]
        0x200002b2:    4861        aH      LDR      r0,[pc,#388] ; [0x20000438] = 0x40003800
        0x200002b4:    6840        @h      LDR      r0,[r0,#4]
        0x200002b6:    0780        ..      LSLS     r0,r0,#30
        0x200002b8:    0fc0        ..      LSRS     r0,r0,#31
        0x200002ba:    2800        .(      CMP      r0,#0
        0x200002bc:    d1f9        ..      BNE      0x200002b2 ; foc_svm_gen + 658
        0x200002be:    a901        ..      ADD      r1,sp,#4
        0x200002c0:    a802        ..      ADD      r0,sp,#8
        0x200002c2:    f000fdb1    ....    BL       $Ven$TT$L$$DIV_SDiv_Result ; 0x20000e28
        0x200002c6:    9d02        ..      LDR      r5,[sp,#8]
        0x200002c8:    4858        XH      LDR      r0,[pc,#352] ; [0x2000042c] = 0x7fd
        0x200002ca:    4346        FC      MULS     r6,r0,r6
        0x200002cc:    485a        ZH      LDR      r0,[pc,#360] ; [0x20000438] = 0x40003800
        0x200002ce:    6106        .a      STR      r6,[r0,#0x10]
        0x200002d0:    6147        Ga      STR      r7,[r0,#0x14]
        0x200002d2:    e000        ..      B        0x200002d6 ; foc_svm_gen + 694
        0x200002d4:    e01a        ..      B        0x2000030c ; foc_svm_gen + 748
