747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
        0x200002d6:    2101        .!      MOVS     r1,#1
        0x200002d8:    6001        .`      STR      r1,[r0,#0]
        0x200002da:    6841        Ah      LDR      r1,[r0,#4]
        0x200002dc:    0789        ..      LSLS     r1,r1,#30
        0x200002de:    0fc9        ..      LSRS     r1,r1,#31
        0x200002e0:    2900        .)      CMP      r1,#0
        0x200002e2:    d1fa        ..      BNE      0x200002da ; foc_svm_gen + 698
        0x200002e4:    a901        ..      ADD      r1,sp,#4
        0x200002e6:    a802        ..      ADD      r0,sp,#8
        0x200002e8:    f000fd9e    ....    BL       $Ven$TT$L$$DIV_SDiv_Result ; 0x20000e28
        0x200002ec:    9e02        ..      LDR      r6,[sp,#8]
        0x200002ee:    4953        SI      LDR      r1,[pc,#332] ; [0x2000043c] = 0x20000ea0
        0x200002f0:    6f08        .o      LDR      r0,[r1,#0x70]
        0x200002f2:    1c40        @.      ADDS     r0,r0,#1
        0x200002f4:    6708        .g      STR      r0,[r1,#0x70]
        0x200002f6:    484d        MH      LDR      r0,[pc,#308] ; [0x2000042c] = 0x7fd
        0x200002f8:    19a9        ..      ADDS     r1,r5,r6
        0x200002fa:    1808        ..      ADDS     r0,r1,r0
        0x200002fc:    03c0        ..      LSLS     r0,r0,#15
        0x200002fe:    0c00        ..      LSRS     r0,r0,#16
        0x20000300:    8220         .      STRH     r0,[r4,#0x10]
        0x20000302:    1b40        @.      SUBS     r0,r0,r5
        0x20000304:    81a0        ..      STRH     r0,[r4,#0xc]
        0x20000306:    1b80        ..      SUBS     r0,r0,r6
        0x20000308:    81e0        ..      STRH     r0,[r4,#0xe]
        0x2000030a:    e036        6.      B        0x2000037a ; foc_svm_gen + 858
        0x2000030c:    14cd        ..      ASRS     r5,r1,#19
        0x2000030e:    9804        ..      LDR      r0,[sp,#0x10]
        0x20000310:    14c6        ..      ASRS     r6,r0,#19
        0x20000312:    19af        ..      ADDS     r7,r5,r6
        0x20000314:    4845        EH      LDR      r0,[pc,#276] ; [0x2000042c] = 0x7fd
        0x20000316:    4287        .B      CMP      r7,r0
        0x20000318:    d925        %.      BLS      0x20000366 ; foc_svm_gen + 838
        0x2000031a:    4345        EC      MULS     r5,r0,r5
        0x2000031c:    4846        FH      LDR      r0,[pc,#280] ; [0x20000438] = 0x40003800
        0x2000031e:    6105        .a      STR      r5,[r0,#0x10]
        0x20000320:    6147        Ga      STR      r7,[r0,#0x14]
        0x20000322:    2101        .!      MOVS     r1,#1
        0x20000324:    6001        .`      STR      r1,[r0,#0]
        0x20000326:    4844        DH      LDR      r0,[pc,#272] ; [0x20000438] = 0x40003800
        0x20000328:    6840        @h      LDR      r0,[r0,#4]
        0x2000032a:    0780        ..      LSLS     r0,r0,#30
        0x2000032c:    0fc0        ..      LSRS     r0,r0,#31
        0x2000032e:    2800        .(      CMP      r0,#0
        0x20000330:    d1f9        ..      BNE      0x20000326 ; foc_svm_gen + 774
        0x20000332:    a901        ..      ADD      r1,sp,#4
        0x20000334:    a802        ..      ADD      r0,sp,#8
        0x20000336:    f000fd77    ..w.    BL       $Ven$TT$L$$DIV_SDiv_Result ; 0x20000e28
        0x2000033a:    9d02        ..      LDR      r5,[sp,#8]
        0x2000033c:    483b        ;H      LDR      r0,[pc,#236] ; [0x2000042c] = 0x7fd
        0x2000033e:    4346        FC      MULS     r6,r0,r6
        0x20000340:    483d        =H      LDR      r0,[pc,#244] ; [0x20000438] = 0x40003800
        0x20000342:    6106        .a      STR      r6,[r0,#0x10]
        0x20000344:    6147        Ga      STR      r7,[r0,#0x14]
        0x20000346:    2101        .!      MOVS     r1,#1
        0x20000348:    6001        .`      STR      r1,[r0,#0]
        0x2000034a:    6841        Ah      LDR      r1,[r0,#4]
        0x2000034c:    0789        ..      LSLS     r1,r1,#30
        0x2000034e:    0fc9        ..      LSRS     r1,r1,#31
        0x20000350:    2900        .)      CMP      r1,#0
        0x20000352:    d1fa        ..      BNE      0x2000034a ; foc_svm_gen + 810
        0x20000354:    a901        ..      ADD      r1,sp,#4
        0x20000356:    a802        ..      ADD      r0,sp,#8
        0x20000358:    f000fd66    ..f.    BL       $Ven$TT$L$$DIV_SDiv_Result ; 0x20000e28
        0x2000035c:    9e02        ..      LDR      r6,[sp,#8]
        0x2000035e:    4937        7I      LDR      r1,[pc,#220] ; [0x2000043c] = 0x20000ea0
        0x20000360:    6f08        .o      LDR      r0,[r1,#0x70]
        0x20000362:    1c40        @.      ADDS     r0,r0,#1
        0x20000364:    6708        .g      STR      r0,[r1,#0x70]
        0x20000366:    4831        1H      LDR      r0,[pc,#196] ; [0x2000042c] = 0x7fd
        0x20000368:    19a9        ..      ADDS     r1,r5,r6
        0x2000036a:    1808        ..      ADDS     r0,r1,r0
        0x2000036c:    03c0        ..      LSLS     r0,r0,#15
        0x2000036e:    0c00        ..      LSRS     r0,r0,#16
        0x20000370:    81a0        ..      STRH     r0,[r4,#0xc]
        0x20000372:    1b80        ..      SUBS     r0,r0,r6
        0x20000374:    8220         .      STRH     r0,[r4,#0x10]
        0x20000376:    1b40        @.      SUBS     r0,r0,r5
        0x20000378:    81e0        ..      STRH     r0,[r4,#0xe]
        0x2000037a:    89a0        ..      LDRH     r0,[r4,#0xc]
        0x2000037c:    8260        `.      STRH     r0,[r4,#0x12]
        0x2000037e:    89e0        ..      LDRH     r0,[r4,#0xe]
        0x20000380:    82a0        ..      STRH     r0,[r4,#0x14]
        0x20000382:    8a20         .      LDRH     r0,[r4,#0x10]
        0x20000384:    82e0        ..      STRH     r0,[r4,#0x16]
        0x20000386:    b005        ..      ADD      sp,sp,#0x14
        0x20000388:    bdf0        ..      POP      {r4-r7,pc}
    Udq_2_Uab
        0x2000038a:    b4f0        ..      PUSH     {r4-r7}
        0x2000038c:    4c2b        +L      LDR      r4,[pc,#172] ; [0x2000043c] = 0x20000ea0
        0x2000038e:    2500        .%      MOVS     r5,#0
        0x20000390:    2636        6&      MOVS     r6,#0x36
        0x20000392:    5f45        E_      LDRSH    r5,[r0,r5]
        0x20000394:    5fa6        ._      LDRSH    r6,[r4,r6]
        0x20000396:    2734        4'      MOVS     r7,#0x34
        0x20000398:    4375        uC      MULS     r5,r6,r5
        0x2000039a:    2600        .&      MOVS     r6,#0
        0x2000039c:    5f8e        ._      LDRSH    r6,[r1,r6]
        0x2000039e:    5fe7        ._      LDRSH    r7,[r4,r7]
        0x200003a0:    437e        ~C      MULS     r6,r7,r6
        0x200003a2:    1bad        ..      SUBS     r5,r5,r6
        0x200003a4:    13ed        ..      ASRS     r5,r5,#15
        0x200003a6:    8015        ..      STRH     r5,[r2,#0]
        0x200003a8:    2200        ."      MOVS     r2,#0
        0x200003aa:    5e82        .^      LDRSH    r2,[r0,r2]
        0x200003ac:    2034        4       MOVS     r0,#0x34
        0x200003ae:    5e20         ^      LDRSH    r0,[r4,r0]
        0x200003b0:    4342        BC      MULS     r2,r0,r2
        0x200003b2:    2000        .       MOVS     r0,#0
        0x200003b4:    5e08        .^      LDRSH    r0,[r1,r0]
        0x200003b6:    2136        6!      MOVS     r1,#0x36
        0x200003b8:    5e61        a^      LDRSH    r1,[r4,r1]
        0x200003ba:    4348        HC      MULS     r0,r1,r0
        0x200003bc:    1810        ..      ADDS     r0,r2,r0
        0x200003be:    13c0        ..      ASRS     r0,r0,#15
        0x200003c0:    8018        ..      STRH     r0,[r3,#0]
        0x200003c2:    bcf0        ..      POP      {r4-r7}
        0x200003c4:    4770        pG      BX       lr
    anti_cogging_compesation_theta_to_idx_round
        0x200003c6:    b500        ..      PUSH     {lr}
        0x200003c8:    b083        ..      SUB      sp,sp,#0xc
        0x200003ca:    2266        f"      MOVS     r2,#0x66
        0x200003cc:    491a        .I      LDR      r1,[pc,#104] ; [0x20000438] = 0x40003800
        0x200003ce:    6108        .a      STR      r0,[r1,#0x10]
        0x200003d0:    614a        Ja      STR      r2,[r1,#0x14]
        0x200003d2:    2001        .       MOVS     r0,#1
        0x200003d4:    6008        .`      STR      r0,[r1,#0]
        0x200003d6:    6848        Hh      LDR      r0,[r1,#4]
        0x200003d8:    0780        ..      LSLS     r0,r0,#30
        0x200003da:    0fc0        ..      LSRS     r0,r0,#31
        0x200003dc:    2800        .(      CMP      r0,#0
        0x200003de:    d1fa        ..      BNE      0x200003d6 ; anti_cogging_compesation_theta_to_idx_round + 16
        0x200003e0:    a901        ..      ADD      r1,sp,#4
        0x200003e2:    a802        ..      ADD      r0,sp,#8
        0x200003e4:    f000fd20    .. .    BL       $Ven$TT$L$$DIV_SDiv_Result ; 0x20000e28
        0x200003e8:    9802        ..      LDR      r0,[sp,#8]
        0x200003ea:    b200        ..      SXTH     r0,r0
        0x200003ec:    217d        }!      MOVS     r1,#0x7d
        0x200003ee:    00c9        ..      LSLS     r1,r1,#3
        0x200003f0:    4288        .B      CMP      r0,r1
        0x200003f2:    db00        ..      BLT      0x200003f6 ; anti_cogging_compesation_theta_to_idx_round + 48
        0x200003f4:    1e48        H.      SUBS     r0,r1,#1
        0x200003f6:    b003        ..      ADD      sp,sp,#0xc
        0x200003f8:    bd00        ..      POP      {pc}
    alpha_beta_2_dq
        0x200003fa:    b4f0        ..      PUSH     {r4-r7}
        0x200003fc:    4c0f        .L      LDR      r4,[pc,#60] ; [0x2000043c] = 0x20000ea0
        0x200003fe:    2500        .%      MOVS     r5,#0
        0x20000400:    2636        6&      MOVS     r6,#0x36
        0x20000402:    5f45        E_      LDRSH    r5,[r0,r5]
        0x20000404:    5fa6        ._      LDRSH    r6,[r4,r6]
        0x20000406:    2734        4'      MOVS     r7,#0x34
        0x20000408:    4375        uC      MULS     r5,r6,r5
        0x2000040a:    2600        .&      MOVS     r6,#0
        0x2000040c:    5f8e        ._      LDRSH    r6,[r1,r6]
        0x2000040e:    5fe7        ._      LDRSH    r7,[r4,r7]
        0x20000410:    437e        ~C      MULS     r6,r7,r6
        0x20000412:    19ad        ..      ADDS     r5,r5,r6
        0x20000414:    13ed        ..      ASRS     r5,r5,#15
        0x20000416:    8015        ..      STRH     r5,[r2,#0]
        0x20000418:    2200        ."      MOVS     r2,#0
        0x2000041a:    5e8a        .^      LDRSH    r2,[r1,r2]
        0x2000041c:    2136        6!      MOVS     r1,#0x36
        0x2000041e:    e00f        ..      B        0x20000440 ; alpha_beta_2_dq + 70
    $d
        0x20000420:    ffffb61a    ....    DCD    4294948378
        0x20000424:    000049e6    .I..    DCD    18918
        0x20000428:    20000ee0    ...     DCD    536874720
        0x2000042c:    000007fd    ....    DCD    2045
        0x20000430:    000093cc    ....    DCD    37836
        0x20000434:    ffff6c34    4l..    DCD    4294929460
        0x20000438:    40003800    .8.@    DCD    1073756160
        0x2000043c:    20000ea0    ...     DCD    536874656
    $t
        0x20000440:    5e61        a^      LDRSH    r1,[r4,r1]
        0x20000442:    434a        JC      MULS     r2,r1,r2
        0x20000444:    2100        .!      MOVS     r1,#0
        0x20000446:    5e41        A^      LDRSH    r1,[r0,r1]
        0x20000448:    2034        4       MOVS     r0,#0x34
        0x2000044a:    5e20         ^      LDRSH    r0,[r4,r0]
        0x2000044c:    4341        AC      MULS     r1,r0,r1
        0x2000044e:    1a50        P.      SUBS     r0,r2,r1
        0x20000450:    13c0        ..      ASRS     r0,r0,#15
        0x20000452:    8018        ..      STRH     r0,[r3,#0]
        0x20000454:    bcf0        ..      POP      {r4-r7}
        0x20000456:    4770        pG      BX       lr
    foc_loop_isr
        0x20000458:    b5f0        ..      PUSH     {r4-r7,lr}
        0x2000045a:    b085        ..      SUB      sp,sp,#0x14
        0x2000045c:    49f7        .I      LDR      r1,[pc,#988] ; [0x2000083c] = 0x20000ea0
        0x2000045e:    7808        .x      LDRB     r0,[r1,#0]
        0x20000460:    2800        .(      CMP      r0,#0
        0x20000462:    d07d        }.      BEQ      0x20000560 ; foc_loop_isr + 264
        0x20000464:    4af6        .J      LDR      r2,[pc,#984] ; [0x20000840] = 0x40049000
        0x20000466:    6a50        Pj      LDR      r0,[r2,#0x24]
        0x20000468:    460e        .F      MOV      r6,r1
        0x2000046a:    0500        ..      LSLS     r0,r0,#20
        0x2000046c:    0c43        C.      LSRS     r3,r0,#17
        0x2000046e:    48f5        .H      LDR      r0,[pc,#980] ; [0x20000844] = 0x200010f0
        0x20000470:    8800        ..      LDRH     r0,[r0,#0]
        0x20000472:    1ac0        ..      SUBS     r0,r0,r3
        0x20000474:    8230        0.      STRH     r0,[r6,#0x10]
        0x20000476:    6b51        Qk      LDR      r1,[r2,#0x34]
        0x20000478:    0509        ..      LSLS     r1,r1,#20
        0x2000047a:    0c4b        K.      LSRS     r3,r1,#17
        0x2000047c:    49f2        .I      LDR      r1,[pc,#968] ; [0x20000848] = 0x200010f2
        0x2000047e:    8809        ..      LDRH     r1,[r1,#0]
        0x20000480:    1ac9        ..      SUBS     r1,r1,r3
        0x20000482:    8271        q.      STRH     r1,[r6,#0x12]
        0x20000484:    1840        @.      ADDS     r0,r0,r1
        0x20000486:    4240        @B      RSBS     r0,r0,#0
        0x20000488:    81f0        ..      STRH     r0,[r6,#0xe]
        0x2000048a:    48f0        .H      LDR      r0,[pc,#960] ; [0x2000084c] = 0x40049080
        0x2000048c:    6840        @h      LDR      r0,[r0,#4]
        0x2000048e:    0500        ..      LSLS     r0,r0,#20
        0x20000490:    0c41        A.      LSRS     r1,r0,#17
        0x20000492:    48ef        .H      LDR      r0,[pc,#956] ; [0x20000850] = 0xffffc8fe
        0x20000494:    1808        ..      ADDS     r0,r1,r0
        0x20000496:    b201        ..      SXTH     r1,r0
        0x20000498:    85b1        ..      STRH     r1,[r6,#0x2c]
        0x2000049a:    6950        Pi      LDR      r0,[r2,#0x14]
        0x2000049c:    4aed        .J      LDR      r2,[pc,#948] ; [0x20000854] = 0xffffc951
        0x2000049e:    0500        ..      LSLS     r0,r0,#20
        0x200004a0:    0c40        @.      LSRS     r0,r0,#17
        0x200004a2:    1880        ..      ADDS     r0,r0,r2
        0x200004a4:    85f0        ..      STRH     r0,[r6,#0x2e]
        0x200004a6:    8e30        0.      LDRH     r0,[r6,#0x30]
        0x200004a8:    4aeb        .J      LDR      r2,[pc,#940] ; [0x20000858] = 0x20000f30
        0x200004aa:    b280        ..      UXTH     r0,r0
        0x200004ac:    f000fc1f    ....    BL       LPFFunction_HR_2 ; 0x20000cee
        0x200004b0:    8e30        0.      LDRH     r0,[r6,#0x30]
        0x200004b2:    212e        .!      MOVS     r1,#0x2e
        0x200004b4:    b280        ..      UXTH     r0,r0
        0x200004b6:    4ae9        .J      LDR      r2,[pc,#932] ; [0x2000085c] = 0x20000f34
        0x200004b8:    5e71        q^      LDRSH    r1,[r6,r1]
        0x200004ba:    f000fc18    ....    BL       LPFFunction_HR_2 ; 0x20000cee
        0x200004be:    8e70        p.      LDRH     r0,[r6,#0x32]
        0x200004c0:    212c        ,!      MOVS     r1,#0x2c
        0x200004c2:    b280        ..      UXTH     r0,r0
        0x200004c4:    4ae6        .J      LDR      r2,[pc,#920] ; [0x20000860] = 0x20000f38
        0x200004c6:    5e71        q^      LDRSH    r1,[r6,r1]
        0x200004c8:    f000fc11    ....    BL       LPFFunction_HR_2 ; 0x20000cee
        0x200004cc:    8e70        p.      LDRH     r0,[r6,#0x32]
        0x200004ce:    212e        .!      MOVS     r1,#0x2e
        0x200004d0:    b280        ..      UXTH     r0,r0
        0x200004d2:    4ae4        .J      LDR      r2,[pc,#912] ; [0x20000864] = 0x20000f3c
        0x200004d4:    5e71        q^      LDRSH    r1,[r6,r1]
        0x200004d6:    f000fc0a    ....    BL       LPFFunction_HR_2 ; 0x20000cee
        0x200004da:    4de3        .M      LDR      r5,[pc,#908] ; [0x20000868] = 0x20000f20
        0x200004dc:    4ae0        .J      LDR      r2,[pc,#896] ; [0x20000860] = 0x20000f38
        0x200004de:    69a8        .i      LDR      r0,[r5,#0x18]
        0x200004e0:    13c0        ..      ASRS     r0,r0,#15
        0x200004e2:    b201        ..      SXTH     r1,r0
        0x200004e4:    8e70        p.      LDRH     r0,[r6,#0x32]
        0x200004e6:    b280        ..      UXTH     r0,r0
        0x200004e8:    f000fc01    ....    BL       LPFFunction_HR_2 ; 0x20000cee
        0x200004ec:    69e8        .i      LDR      r0,[r5,#0x1c]
        0x200004ee:    4add        .J      LDR      r2,[pc,#884] ; [0x20000864] = 0x20000f3c
        0x200004f0:    13c0        ..      ASRS     r0,r0,#15
        0x200004f2:    b201        ..      SXTH     r1,r0
        0x200004f4:    8e70        p.      LDRH     r0,[r6,#0x32]
        0x200004f6:    b280        ..      UXTH     r0,r0
        0x200004f8:    f000fbf9    ....    BL       LPFFunction_HR_2 ; 0x20000cee
        0x200004fc:    200e        .       MOVS     r0,#0xe
        0x200004fe:    5e30        0^      LDRSH    r0,[r6,r0]
        0x20000500:    82b0        ..      STRH     r0,[r6,#0x14]
        0x20000502:    49da        .I      LDR      r1,[pc,#872] ; [0x2000086c] = 0x49e6
        0x20000504:    4602        .F      MOV      r2,r0
        0x20000506:    434a        JC      MULS     r2,r1,r2
        0x20000508:    2110        .!      MOVS     r1,#0x10
        0x2000050a:    5e71        q^      LDRSH    r1,[r6,r1]
        0x2000050c:    4bd8        .K      LDR      r3,[pc,#864] ; [0x20000870] = 0x13cd
        0x2000050e:    434b        KC      MULS     r3,r1,r3
        0x20000510:    18d2        ..      ADDS     r2,r2,r3
        0x20000512:    03c9        ..      LSLS     r1,r1,#15
        0x20000514:    1851        Q.      ADDS     r1,r2,r1
        0x20000516:    13c9        ..      ASRS     r1,r1,#15
        0x20000518:    82f1        ..      STRH     r1,[r6,#0x16]
        0x2000051a:    8330        0.      STRH     r0,[r6,#0x18]
        0x2000051c:    8371        q.      STRH     r1,[r6,#0x1a]
        0x2000051e:    4bd5        .K      LDR      r3,[pc,#852] ; [0x20000874] = 0x20000ec2
        0x20000520:    4ad5        .J      LDR      r2,[pc,#852] ; [0x20000878] = 0x20000ec0
        0x20000522:    49d6        .I      LDR      r1,[pc,#856] ; [0x2000087c] = 0x20000eba
        0x20000524:    48d6        .H      LDR      r0,[pc,#856] ; [0x20000880] = 0x20000eb8
        0x20000526:    f7ffff68    ..h.    BL       alpha_beta_2_dq ; 0x200003fa
        0x2000052a:    4cd6        .L      LDR      r4,[pc,#856] ; [0x20000884] = 0x20000f00
        0x2000052c:    2202        ."      MOVS     r2,#2
        0x2000052e:    2122        "!      MOVS     r1,#0x22
        0x20000530:    5ea2        .^      LDRSH    r2,[r4,r2]
        0x20000532:    5e71        q^      LDRSH    r1,[r6,r1]
        0x20000534:    48d4        .H      LDR      r0,[pc,#848] ; [0x20000888] = 0x3a7
        0x20000536:    f000fbc9    ....    BL       LPFFunction ; 0x20000ccc
        0x2000053a:    8060        `.      STRH     r0,[r4,#2]
        0x2000053c:    48d3        .H      LDR      r0,[pc,#844] ; [0x2000088c] = 0x20000f44
        0x2000053e:    49d4        .I      LDR      r1,[pc,#848] ; [0x20000890] = 0x20000f40
        0x20000540:    9100        ..      STR      r1,[sp,#0]
        0x20000542:    9001        ..      STR      r0,[sp,#4]
        0x20000544:    212c        ,!      MOVS     r1,#0x2c
        0x20000546:    202e        .       MOVS     r0,#0x2e
        0x20000548:    2304        .#      MOVS     r3,#4
        0x2000054a:    4ad2        .J      LDR      r2,[pc,#840] ; [0x20000894] = 0x20000fc8
        0x2000054c:    5e71        q^      LDRSH    r1,[r6,r1]
        0x2000054e:    5e30        0^      LDRSH    r0,[r6,r0]
        0x20000550:    f000fc70    ..p.    BL       $Ven$TT$L$$pll ; 0x20000e34
        0x20000554:    48d0        .H      LDR      r0,[pc,#832] ; [0x20000898] = 0x20000f4c
        0x20000556:    49d1        .I      LDR      r1,[pc,#836] ; [0x2000089c] = 0x20000f48
        0x20000558:    9100        ..      STR      r1,[sp,#0]
        0x2000055a:    9001        ..      STR      r0,[sp,#4]
        0x2000055c:    69a8        .i      LDR      r0,[r5,#0x18]
        0x2000055e:    e000        ..      B        0x20000562 ; foc_loop_isr + 266
        0x20000560:    e295        ..      B        0x20000a8e ; foc_loop_isr + 1590
        0x20000562:    13c0        ..      ASRS     r0,r0,#15
        0x20000564:    b201        ..      SXTH     r1,r0
        0x20000566:    69e8        .i      LDR      r0,[r5,#0x1c]
        0x20000568:    2305        .#      MOVS     r3,#5
        0x2000056a:    13c0        ..      ASRS     r0,r0,#15
        0x2000056c:    b200        ..      SXTH     r0,r0
        0x2000056e:    4acc        .J      LDR      r2,[pc,#816] ; [0x200008a0] = 0x20000ff0
        0x20000570:    f000fc60    ..`.    BL       $Ven$TT$L$$pll ; 0x20000e34
        0x20000574:    6a28        (j      LDR      r0,[r5,#0x20]
        0x20000576:    0040        @.      LSLS     r0,r0,#1
        0x20000578:    6328        (c      STR      r0,[r5,#0x30]
        0x2000057a:    8ca8        ..      LDRH     r0,[r5,#0x24]
        0x2000057c:    4ac9        .J      LDR      r2,[pc,#804] ; [0x200008a4] = 0x20000f54
        0x2000057e:    0040        @.      LSLS     r0,r0,#1
        0x20000580:    b201        ..      SXTH     r1,r0
        0x20000582:    20a3        .       MOVS     r0,#0xa3
        0x20000584:    f000fbb3    ....    BL       LPFFunction_HR_2 ; 0x20000cee
        0x20000588:    6b68        hk      LDR      r0,[r5,#0x34]
        0x2000058a:    1200        ..      ASRS     r0,r0,#8
        0x2000058c:    8770        p.      STRH     r0,[r6,#0x3a]
        0x2000058e:    4fc6        .O      LDR      r7,[pc,#792] ; [0x200008a8] = 0x1921f
        0x20000590:    6b28        (k      LDR      r0,[r5,#0x30]
        0x20000592:    4ec6        .N      LDR      r6,[pc,#792] ; [0x200008ac] = 0x40003800
        0x20000594:    6130        0a      STR      r0,[r6,#0x10]
        0x20000596:    6177        wa      STR      r7,[r6,#0x14]
        0x20000598:    2001        .       MOVS     r0,#1
        0x2000059a:    6030        0`      STR      r0,[r6,#0]
        0x2000059c:    6870        ph      LDR      r0,[r6,#4]
        0x2000059e:    0780        ..      LSLS     r0,r0,#30
        0x200005a0:    0fc0        ..      LSRS     r0,r0,#31
        0x200005a2:    2800        .(      CMP      r0,#0
        0x200005a4:    d1fa        ..      BNE      0x2000059c ; foc_loop_isr + 324
        0x200005a6:    a903        ..      ADD      r1,sp,#0xc
        0x200005a8:    a804        ..      ADD      r0,sp,#0x10
        0x200005aa:    f000fc3d    ..=.    BL       $Ven$TT$L$$DIV_SDiv_Result ; 0x20000e28
        0x200005ae:    9803        ..      LDR      r0,[sp,#0xc]
        0x200005b0:    6869        ih      LDR      r1,[r5,#4]
        0x200005b2:    1a40        @.      SUBS     r0,r0,r1
        0x200005b4:    6328        (c      STR      r0,[r5,#0x30]
        0x200005b6:    2800        .(      CMP      r0,#0
        0x200005b8:    da01        ..      BGE      0x200005be ; foc_loop_isr + 358
        0x200005ba:    19c0        ..      ADDS     r0,r0,r7
        0x200005bc:    6328        (c      STR      r0,[r5,#0x30]
        0x200005be:    6b28        (k      LDR      r0,[r5,#0x30]
        0x200005c0:    42b8        .B      CMP      r0,r7
        0x200005c2:    dd02        ..      BLE      0x200005ca ; foc_loop_isr + 370
        0x200005c4:    4aba        .J      LDR      r2,[pc,#744] ; [0x200008b0] = 0xfffe6de1
