747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
        0x200005c6:    1880        ..      ADDS     r0,r0,r2
        0x200005c8:    6328        (c      STR      r0,[r5,#0x30]
        0x200005ca:    6b28        (k      LDR      r0,[r5,#0x30]
        0x200005cc:    63a8        .c      STR      r0,[r5,#0x38]
        0x200005ce:    6aaa        .j      LDR      r2,[r5,#0x28]
        0x200005d0:    0052        R.      LSLS     r2,r2,#1
        0x200005d2:    1a51        Q.      SUBS     r1,r2,r1
        0x200005d4:    63e9        .c      STR      r1,[r5,#0x3c]
        0x200005d6:    2800        .(      CMP      r0,#0
        0x200005d8:    da01        ..      BGE      0x200005de ; foc_loop_isr + 390
        0x200005da:    19c0        ..      ADDS     r0,r0,r7
        0x200005dc:    6328        (c      STR      r0,[r5,#0x30]
        0x200005de:    6b28        (k      LDR      r0,[r5,#0x30]
        0x200005e0:    42b8        .B      CMP      r0,r7
        0x200005e2:    dd02        ..      BLE      0x200005ea ; foc_loop_isr + 402
        0x200005e4:    49b2        .I      LDR      r1,[pc,#712] ; [0x200008b0] = 0xfffe6de1
        0x200005e6:    1840        @.      ADDS     r0,r0,r1
        0x200005e8:    6328        (c      STR      r0,[r5,#0x30]
        0x200005ea:    6c68        hl      LDR      r0,[r5,#0x44]
        0x200005ec:    0040        @.      LSLS     r0,r0,#1
        0x200005ee:    6428        (d      STR      r0,[r5,#0x40]
        0x200005f0:    6130        0a      STR      r0,[r6,#0x10]
        0x200005f2:    6177        wa      STR      r7,[r6,#0x14]
        0x200005f4:    2001        .       MOVS     r0,#1
        0x200005f6:    6030        0`      STR      r0,[r6,#0]
        0x200005f8:    48ac        .H      LDR      r0,[pc,#688] ; [0x200008ac] = 0x40003800
        0x200005fa:    6840        @h      LDR      r0,[r0,#4]
        0x200005fc:    0780        ..      LSLS     r0,r0,#30
        0x200005fe:    0fc0        ..      LSRS     r0,r0,#31
        0x20000600:    2800        .(      CMP      r0,#0
        0x20000602:    d1f9        ..      BNE      0x200005f8 ; foc_loop_isr + 416
        0x20000604:    a903        ..      ADD      r1,sp,#0xc
        0x20000606:    a804        ..      ADD      r0,sp,#0x10
        0x20000608:    f000fc0e    ....    BL       $Ven$TT$L$$DIV_SDiv_Result ; 0x20000e28
        0x2000060c:    9803        ..      LDR      r0,[sp,#0xc]
        0x2000060e:    6869        ih      LDR      r1,[r5,#4]
        0x20000610:    1a40        @.      SUBS     r0,r0,r1
        0x20000612:    6428        (d      STR      r0,[r5,#0x40]
        0x20000614:    2800        .(      CMP      r0,#0
        0x20000616:    da01        ..      BGE      0x2000061c ; foc_loop_isr + 452
        0x20000618:    19c0        ..      ADDS     r0,r0,r7
        0x2000061a:    6428        (d      STR      r0,[r5,#0x40]
        0x2000061c:    49a2        .I      LDR      r1,[pc,#648] ; [0x200008a8] = 0x1921f
        0x2000061e:    6c28        (l      LDR      r0,[r5,#0x40]
        0x20000620:    4288        .B      CMP      r0,r1
        0x20000622:    dd02        ..      BLE      0x2000062a ; foc_loop_isr + 466
        0x20000624:    4249        IB      RSBS     r1,r1,#0
        0x20000626:    1840        @.      ADDS     r0,r0,r1
        0x20000628:    6428        (d      STR      r0,[r5,#0x40]
        0x2000062a:    48a2        .H      LDR      r0,[pc,#648] ; [0x200008b4] = 0xffff5874
        0x2000062c:    6c29        )l      LDR      r1,[r5,#0x40]
        0x2000062e:    4f83        .O      LDR      r7,[pc,#524] ; [0x2000083c] = 0x20000ea0
        0x20000630:    1808        ..      ADDS     r0,r1,r0
        0x20000632:    b202        ..      SXTH     r2,r0
        0x20000634:    87fa        ..      STRH     r2,[r7,#0x3e]
        0x20000636:    4ea0        .N      LDR      r6,[pc,#640] ; [0x200008b8] = 0x20000ee0
        0x20000638:    2302        .#      MOVS     r3,#2
        0x2000063a:    2100        .!      MOVS     r1,#0
        0x2000063c:    5ef3        .^      LDRSH    r3,[r6,r3]
        0x2000063e:    5e71        q^      LDRSH    r1,[r6,r1]
        0x20000640:    489e        .H      LDR      r0,[pc,#632] ; [0x200008bc] = 0x6665
        0x20000642:    f000fb5e    ..^.    BL       HPFFunction ; 0x20000d02
        0x20000646:    8030        0.      STRH     r0,[r6,#0]
        0x20000648:    8ff8        ..      LDRH     r0,[r7,#0x3e]
        0x2000064a:    8070        p.      STRH     r0,[r6,#2]
        0x2000064c:    8820         .      LDRH     r0,[r4,#0]
        0x2000064e:    1c40        @.      ADDS     r0,r0,#1
        0x20000650:    b200        ..      SXTH     r0,r0
        0x20000652:    8020         .      STRH     r0,[r4,#0]
        0x20000654:    2700        .'      MOVS     r7,#0
        0x20000656:    2805        .(      CMP      r0,#5
        0x20000658:    dd43        C.      BLE      0x200006e2 ; foc_loop_isr + 650
        0x2000065a:    8027        '.      STRH     r7,[r4,#0]
        0x2000065c:    4b77        wK      LDR      r3,[pc,#476] ; [0x2000083c] = 0x20000ea0
        0x2000065e:    2003        .       MOVS     r0,#3
        0x20000660:    5618        .V      LDRSB    r0,[r3,r0]
        0x20000662:    2800        .(      CMP      r0,#0
        0x20000664:    dd0c        ..      BLE      0x20000680 ; foc_loop_isr + 552
        0x20000666:    6f69        io      LDR      r1,[r5,#0x74]
        0x20000668:    6e28        (n      LDR      r0,[r5,#0x60]
        0x2000066a:    1840        @.      ADDS     r0,r0,r1
        0x2000066c:    6628        (f      STR      r0,[r5,#0x60]
        0x2000066e:    6da9        .m      LDR      r1,[r5,#0x58]
        0x20000670:    4288        .B      CMP      r0,r1
        0x20000672:    db11        ..      BLT      0x20000698 ; foc_loop_isr + 576
        0x20000674:    6629        )f      STR      r1,[r5,#0x60]
        0x20000676:    70df        .p      STRB     r7,[r3,#3]
        0x20000678:    2001        .       MOVS     r0,#1
        0x2000067a:    7118        .q      STRB     r0,[r3,#4]
        0x2000067c:    66af        .f      STR      r7,[r5,#0x68]
        0x2000067e:    e00b        ..      B        0x20000698 ; foc_loop_isr + 576
        0x20000680:    6f69        io      LDR      r1,[r5,#0x74]
        0x20000682:    6e28        (n      LDR      r0,[r5,#0x60]
        0x20000684:    1a40        @.      SUBS     r0,r0,r1
        0x20000686:    6628        (f      STR      r0,[r5,#0x60]
        0x20000688:    6de9        .m      LDR      r1,[r5,#0x5c]
        0x2000068a:    4288        .B      CMP      r0,r1
        0x2000068c:    dc04        ..      BGT      0x20000698 ; foc_loop_isr + 576
        0x2000068e:    6629        )f      STR      r1,[r5,#0x60]
        0x20000690:    2001        .       MOVS     r0,#1
        0x20000692:    70d8        .p      STRB     r0,[r3,#3]
        0x20000694:    7118        .q      STRB     r0,[r3,#4]
        0x20000696:    66af        .f      STR      r7,[r5,#0x68]
        0x20000698:    2005        .       MOVS     r0,#5
        0x2000069a:    5618        .V      LDRSB    r0,[r3,r0]
        0x2000069c:    2800        .(      CMP      r0,#0
        0x2000069e:    dd0a        ..      BLE      0x200006b6 ; foc_loop_isr + 606
        0x200006a0:    4887        .H      LDR      r0,[pc,#540] ; [0x200008c0] = 0x20000fa0
        0x200006a2:    6fe9        .o      LDR      r1,[r5,#0x7c]
        0x200006a4:    6842        Bh      LDR      r2,[r0,#4]
        0x200006a6:    1889        ..      ADDS     r1,r1,r2
        0x200006a8:    67e9        .g      STR      r1,[r5,#0x7c]
        0x200006aa:    6880        .h      LDR      r0,[r0,#8]
        0x200006ac:    4281        .B      CMP      r1,r0
        0x200006ae:    db0d        ..      BLT      0x200006cc ; foc_loop_isr + 628
        0x200006b0:    67e8        .g      STR      r0,[r5,#0x7c]
        0x200006b2:    715f        _q      STRB     r7,[r3,#5]
        0x200006b4:    e00a        ..      B        0x200006cc ; foc_loop_isr + 628
        0x200006b6:    4a82        .J      LDR      r2,[pc,#520] ; [0x200008c0] = 0x20000fa0
        0x200006b8:    6fe8        .o      LDR      r0,[r5,#0x7c]
        0x200006ba:    6851        Qh      LDR      r1,[r2,#4]
        0x200006bc:    1a40        @.      SUBS     r0,r0,r1
        0x200006be:    67e8        .g      STR      r0,[r5,#0x7c]
        0x200006c0:    68d1        .h      LDR      r1,[r2,#0xc]
        0x200006c2:    4288        .B      CMP      r0,r1
        0x200006c4:    dc02        ..      BGT      0x200006cc ; foc_loop_isr + 628
        0x200006c6:    67e9        .g      STR      r1,[r5,#0x7c]
        0x200006c8:    2001        .       MOVS     r0,#1
        0x200006ca:    7158        Xq      STRB     r0,[r3,#5]
        0x200006cc:    4879        yH      LDR      r0,[pc,#484] ; [0x200008b4] = 0xffff5874
        0x200006ce:    6fe9        .o      LDR      r1,[r5,#0x7c]
        0x200006d0:    1808        ..      ADDS     r0,r1,r0
        0x200006d2:    497c        |I      LDR      r1,[pc,#496] ; [0x200008c4] = 0x5a7e
        0x200006d4:    b200        ..      SXTH     r0,r0
        0x200006d6:    4348        HC      MULS     r0,r1,r0
        0x200006d8:    13c1        ..      ASRS     r1,r0,#15
        0x200006da:    487b        {H      LDR      r0,[pc,#492] ; [0x200008c8] = 0xa78c
        0x200006dc:    1809        ..      ADDS     r1,r1,r0
        0x200006de:    4878        xH      LDR      r0,[pc,#480] ; [0x200008c0] = 0x20000fa0
        0x200006e0:    6001        .`      STR      r1,[r0,#0]
        0x200006e2:    4874        tH      LDR      r0,[pc,#464] ; [0x200008b4] = 0xffff5874
        0x200006e4:    6e29        )n      LDR      r1,[r5,#0x60]
        0x200006e6:    1808        ..      ADDS     r0,r1,r0
        0x200006e8:    2800        .(      CMP      r0,#0
        0x200006ea:    da00        ..      BGE      0x200006ee ; foc_loop_isr + 662
        0x200006ec:    4240        @B      RSBS     r0,r0,#0
        0x200006ee:    6d6a        jm      LDR      r2,[r5,#0x54]
        0x200006f0:    03c1        ..      LSLS     r1,r0,#15
        0x200006f2:    486e        nH      LDR      r0,[pc,#440] ; [0x200008ac] = 0x40003800
        0x200006f4:    6101        .a      STR      r1,[r0,#0x10]
        0x200006f6:    6142        Ba      STR      r2,[r0,#0x14]
        0x200006f8:    2101        .!      MOVS     r1,#1
        0x200006fa:    6001        .`      STR      r1,[r0,#0]
        0x200006fc:    6841        Ah      LDR      r1,[r0,#4]
        0x200006fe:    0789        ..      LSLS     r1,r1,#30
        0x20000700:    0fc9        ..      LSRS     r1,r1,#31
        0x20000702:    2900        .)      CMP      r1,#0
        0x20000704:    d1fa        ..      BNE      0x200006fc ; foc_loop_isr + 676
        0x20000706:    a903        ..      ADD      r1,sp,#0xc
        0x20000708:    a804        ..      ADD      r0,sp,#0x10
        0x2000070a:    f000fb8d    ....    BL       $Ven$TT$L$$DIV_SDiv_Result ; 0x20000e28
        0x2000070e:    496f        oI      LDR      r1,[pc,#444] ; [0x200008cc] = 0xccd
        0x20000710:    9804        ..      LDR      r0,[sp,#0x10]
        0x20000712:    4348        HC      MULS     r0,r1,r0
        0x20000714:    13c0        ..      ASRS     r0,r0,#15
        0x20000716:    1e49        I.      SUBS     r1,r1,#1
        0x20000718:    1840        @.      ADDS     r0,r0,r1
        0x2000071a:    83b0        ..      STRH     r0,[r6,#0x1c]
        0x2000071c:    4d52        RM      LDR      r5,[pc,#328] ; [0x20000868] = 0x20000f20
        0x2000071e:    6a28        (j      LDR      r0,[r5,#0x20]
        0x20000720:    f7fffe51    ..Q.    BL       anti_cogging_compesation_theta_to_idx_round ; 0x200003c6
        0x20000724:    8370        p.      STRH     r0,[r6,#0x1a]
        0x20000726:    496a        jI      LDR      r1,[pc,#424] ; [0x200008d0] = 0x2000117c
        0x20000728:    0040        @.      LSLS     r0,r0,#1
        0x2000072a:    5e09        .^      LDRSH    r1,[r1,r0]
        0x2000072c:    2218        ."      MOVS     r2,#0x18
        0x2000072e:    20ff        .       MOVS     r0,#0xff
        0x20000730:    5eb2        .^      LDRSH    r2,[r6,r2]
        0x20000732:    3048        H0      ADDS     r0,r0,#0x48
        0x20000734:    f000faca    ....    BL       LPFFunction ; 0x20000ccc
        0x20000738:    8330        0.      STRH     r0,[r6,#0x18]
        0x2000073a:    6b29        )k      LDR      r1,[r5,#0x30]
        0x2000073c:    6e28        (n      LDR      r0,[r5,#0x60]
        0x2000073e:    f000fb57    ..W.    BL       theta_distance ; 0x20000df0
        0x20000742:    b201        ..      SXTH     r1,r0
        0x20000744:    80a1        ..      STRH     r1,[r4,#4]
        0x20000746:    4863        cH      LDR      r0,[pc,#396] ; [0x200008d4] = 0x20001090
        0x20000748:    f000fa3c    ..<.    BL       pi_controller ; 0x20000bc4
        0x2000074c:    b200        ..      SXTH     r0,r0
        0x2000074e:    80e0        ..      STRH     r0,[r4,#6]
        0x20000750:    493a        :I      LDR      r1,[pc,#232] ; [0x2000083c] = 0x20000ea0
        0x20000752:    7849        Ix      LDRB     r1,[r1,#1]
        0x20000754:    2900        .)      CMP      r1,#0
        0x20000756:    d00a        ..      BEQ      0x2000076e ; foc_loop_isr + 790
        0x20000758:    3d80        .=      SUBS     r5,r5,#0x80
        0x2000075a:    8f69        i.      LDRH     r1,[r5,#0x3a]
        0x2000075c:    1a40        @.      SUBS     r0,r0,r1
        0x2000075e:    b201        ..      SXTH     r1,r0
        0x20000760:    485d        ]H      LDR      r0,[pc,#372] ; [0x200008d8] = 0x200010b8
        0x20000762:    f000fa2f    ../.    BL       pi_controller ; 0x20000bc4
        0x20000766:    8b31        1.      LDRH     r1,[r6,#0x18]
        0x20000768:    1840        @.      ADDS     r0,r0,r1
        0x2000076a:    8568        h.      STRH     r0,[r5,#0x2a]
        0x2000076c:    e007        ..      B        0x2000077e ; foc_loop_isr + 806
        0x2000076e:    4d33        3M      LDR      r5,[pc,#204] ; [0x2000083c] = 0x20000ea0
        0x20000770:    8f69        i.      LDRH     r1,[r5,#0x3a]
        0x20000772:    1a40        @.      SUBS     r0,r0,r1
        0x20000774:    b201        ..      SXTH     r1,r0
        0x20000776:    4858        XH      LDR      r0,[pc,#352] ; [0x200008d8] = 0x200010b8
        0x20000778:    f000fa24    ..$.    BL       pi_controller ; 0x20000bc4
        0x2000077c:    8568        h.      STRH     r0,[r5,#0x2a]
        0x2000077e:    4d3a        :M      LDR      r5,[pc,#232] ; [0x20000868] = 0x20000f20
        0x20000780:    4a56        VJ      LDR      r2,[pc,#344] ; [0x200008dc] = 0xfffffca7
        0x20000782:    6da8        .m      LDR      r0,[r5,#0x58]
        0x20000784:    6e29        )n      LDR      r1,[r5,#0x60]
        0x20000786:    1880        ..      ADDS     r0,r0,r2
        0x20000788:    220f        ."      MOVS     r2,#0xf
        0x2000078a:    4281        .B      CMP      r1,r0
        0x2000078c:    dd07        ..      BLE      0x2000079e ; foc_loop_isr + 838
        0x2000078e:    6ee8        .n      LDR      r0,[r5,#0x6c]
        0x20000790:    1c40        @.      ADDS     r0,r0,#1
        0x20000792:    66e8        .f      STR      r0,[r5,#0x6c]
        0x20000794:    280f        .(      CMP      r0,#0xf
        0x20000796:    dd00        ..      BLE      0x2000079a ; foc_loop_isr + 834
        0x20000798:    66ea        .f      STR      r2,[r5,#0x6c]
        0x2000079a:    672f        /g      STR      r7,[r5,#0x70]
        0x2000079c:    e004        ..      B        0x200007a8 ; foc_loop_isr + 848
        0x2000079e:    6ee8        .n      LDR      r0,[r5,#0x6c]
        0x200007a0:    2800        .(      CMP      r0,#0
        0x200007a2:    dd01        ..      BLE      0x200007a8 ; foc_loop_isr + 848
        0x200007a4:    1e40        @.      SUBS     r0,r0,#1
        0x200007a6:    66e8        .f      STR      r0,[r5,#0x6c]
        0x200007a8:    4b4d        MK      LDR      r3,[pc,#308] ; [0x200008e0] = 0x359
        0x200007aa:    6de8        .m      LDR      r0,[r5,#0x5c]
        0x200007ac:    18c0        ..      ADDS     r0,r0,r3
        0x200007ae:    4281        .B      CMP      r1,r0
        0x200007b0:    da07        ..      BGE      0x200007c2 ; foc_loop_isr + 874
        0x200007b2:    6f28        (o      LDR      r0,[r5,#0x70]
        0x200007b4:    1c40        @.      ADDS     r0,r0,#1
        0x200007b6:    6728        (g      STR      r0,[r5,#0x70]
        0x200007b8:    280f        .(      CMP      r0,#0xf
        0x200007ba:    dd00        ..      BLE      0x200007be ; foc_loop_isr + 870
        0x200007bc:    672a        *g      STR      r2,[r5,#0x70]
        0x200007be:    66ef        .f      STR      r7,[r5,#0x6c]
        0x200007c0:    e004        ..      B        0x200007cc ; foc_loop_isr + 884
        0x200007c2:    6f28        (o      LDR      r0,[r5,#0x70]
        0x200007c4:    2800        .(      CMP      r0,#0
        0x200007c6:    dd01        ..      BLE      0x200007cc ; foc_loop_isr + 884
        0x200007c8:    1e40        @.      SUBS     r0,r0,#1
        0x200007ca:    6728        (g      STR      r0,[r5,#0x70]
        0x200007cc:    6ee8        .n      LDR      r0,[r5,#0x6c]
        0x200007ce:    280a        .(      CMP      r0,#0xa
        0x200007d0:    dd0c        ..      BLE      0x200007ec ; foc_loop_isr + 916
        0x200007d2:    481a        .H      LDR      r0,[pc,#104] ; [0x2000083c] = 0x20000ea0
        0x200007d4:    2103        .!      MOVS     r1,#3
        0x200007d6:    5641        AV      LDRSB    r1,[r0,r1]
        0x200007d8:    2901        .)      CMP      r1,#1
        0x200007da:    dd03        ..      BLE      0x200007e4 ; foc_loop_isr + 908
        0x200007dc:    8920         .      LDRH     r0,[r4,#8]
        0x200007de:    1d40        @.      ADDS     r0,r0,#5
        0x200007e0:    8120         .      STRH     r0,[r4,#8]
        0x200007e2:    e014        ..      B        0x2000080e ; foc_loop_isr + 950
        0x200007e4:    8920         .      LDRH     r0,[r4,#8]
        0x200007e6:    1f40        @.      SUBS     r0,r0,#5
        0x200007e8:    8120         .      STRH     r0,[r4,#8]
        0x200007ea:    e010        ..      B        0x2000080e ; foc_loop_isr + 950
        0x200007ec:    6f28        (o      LDR      r0,[r5,#0x70]
        0x200007ee:    280a        .(      CMP      r0,#0xa
        0x200007f0:    dd0c        ..      BLE      0x2000080c ; foc_loop_isr + 948
        0x200007f2:    4812        .H      LDR      r0,[pc,#72] ; [0x2000083c] = 0x20000ea0
        0x200007f4:    2103        .!      MOVS     r1,#3
        0x200007f6:    5641        AV      LDRSB    r1,[r0,r1]
        0x200007f8:    2901        .)      CMP      r1,#1
        0x200007fa:    dd03        ..      BLE      0x20000804 ; foc_loop_isr + 940
        0x200007fc:    8920         .      LDRH     r0,[r4,#8]
        0x200007fe:    1f40        @.      SUBS     r0,r0,#5
        0x20000800:    8120         .      STRH     r0,[r4,#8]
        0x20000802:    e004        ..      B        0x2000080e ; foc_loop_isr + 950
        0x20000804:    8920         .      LDRH     r0,[r4,#8]
        0x20000806:    1d40        @.      ADDS     r0,r0,#5
        0x20000808:    8120         .      STRH     r0,[r4,#8]
        0x2000080a:    e000        ..      B        0x2000080e ; foc_loop_isr + 950
        0x2000080c:    8127        '.      STRH     r7,[r4,#8]
        0x2000080e:    480b        .H      LDR      r0,[pc,#44] ; [0x2000083c] = 0x20000ea0
        0x20000810:    7900        .y      LDRB     r0,[r0,#4]
        0x20000812:    2800        .(      CMP      r0,#0
        0x20000814:    d006        ..      BEQ      0x20000824 ; foc_loop_isr + 972
        0x20000816:    4809        .H      LDR      r0,[pc,#36] ; [0x2000083c] = 0x20000ea0
        0x20000818:    7107        .q      STRB     r7,[r0,#4]
        0x2000081a:    6a68        hj      LDR      r0,[r5,#0x24]
        0x2000081c:    4240        @B      RSBS     r0,r0,#0
        0x2000081e:    6268        hb      STR      r0,[r5,#0x24]
        0x20000820:    481c        .H      LDR      r0,[pc,#112] ; [0x20000894] = 0x20000fc8
        0x20000822:    6087        .`      STR      r7,[r0,#8]
        0x20000824:    88f0        ..      LDRH     r0,[r6,#6]
        0x20000826:    2801        .(      CMP      r0,#1
        0x20000828:    d05c        \.      BEQ      0x200008e4 ; foc_loop_isr + 1164
        0x2000082a:    2000        .       MOVS     r0,#0
        0x2000082c:    5e30        0^      LDRSH    r0,[r6,r0]
        0x2000082e:    1d41        A.      ADDS     r1,r0,#5
        0x20000830:    da6b        k.      BGE      0x2000090a ; foc_loop_isr + 1202
        0x20000832:    6ca8        .l      LDR      r0,[r5,#0x48]
        0x20000834:    1c40        @.      ADDS     r0,r0,#1
        0x20000836:    64a8        .d      STR      r0,[r5,#0x48]
        0x20000838:    e06c        l.      B        0x20000914 ; foc_loop_isr + 1212
    $d
        0x2000083a:    0000        ..      DCW    0
        0x2000083c:    20000ea0    ...     DCD    536874656
        0x20000840:    40049000    ...@    DCD    1074040832
        0x20000844:    200010f0    ...     DCD    536875248
        0x20000848:    200010f2    ...     DCD    536875250
        0x2000084c:    40049080    ...@    DCD    1074040960
        0x20000850:    ffffc8fe    ....    DCD    4294953214
        0x20000854:    ffffc951    Q...    DCD    4294953297
        0x20000858:    20000f30    0..     DCD    536874800
        0x2000085c:    20000f34    4..     DCD    536874804
        0x20000860:    20000f38    8..     DCD    536874808
        0x20000864:    20000f3c    <..     DCD    536874812
        0x20000868:    20000f20     ..     DCD    536874784
        0x2000086c:    000049e6    .I..    DCD    18918
        0x20000870:    000013cd    ....    DCD    5069
        0x20000874:    20000ec2    ...     DCD    536874690
        0x20000878:    20000ec0    ...     DCD    536874688
        0x2000087c:    20000eba    ...     DCD    536874682
        0x20000880:    20000eb8    ...     DCD    536874680
        0x20000884:    20000f00    ...     DCD    536874752
        0x20000888:    000003a7    ....    DCD    935
        0x2000088c:    20000f44    D..     DCD    536874820
        0x20000890:    20000f40    @..     DCD    536874816
        0x20000894:    20000fc8    ...     DCD    536874952
        0x20000898:    20000f4c    L..     DCD    536874828
        0x2000089c:    20000f48    H..     DCD    536874824
        0x200008a0:    20000ff0    ...     DCD    536874992
        0x200008a4:    20000f54    T..     DCD    536874836
        0x200008a8:    0001921f    ....    DCD    102943
        0x200008ac:    40003800    .8.@    DCD    1073756160
        0x200008b0:    fffe6de1    .m..    DCD    4294864353
        0x200008b4:    ffff5874    tX..    DCD    4294924404
        0x200008b8:    20000ee0    ...     DCD    536874720
        0x200008bc:    00006665    ef..    DCD    26213
        0x200008c0:    20000fa0    ...     DCD    536874912
        0x200008c4:    00005a7e    ~Z..    DCD    23166
        0x200008c8:    0000a78c    ....    DCD    42892
        0x200008cc:    00000ccd    ....    DCD    3277
        0x200008d0:    2000117c    |..     DCD    536875388
        0x200008d4:    20001090    ...     DCD    536875152
        0x200008d8:    200010b8    ...     DCD    536875192
        0x200008dc:    fffffca7    ....    DCD    4294966439
        0x200008e0:    00000359    Y...    DCD    857
    $t
        0x200008e4:    2000        .       MOVS     r0,#0
        0x200008e6:    5e30        0^      LDRSH    r0,[r6,r0]
        0x200008e8:    2805        .(      CMP      r0,#5
        0x200008ea:    dd03        ..      BLE      0x200008f4 ; foc_loop_isr + 1180
        0x200008ec:    6ca8        .l      LDR      r0,[r5,#0x48]
        0x200008ee:    1c40        @.      ADDS     r0,r0,#1
