747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
        0x200008f0:    64a8        .d      STR      r0,[r5,#0x48]
        0x200008f2:    e004        ..      B        0x200008fe ; foc_loop_isr + 1190
        0x200008f4:    6ca8        .l      LDR      r0,[r5,#0x48]
        0x200008f6:    2800        .(      CMP      r0,#0
        0x200008f8:    dd01        ..      BLE      0x200008fe ; foc_loop_isr + 1190
        0x200008fa:    1e40        @.      SUBS     r0,r0,#1
        0x200008fc:    64a8        .d      STR      r0,[r5,#0x48]
        0x200008fe:    6ca8        .l      LDR      r0,[r5,#0x48]
        0x20000900:    280a        .(      CMP      r0,#0xa
        0x20000902:    dd1b        ..      BLE      0x2000093c ; foc_loop_isr + 1252
        0x20000904:    80f7        ..      STRH     r7,[r6,#6]
        0x20000906:    64af        .d      STR      r7,[r5,#0x48]
        0x20000908:    e018        ..      B        0x2000093c ; foc_loop_isr + 1252
        0x2000090a:    6ca8        .l      LDR      r0,[r5,#0x48]
        0x2000090c:    2800        .(      CMP      r0,#0
        0x2000090e:    dd01        ..      BLE      0x20000914 ; foc_loop_isr + 1212
        0x20000910:    1e40        @.      SUBS     r0,r0,#1
        0x20000912:    64a8        .d      STR      r0,[r5,#0x48]
        0x20000914:    6ca8        .l      LDR      r0,[r5,#0x48]
        0x20000916:    280a        .(      CMP      r0,#0xa
        0x20000918:    dd10        ..      BLE      0x2000093c ; foc_loop_isr + 1252
        0x2000091a:    8930        0.      LDRH     r0,[r6,#8]
        0x2000091c:    1c40        @.      ADDS     r0,r0,#1
        0x2000091e:    b200        ..      SXTH     r0,r0
        0x20000920:    8130        0.      STRH     r0,[r6,#8]
        0x20000922:    2832        2(      CMP      r0,#0x32
        0x20000924:    dd07        ..      BLE      0x20000936 ; foc_loop_isr + 1246
        0x20000926:    498a        .I      LDR      r1,[pc,#552] ; [0x20000b50] = 0x55f0
        0x20000928:    4348        HC      MULS     r0,r1,r0
        0x2000092a:    6ce9        .l      LDR      r1,[r5,#0x4c]
        0x2000092c:    f000fa88    ....    BL       $Ven$TT$L$$__aeabi_uidivmod ; 0x20000e40
        0x20000930:    80b0        ..      STRH     r0,[r6,#4]
        0x20000932:    64ef        .d      STR      r7,[r5,#0x4c]
        0x20000934:    8137        7.      STRH     r7,[r6,#8]
        0x20000936:    2001        .       MOVS     r0,#1
        0x20000938:    80f0        ..      STRH     r0,[r6,#6]
        0x2000093a:    64af        .d      STR      r7,[r5,#0x48]
        0x2000093c:    4885        .H      LDR      r0,[pc,#532] ; [0x20000b54] = 0x20000f20
        0x2000093e:    6cc1        .l      LDR      r1,[r0,#0x4c]
        0x20000940:    1c49        I.      ADDS     r1,r1,#1
        0x20000942:    64c1        .d      STR      r1,[r0,#0x4c]
        0x20000944:    4984        .I      LDR      r1,[pc,#528] ; [0x20000b58] = 0x20000fa0
        0x20000946:    69c8        .i      LDR      r0,[r1,#0x1c]
        0x20000948:    1c40        @.      ADDS     r0,r0,#1
        0x2000094a:    61c8        .a      STR      r0,[r1,#0x1c]
        0x2000094c:    698a        .i      LDR      r2,[r1,#0x18]
        0x2000094e:    4290        .B      CMP      r0,r2
        0x20000950:    dd11        ..      BLE      0x20000976 ; foc_loop_isr + 1310
        0x20000952:    61cf        .a      STR      r7,[r1,#0x1c]
        0x20000954:    4881        .H      LDR      r0,[pc,#516] ; [0x20000b5c] = 0x20000ea0
        0x20000956:    79c1        .y      LDRB     r1,[r0,#7]
        0x20000958:    2900        .)      CMP      r1,#0
        0x2000095a:    d006        ..      BEQ      0x2000096a ; foc_loop_isr + 1298
        0x2000095c:    71c7        .q      STRB     r7,[r0,#7]
        0x2000095e:    8961        a.      LDRH     r1,[r4,#0xa]
        0x20000960:    89e0        ..      LDRH     r0,[r4,#0xe]
        0x20000962:    1808        ..      ADDS     r0,r1,r0
        0x20000964:    4240        @B      RSBS     r0,r0,#0
        0x20000966:    81a0        ..      STRH     r0,[r4,#0xc]
        0x20000968:    e005        ..      B        0x20000976 ; foc_loop_isr + 1310
        0x2000096a:    2101        .!      MOVS     r1,#1
        0x2000096c:    71c1        .q      STRB     r1,[r0,#7]
        0x2000096e:    8961        a.      LDRH     r1,[r4,#0xa]
        0x20000970:    89e0        ..      LDRH     r0,[r4,#0xe]
        0x20000972:    1808        ..      ADDS     r0,r1,r0
        0x20000974:    81a0        ..      STRH     r0,[r4,#0xc]
        0x20000976:    4d79        yM      LDR      r5,[pc,#484] ; [0x20000b5c] = 0x20000ea0
        0x20000978:    79a8        .y      LDRB     r0,[r5,#6]
        0x2000097a:    2800        .(      CMP      r0,#0
        0x2000097c:    d000        ..      BEQ      0x20000980 ; foc_loop_isr + 1320
        0x2000097e:    81a7        ..      STRH     r7,[r4,#0xc]
        0x20000980:    7a28        (z      LDRB     r0,[r5,#8]
        0x20000982:    2800        .(      CMP      r0,#0
        0x20000984:    d010        ..      BEQ      0x200009a8 ; foc_loop_isr + 1360
        0x20000986:    4873        sH      LDR      r0,[pc,#460] ; [0x20000b54] = 0x20000f20
        0x20000988:    4a75        uJ      LDR      r2,[pc,#468] ; [0x20000b60] = 0xffffde7d
        0x2000098a:    6a01        .j      LDR      r1,[r0,#0x20]
        0x2000098c:    188a        ..      ADDS     r2,r1,r2
        0x2000098e:    4975        uI      LDR      r1,[pc,#468] ; [0x20000b64] = 0xc90f
        0x20000990:    428a        .B      CMP      r2,r1
        0x20000992:    d203        ..      BCS      0x2000099c ; foc_loop_isr + 1348
        0x20000994:    84af        ..      STRH     r7,[r5,#0x24]
        0x20000996:    4974        tI      LDR      r1,[pc,#464] ; [0x20000b68] = 0x2ccc
        0x20000998:    84e9        ..      STRH     r1,[r5,#0x26]
        0x2000099a:    e002        ..      B        0x200009a2 ; foc_loop_isr + 1354
        0x2000099c:    84af        ..      STRH     r7,[r5,#0x24]
        0x2000099e:    4973        sI      LDR      r1,[pc,#460] ; [0x20000b6c] = 0xffffd334
        0x200009a0:    84e9        ..      STRH     r1,[r5,#0x26]
        0x200009a2:    6b01        .k      LDR      r1,[r0,#0x30]
        0x200009a4:    6081        .`      STR      r1,[r0,#8]
        0x200009a6:    e00a        ..      B        0x200009be ; foc_loop_isr + 1382
        0x200009a8:    84af        ..      STRH     r7,[r5,#0x24]
        0x200009aa:    8d68        h.      LDRH     r0,[r5,#0x2a]
        0x200009ac:    8c69        i.      LDRH     r1,[r5,#0x22]
        0x200009ae:    1a40        @.      SUBS     r0,r0,r1
        0x200009b0:    b201        ..      SXTH     r1,r0
        0x200009b2:    486f        oH      LDR      r0,[pc,#444] ; [0x20000b70] = 0x20001040
        0x200009b4:    f000f942    ..B.    BL       ser_pi_controller ; 0x20000c3c
        0x200009b8:    89a1        ..      LDRH     r1,[r4,#0xc]
        0x200009ba:    1840        @.      ADDS     r0,r0,r1
        0x200009bc:    84e8        ..      STRH     r0,[r5,#0x26]
        0x200009be:    4865        eH      LDR      r0,[pc,#404] ; [0x20000b54] = 0x20000f20
        0x200009c0:    6b01        .k      LDR      r1,[r0,#0x30]
        0x200009c2:    6081        .`      STR      r1,[r0,#8]
        0x200009c4:    486b        kH      LDR      r0,[pc,#428] ; [0x20000b74] = 0x6487
        0x200009c6:    4281        .B      CMP      r1,r0
        0x200009c8:    da03        ..      BGE      0x200009d2 ; foc_loop_isr + 1402
        0x200009ca:    8729        ).      STRH     r1,[r5,#0x38]
        0x200009cc:    2001        .       MOVS     r0,#1
        0x200009ce:    2101        .!      MOVS     r1,#1
        0x200009d0:    e017        ..      B        0x20000a02 ; foc_loop_isr + 1450
        0x200009d2:    4b64        dK      LDR      r3,[pc,#400] ; [0x20000b64] = 0xc90f
        0x200009d4:    2200        ."      MOVS     r2,#0
        0x200009d6:    43d2        .C      MVNS     r2,r2
        0x200009d8:    4299        .B      CMP      r1,r3
        0x200009da:    da04        ..      BGE      0x200009e6 ; foc_loop_isr + 1422
        0x200009dc:    1a58        X.      SUBS     r0,r3,r1
        0x200009de:    8728        (.      STRH     r0,[r5,#0x38]
        0x200009e0:    2001        .       MOVS     r0,#1
        0x200009e2:    4611        .F      MOV      r1,r2
        0x200009e4:    e00d        ..      B        0x20000a02 ; foc_loop_isr + 1450
        0x200009e6:    4864        dH      LDR      r0,[pc,#400] ; [0x20000b78] = 0x12d97
        0x200009e8:    4281        .B      CMP      r1,r0
        0x200009ea:    da05        ..      BGE      0x200009f8 ; foc_loop_isr + 1440
        0x200009ec:    4863        cH      LDR      r0,[pc,#396] ; [0x20000b7c] = 0xffff36f1
        0x200009ee:    1808        ..      ADDS     r0,r1,r0
        0x200009f0:    8728        (.      STRH     r0,[r5,#0x38]
        0x200009f2:    4610        .F      MOV      r0,r2
        0x200009f4:    4601        .F      MOV      r1,r0
        0x200009f6:    e004        ..      B        0x20000a02 ; foc_loop_isr + 1450
        0x200009f8:    4861        aH      LDR      r0,[pc,#388] ; [0x20000b80] = 0x1921f
        0x200009fa:    1a40        @.      SUBS     r0,r0,r1
        0x200009fc:    8728        (.      STRH     r0,[r5,#0x38]
        0x200009fe:    4610        .F      MOV      r0,r2
        0x20000a00:    2101        .!      MOVS     r1,#1
        0x20000a02:    2338        8#      MOVS     r3,#0x38
        0x20000a04:    5eeb        .^      LDRSH    r3,[r5,r3]
        0x20000a06:    4c5f        _L      LDR      r4,[pc,#380] ; [0x20000b84] = 0x40003000
        0x20000a08:    6063        c`      STR      r3,[r4,#4]
        0x20000a0a:    2709        .'      MOVS     r7,#9
        0x20000a0c:    6027        '`      STR      r7,[r4,#0]
        0x20000a0e:    68e2        .h      LDR      r2,[r4,#0xc]
        0x20000a10:    03d2        ..      LSLS     r2,r2,#15
        0x20000a12:    0fd2        ..      LSRS     r2,r2,#31
        0x20000a14:    2a00        .*      CMP      r2,#0
        0x20000a16:    d0fa        ..      BEQ      0x20000a0e ; foc_loop_isr + 1462
        0x20000a18:    68e2        .h      LDR      r2,[r4,#0xc]
        0x20000a1a:    b212        ..      SXTH     r2,r2
        0x20000a1c:    6063        c`      STR      r3,[r4,#4]
        0x20000a1e:    6027        '`      STR      r7,[r4,#0]
        0x20000a20:    68a3        .h      LDR      r3,[r4,#8]
        0x20000a22:    03db        ..      LSLS     r3,r3,#15
        0x20000a24:    0fdb        ..      LSRS     r3,r3,#31
        0x20000a26:    2b00        .+      CMP      r3,#0
        0x20000a28:    d0fa        ..      BEQ      0x20000a20 ; foc_loop_isr + 1480
        0x20000a2a:    68a3        .h      LDR      r3,[r4,#8]
        0x20000a2c:    b21b        ..      SXTH     r3,r3
        0x20000a2e:    2800        .(      CMP      r0,#0
        0x20000a30:    dd01        ..      BLE      0x20000a36 ; foc_loop_isr + 1502
        0x20000a32:    0050        P.      LSLS     r0,r2,#1
        0x20000a34:    e001        ..      B        0x20000a3a ; foc_loop_isr + 1506
        0x20000a36:    0050        P.      LSLS     r0,r2,#1
        0x20000a38:    4240        @B      RSBS     r0,r0,#0
        0x20000a3a:    86a8        ..      STRH     r0,[r5,#0x34]
        0x20000a3c:    2900        .)      CMP      r1,#0
        0x20000a3e:    dd01        ..      BLE      0x20000a44 ; foc_loop_isr + 1516
        0x20000a40:    0058        X.      LSLS     r0,r3,#1
        0x20000a42:    e001        ..      B        0x20000a48 ; foc_loop_isr + 1520
        0x20000a44:    0058        X.      LSLS     r0,r3,#1
        0x20000a46:    4240        @B      RSBS     r0,r0,#0
        0x20000a48:    86e8        ..      STRH     r0,[r5,#0x36]
        0x20000a4a:    4b4f        OK      LDR      r3,[pc,#316] ; [0x20000b88] = 0x20000ebe
        0x20000a4c:    4a4f        OJ      LDR      r2,[pc,#316] ; [0x20000b8c] = 0x20000ebc
        0x20000a4e:    4950        PI      LDR      r1,[pc,#320] ; [0x20000b90] = 0x20000ec6
        0x20000a50:    4850        PH      LDR      r0,[pc,#320] ; [0x20000b94] = 0x20000ec4
        0x20000a52:    f7fffc9a    ....    BL       Udq_2_Uab ; 0x2000038a
        0x20000a56:    7828        (x      LDRB     r0,[r5,#0]
        0x20000a58:    2800        .(      CMP      r0,#0
        0x20000a5a:    d018        ..      BEQ      0x20000a8e ; foc_loop_isr + 1590
        0x20000a5c:    211e        .!      MOVS     r1,#0x1e
        0x20000a5e:    201c        .       MOVS     r0,#0x1c
        0x20000a60:    5e69        i^      LDRSH    r1,[r5,r1]
        0x20000a62:    5e28        (^      LDRSH    r0,[r5,r0]
        0x20000a64:    f7fffadc    ....    BL       foc_svm_gen ; 0x20000020
        0x20000a68:    484b        KH      LDR      r0,[pc,#300] ; [0x20000b98] = 0x40046080
        0x20000a6a:    89b1        ..      LDRH     r1,[r6,#0xc]
        0x20000a6c:    6241        Ab      STR      r1,[r0,#0x24]
        0x20000a6e:    8a71        q.      LDRH     r1,[r6,#0x12]
        0x20000a70:    6341        Ac      STR      r1,[r0,#0x34]
        0x20000a72:    89f1        ..      LDRH     r1,[r6,#0xe]
        0x20000a74:    6281        .b      STR      r1,[r0,#0x28]
        0x20000a76:    8ab1        ..      LDRH     r1,[r6,#0x14]
        0x20000a78:    6381        .c      STR      r1,[r0,#0x38]
        0x20000a7a:    4848        HH      LDR      r0,[pc,#288] ; [0x20000b9c] = 0x40046000
        0x20000a7c:    8a31        1.      LDRH     r1,[r6,#0x10]
        0x20000a7e:    6241        Ab      STR      r1,[r0,#0x24]
        0x20000a80:    8af1        ..      LDRH     r1,[r6,#0x16]
        0x20000a82:    6341        Ac      STR      r1,[r0,#0x34]
        0x20000a84:    4946        FI      LDR      r1,[pc,#280] ; [0x20000ba0] = 0x40040800
        0x20000a86:    6808        .h      LDR      r0,[r1,#0]
        0x20000a88:    14ca        ..      ASRS     r2,r1,#19
        0x20000a8a:    4390        .C      BICS     r0,r0,r2
        0x20000a8c:    6008        .`      STR      r0,[r1,#0]
        0x20000a8e:    b005        ..      ADD      sp,sp,#0x14
        0x20000a90:    bdf0        ..      POP      {r4-r7,pc}
    current_bandwith_test
        0x20000a92:    b538        8.      PUSH     {r3-r5,lr}
        0x20000a94:    2004        .       MOVS     r0,#4
        0x20000a96:    f000f9d9    ....    BL       $Ven$TT$L$$foc_set_ctrl_mode ; 0x20000e4c
        0x20000a9a:    4c30        0L      LDR      r4,[pc,#192] ; [0x20000b5c] = 0x20000ea0
        0x20000a9c:    4941        AI      LDR      r1,[pc,#260] ; [0x20000ba4] = 0x1247
        0x20000a9e:    6fa0        .o      LDR      r0,[r4,#0x78]
        0x20000aa0:    1840        @.      ADDS     r0,r0,r1
        0x20000aa2:    67a0        .g      STR      r0,[r4,#0x78]
        0x20000aa4:    4936        6I      LDR      r1,[pc,#216] ; [0x20000b80] = 0x1921f
        0x20000aa6:    2800        .(      CMP      r0,#0
        0x20000aa8:    da01        ..      BGE      0x20000aae ; current_bandwith_test + 28
        0x20000aaa:    1840        @.      ADDS     r0,r0,r1
        0x20000aac:    67a0        .g      STR      r0,[r4,#0x78]
        0x20000aae:    6fa0        .o      LDR      r0,[r4,#0x78]
        0x20000ab0:    4288        .B      CMP      r0,r1
        0x20000ab2:    dd02        ..      BLE      0x20000aba ; current_bandwith_test + 40
        0x20000ab4:    493c        <I      LDR      r1,[pc,#240] ; [0x20000ba8] = 0xfffe6de1
        0x20000ab6:    1840        @.      ADDS     r0,r0,r1
        0x20000ab8:    67a0        .g      STR      r0,[r4,#0x78]
        0x20000aba:    4669        iF      MOV      r1,sp
        0x20000abc:    6fa0        .o      LDR      r0,[r4,#0x78]
        0x20000abe:    f000f926    ..&.    BL       theta_to_sin ; 0x20000d0e
        0x20000ac2:    4669        iF      MOV      r1,sp
        0x20000ac4:    2000        .       MOVS     r0,#0
        0x20000ac6:    5e08        .^      LDRSH    r0,[r1,r0]
        0x20000ac8:    4938        8I      LDR      r1,[pc,#224] ; [0x20000bac] = 0x666
        0x20000aca:    4348        HC      MULS     r0,r1,r0
        0x20000acc:    13c0        ..      ASRS     r0,r0,#15
        0x20000ace:    81a0        ..      STRH     r0,[r4,#0xc]
        0x20000ad0:    bd38        8.      POP      {r3-r5,pc}
    anti_cogging_compesation_theta_to_idx
        0x20000ad2:    b510        ..      PUSH     {r4,lr}
        0x20000ad4:    b082        ..      SUB      sp,sp,#8
        0x20000ad6:    4927        'I      LDR      r1,[pc,#156] ; [0x20000b74] = 0x6487
        0x20000ad8:    4288        .B      CMP      r0,r1
        0x20000ada:    d202        ..      BCS      0x20000ae2 ; anti_cogging_compesation_theta_to_idx + 16
        0x20000adc:    2000        .       MOVS     r0,#0
        0x20000ade:    b002        ..      ADD      sp,sp,#8
        0x20000ae0:    bd10        ..      POP      {r4,pc}
        0x20000ae2:    4933        3I      LDR      r1,[pc,#204] ; [0x20000bb0] = 0xea91
        0x20000ae4:    24ff        .$      MOVS     r4,#0xff
        0x20000ae6:    34f4        .4      ADDS     r4,r4,#0xf4
        0x20000ae8:    4288        .B      CMP      r0,r1
        0x20000aea:    d902        ..      BLS      0x20000af2 ; anti_cogging_compesation_theta_to_idx + 32
        0x20000aec:    4620         F      MOV      r0,r4
        0x20000aee:    b002        ..      ADD      sp,sp,#8
        0x20000af0:    bd10        ..      POP      {r4,pc}
        0x20000af2:    4930        0I      LDR      r1,[pc,#192] ; [0x20000bb4] = 0xffff9b79
        0x20000af4:    1842        B.      ADDS     r2,r0,r1
        0x20000af6:    2144        D!      MOVS     r1,#0x44
        0x20000af8:    482f        /H      LDR      r0,[pc,#188] ; [0x20000bb8] = 0x40003800
        0x20000afa:    6102        .a      STR      r2,[r0,#0x10]
        0x20000afc:    6141        Aa      STR      r1,[r0,#0x14]
        0x20000afe:    2101        .!      MOVS     r1,#1
        0x20000b00:    6001        .`      STR      r1,[r0,#0]
        0x20000b02:    6841        Ah      LDR      r1,[r0,#4]
        0x20000b04:    0789        ..      LSLS     r1,r1,#30
        0x20000b06:    0fc9        ..      LSRS     r1,r1,#31
        0x20000b08:    2900        .)      CMP      r1,#0
        0x20000b0a:    d1fa        ..      BNE      0x20000b02 ; anti_cogging_compesation_theta_to_idx + 48
        0x20000b0c:    4669        iF      MOV      r1,sp
        0x20000b0e:    a801        ..      ADD      r0,sp,#4
        0x20000b10:    f000f98a    ....    BL       $Ven$TT$L$$DIV_SDiv_Result ; 0x20000e28
        0x20000b14:    9801        ..      LDR      r0,[sp,#4]
        0x20000b16:    b200        ..      SXTH     r0,r0
        0x20000b18:    21ff        .!      MOVS     r1,#0xff
        0x20000b1a:    31f5        .1      ADDS     r1,r1,#0xf5
        0x20000b1c:    4288        .B      CMP      r0,r1
        0x20000b1e:    dbe6        ..      BLT      0x20000aee ; anti_cogging_compesation_theta_to_idx + 28
        0x20000b20:    4620         F      MOV      r0,r4
        0x20000b22:    b002        ..      ADD      sp,sp,#8
        0x20000b24:    bd10        ..      POP      {r4,pc}
    anti_cogging_compesation
        0x20000b26:    b570        p.      PUSH     {r4-r6,lr}
        0x20000b28:    4616        .F      MOV      r6,r2
        0x20000b2a:    f7fffc4c    ..L.    BL       anti_cogging_compesation_theta_to_idx_round ; 0x200003c6
        0x20000b2e:    4d0b        .M      LDR      r5,[pc,#44] ; [0x20000b5c] = 0x20000ea0
        0x20000b30:    8168        h.      STRH     r0,[r5,#0xa]
        0x20000b32:    4c22        "L      LDR      r4,[pc,#136] ; [0x20000bbc] = 0x20000ee0
        0x20000b34:    2218        ."      MOVS     r2,#0x18
        0x20000b36:    20ff        .       MOVS     r0,#0xff
        0x20000b38:    5ea2        .^      LDRSH    r2,[r4,r2]
        0x20000b3a:    4631        1F      MOV      r1,r6
        0x20000b3c:    3048        H0      ADDS     r0,r0,#0x48
        0x20000b3e:    f000f8c5    ....    BL       LPFFunction ; 0x20000ccc
        0x20000b42:    8320         .      STRH     r0,[r4,#0x18]
        0x20000b44:    210a        .!      MOVS     r1,#0xa
        0x20000b46:    5e69        i^      LDRSH    r1,[r5,r1]
        0x20000b48:    4a1d        .J      LDR      r2,[pc,#116] ; [0x20000bc0] = 0x2000117c
        0x20000b4a:    0049        I.      LSLS     r1,r1,#1
        0x20000b4c:    5250        PR      STRH     r0,[r2,r1]
        0x20000b4e:    bd70        p.      POP      {r4-r6,pc}
    $d
        0x20000b50:    000055f0    .U..    DCD    22000
        0x20000b54:    20000f20     ..     DCD    536874784
        0x20000b58:    20000fa0    ...     DCD    536874912
        0x20000b5c:    20000ea0    ...     DCD    536874656
        0x20000b60:    ffffde7d    }...    DCD    4294958717
        0x20000b64:    0000c90f    ....    DCD    51471
        0x20000b68:    00002ccc    .,..    DCD    11468
        0x20000b6c:    ffffd334    4...    DCD    4294955828
        0x20000b70:    20001040    @..     DCD    536875072
        0x20000b74:    00006487    .d..    DCD    25735
        0x20000b78:    00012d97    .-..    DCD    77207
        0x20000b7c:    ffff36f1    .6..    DCD    4294915825
        0x20000b80:    0001921f    ....    DCD    102943
        0x20000b84:    40003000    .0.@    DCD    1073754112
        0x20000b88:    20000ebe    ...     DCD    536874686
        0x20000b8c:    20000ebc    ...     DCD    536874684
        0x20000b90:    20000ec6    ...     DCD    536874694
        0x20000b94:    20000ec4    ...     DCD    536874692
        0x20000b98:    40046080    .`.@    DCD    1074028672
        0x20000b9c:    40046000    .`.@    DCD    1074028544
        0x20000ba0:    40040800    ...@    DCD    1074006016
        0x20000ba4:    00001247    G...    DCD    4679
        0x20000ba8:    fffe6de1    .m..    DCD    4294864353
        0x20000bac:    00000666    f...    DCD    1638
        0x20000bb0:    0000ea91    ....    DCD    60049
        0x20000bb4:    ffff9b79    y...    DCD    4294941561
        0x20000bb8:    40003800    .8.@    DCD    1073756160
        0x20000bbc:    20000ee0    ...     DCD    536874720
        0x20000bc0:    2000117c    |..     DCD    536875388
    $t
    PlaceInRAM
    pi_controller
        0x20000bc4:    b470        p.      PUSH     {r4-r6}
        0x20000bc6:    2304        .#      MOVS     r3,#4
        0x20000bc8:    5ec3        .^      LDRSH    r3,[r0,r3]
        0x20000bca:    7f82        ..      LDRB     r2,[r0,#0x1e]
        0x20000bcc:    434b        KC      MULS     r3,r1,r3
        0x20000bce:    7806        .x      LDRB     r6,[r0,#0]
        0x20000bd0:    2402        .$      MOVS     r4,#2
        0x20000bd2:    251c        .%      MOVS     r5,#0x1c
        0x20000bd4:    4113        .A      ASRS     r3,r3,r2
        0x20000bd6:    5f04        ._      LDRSH    r4,[r0,r4]
        0x20000bd8:    5f45        E_      LDRSH    r5,[r0,r5]
        0x20000bda:    68c2        .h      LDR      r2,[r0,#0xc]
        0x20000bdc:    2e00        ..      CMP      r6,#0
        0x20000bde:    d00f        ..      BEQ      0x20000c00 ; pi_controller + 60
        0x20000be0:    434c        LC      MULS     r4,r1,r4
        0x20000be2:    412c        ,A      ASRS     r4,r4,r5
        0x20000be4:    6885        .h      LDR      r5,[r0,#8]
        0x20000be6:    195b        [.      ADDS     r3,r3,r5
        0x20000be8:    6083        .`      STR      r3,[r0,#8]
        0x20000bea:    4293        .B      CMP      r3,r2
        0x20000bec:    dd01        ..      BLE      0x20000bf2 ; pi_controller + 46
        0x20000bee:    6082        .`      STR      r2,[r0,#8]
        0x20000bf0:    e003        ..      B        0x20000bfa ; pi_controller + 54
        0x20000bf2:    6902        .i      LDR      r2,[r0,#0x10]
