747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
        0x20000bf4:    4293        .B      CMP      r3,r2
        0x20000bf6:    da00        ..      BGE      0x20000bfa ; pi_controller + 54
        0x20000bf8:    6082        .`      STR      r2,[r0,#8]
        0x20000bfa:    6882        .h      LDR      r2,[r0,#8]
        0x20000bfc:    1912        ..      ADDS     r2,r2,r4
        0x20000bfe:    e00f        ..      B        0x20000c20 ; pi_controller + 92
        0x20000c00:    2614        .&      MOVS     r6,#0x14
        0x20000c02:    5f86        ._      LDRSH    r6,[r0,r6]
        0x20000c04:    1b8e        ..      SUBS     r6,r1,r6
        0x20000c06:    4366        fC      MULS     r6,r4,r6
        0x20000c08:    412e        .A      ASRS     r6,r6,r5
        0x20000c0a:    6083        .`      STR      r3,[r0,#8]
        0x20000c0c:    4293        .B      CMP      r3,r2
        0x20000c0e:    dd01        ..      BLE      0x20000c14 ; pi_controller + 80
        0x20000c10:    6082        .`      STR      r2,[r0,#8]
        0x20000c12:    e003        ..      B        0x20000c1c ; pi_controller + 88
        0x20000c14:    6902        .i      LDR      r2,[r0,#0x10]
        0x20000c16:    4293        .B      CMP      r3,r2
        0x20000c18:    da00        ..      BGE      0x20000c1c ; pi_controller + 88
        0x20000c1a:    6082        .`      STR      r2,[r0,#8]
        0x20000c1c:    6882        .h      LDR      r2,[r0,#8]
        0x20000c1e:    1992        ..      ADDS     r2,r2,r6
        0x20000c20:    8281        ..      STRH     r1,[r0,#0x14]
        0x20000c22:    6a01        .j      LDR      r1,[r0,#0x20]
        0x20000c24:    4291        .B      CMP      r1,r2
        0x20000c26:    da01        ..      BGE      0x20000c2c ; pi_controller + 104
        0x20000c28:    460a        .F      MOV      r2,r1
        0x20000c2a:    e003        ..      B        0x20000c34 ; pi_controller + 112
        0x20000c2c:    6a41        Aj      LDR      r1,[r0,#0x24]
        0x20000c2e:    4291        .B      CMP      r1,r2
        0x20000c30:    dd00        ..      BLE      0x20000c34 ; pi_controller + 112
        0x20000c32:    460a        .F      MOV      r2,r1
        0x20000c34:    6182        .a      STR      r2,[r0,#0x18]
        0x20000c36:    bc70        p.      POP      {r4-r6}
        0x20000c38:    4610        .F      MOV      r0,r2
        0x20000c3a:    4770        pG      BX       lr
    ser_pi_controller
        0x20000c3c:    b430        0.      PUSH     {r4,r5}
        0x20000c3e:    6882        .h      LDR      r2,[r0,#8]
        0x20000c40:    2302        .#      MOVS     r3,#2
        0x20000c42:    5ec3        .^      LDRSH    r3,[r0,r3]
        0x20000c44:    1854        T.      ADDS     r4,r2,r1
        0x20000c46:    435c        \C      MULS     r4,r3,r4
        0x20000c48:    7f03        ..      LDRB     r3,[r0,#0x1c]
        0x20000c4a:    411c        .A      ASRS     r4,r4,r3
        0x20000c4c:    2304        .#      MOVS     r3,#4
        0x20000c4e:    5ec3        .^      LDRSH    r3,[r0,r3]
        0x20000c50:    7f85        ..      LDRB     r5,[r0,#0x1e]
        0x20000c52:    434b        KC      MULS     r3,r1,r3
        0x20000c54:    412b        +A      ASRS     r3,r3,r5
        0x20000c56:    189a        ..      ADDS     r2,r3,r2
        0x20000c58:    6082        .`      STR      r2,[r0,#8]
        0x20000c5a:    68c3        .h      LDR      r3,[r0,#0xc]
        0x20000c5c:    429a        .B      CMP      r2,r3
        0x20000c5e:    dd01        ..      BLE      0x20000c64 ; ser_pi_controller + 40
        0x20000c60:    6083        .`      STR      r3,[r0,#8]
        0x20000c62:    e003        ..      B        0x20000c6c ; ser_pi_controller + 48
        0x20000c64:    6903        .i      LDR      r3,[r0,#0x10]
        0x20000c66:    429a        .B      CMP      r2,r3
        0x20000c68:    da00        ..      BGE      0x20000c6c ; ser_pi_controller + 48
        0x20000c6a:    6083        .`      STR      r3,[r0,#8]
        0x20000c6c:    6882        .h      LDR      r2,[r0,#8]
        0x20000c6e:    1912        ..      ADDS     r2,r2,r4
        0x20000c70:    8281        ..      STRH     r1,[r0,#0x14]
        0x20000c72:    6a01        .j      LDR      r1,[r0,#0x20]
        0x20000c74:    4291        .B      CMP      r1,r2
        0x20000c76:    da01        ..      BGE      0x20000c7c ; ser_pi_controller + 64
        0x20000c78:    460a        .F      MOV      r2,r1
        0x20000c7a:    e003        ..      B        0x20000c84 ; ser_pi_controller + 72
        0x20000c7c:    6a41        Aj      LDR      r1,[r0,#0x24]
        0x20000c7e:    4291        .B      CMP      r1,r2
        0x20000c80:    dd00        ..      BLE      0x20000c84 ; ser_pi_controller + 72
        0x20000c82:    460a        .F      MOV      r2,r1
        0x20000c84:    6182        .a      STR      r2,[r0,#0x18]
        0x20000c86:    bc30        0.      POP      {r4,r5}
        0x20000c88:    4610        .F      MOV      r0,r2
        0x20000c8a:    4770        pG      BX       lr
    ser_anti_intergral_pi_controller
        0x20000c8c:    b430        0.      PUSH     {r4,r5}
        0x20000c8e:    2202        ."      MOVS     r2,#2
        0x20000c90:    6984        .i      LDR      r4,[r0,#0x18]
        0x20000c92:    5e82        .^      LDRSH    r2,[r0,r2]
        0x20000c94:    1863        c.      ADDS     r3,r4,r1
        0x20000c96:    435a        ZC      MULS     r2,r3,r2
        0x20000c98:    7f03        ..      LDRB     r3,[r0,#0x1c]
        0x20000c9a:    411a        .A      ASRS     r2,r2,r3
        0x20000c9c:    6a03        .j      LDR      r3,[r0,#0x20]
        0x20000c9e:    4293        .B      CMP      r3,r2
        0x20000ca0:    db03        ..      BLT      0x20000caa ; ser_anti_intergral_pi_controller + 30
        0x20000ca2:    6a43        Cj      LDR      r3,[r0,#0x24]
        0x20000ca4:    4293        .B      CMP      r3,r2
        0x20000ca6:    dc00        ..      BGT      0x20000caa ; ser_anti_intergral_pi_controller + 30
        0x20000ca8:    4613        .F      MOV      r3,r2
        0x20000caa:    2504        .%      MOVS     r5,#4
        0x20000cac:    5f45        E_      LDRSH    r5,[r0,r5]
        0x20000cae:    434d        MC      MULS     r5,r1,r5
        0x20000cb0:    7f81        ..      LDRB     r1,[r0,#0x1e]
        0x20000cb2:    410d        .A      ASRS     r5,r5,r1
        0x20000cb4:    1ad1        ..      SUBS     r1,r2,r3
        0x20000cb6:    4a04        .J      LDR      r2,[pc,#16] ; [0x20000cc8] = 0x7eb7
        0x20000cb8:    4351        QC      MULS     r1,r2,r1
        0x20000cba:    13c9        ..      ASRS     r1,r1,#15
        0x20000cbc:    1a69        i.      SUBS     r1,r5,r1
        0x20000cbe:    1909        ..      ADDS     r1,r1,r4
        0x20000cc0:    6181        .a      STR      r1,[r0,#0x18]
        0x20000cc2:    bc30        0.      POP      {r4,r5}
        0x20000cc4:    4618        .F      MOV      r0,r3
        0x20000cc6:    4770        pG      BX       lr
    $d
        0x20000cc8:    00007eb7    .~..    DCD    32439
    $t
    PlaceInRAM
    LPFFunction
        0x20000ccc:    1a89        ..      SUBS     r1,r1,r2
        0x20000cce:    4341        AC      MULS     r1,r0,r1
        0x20000cd0:    13c8        ..      ASRS     r0,r1,#15
        0x20000cd2:    1880        ..      ADDS     r0,r0,r2
        0x20000cd4:    b200        ..      SXTH     r0,r0
        0x20000cd6:    4770        pG      BX       lr
    LPFFunction_HR
        0x20000cd8:    1a89        ..      SUBS     r1,r1,r2
        0x20000cda:    4341        AC      MULS     r1,r0,r1
        0x20000cdc:    2000        .       MOVS     r0,#0
        0x20000cde:    5e18        .^      LDRSH    r0,[r3,r0]
        0x20000ce0:    1808        ..      ADDS     r0,r1,r0
        0x20000ce2:    4601        .F      MOV      r1,r0
        0x20000ce4:    8019        ..      STRH     r1,[r3,#0]
        0x20000ce6:    13c0        ..      ASRS     r0,r0,#15
        0x20000ce8:    1880        ..      ADDS     r0,r0,r2
        0x20000cea:    b200        ..      SXTH     r0,r0
        0x20000cec:    4770        pG      BX       lr
    LPFFunction_HR_2
        0x20000cee:    b410        ..      PUSH     {r4}
        0x20000cf0:    6813        .h      LDR      r3,[r2,#0]
        0x20000cf2:    13dc        ..      ASRS     r4,r3,#15
        0x20000cf4:    b224        $.      SXTH     r4,r4
        0x20000cf6:    1b09        ..      SUBS     r1,r1,r4
        0x20000cf8:    4341        AC      MULS     r1,r0,r1
        0x20000cfa:    1858        X.      ADDS     r0,r3,r1
        0x20000cfc:    6010        .`      STR      r0,[r2,#0]
        0x20000cfe:    bc10        ..      POP      {r4}
        0x20000d00:    4770        pG      BX       lr
    HPFFunction
        0x20000d02:    1889        ..      ADDS     r1,r1,r2
        0x20000d04:    1ac9        ..      SUBS     r1,r1,r3
        0x20000d06:    4341        AC      MULS     r1,r0,r1
        0x20000d08:    13c8        ..      ASRS     r0,r1,#15
        0x20000d0a:    b200        ..      SXTH     r0,r0
        0x20000d0c:    4770        pG      BX       lr
    theta_to_sin
        0x20000d0e:    b410        ..      PUSH     {r4}
        0x20000d10:    4a3e        >J      LDR      r2,[pc,#248] ; [0x20000e0c] = 0x6487
        0x20000d12:    4290        .B      CMP      r0,r2
        0x20000d14:    da03        ..      BGE      0x20000d1e ; theta_to_sin + 16
        0x20000d16:    b202        ..      SXTH     r2,r0
        0x20000d18:    2301        .#      MOVS     r3,#1
        0x20000d1a:    2001        .       MOVS     r0,#1
        0x20000d1c:    e015        ..      B        0x20000d4a ; theta_to_sin + 60
        0x20000d1e:    4a3c        <J      LDR      r2,[pc,#240] ; [0x20000e10] = 0xc90f
        0x20000d20:    4290        .B      CMP      r0,r2
        0x20000d22:    da04        ..      BGE      0x20000d2e ; theta_to_sin + 32
        0x20000d24:    1a10        ..      SUBS     r0,r2,r0
        0x20000d26:    b202        ..      SXTH     r2,r0
        0x20000d28:    2301        .#      MOVS     r3,#1
        0x20000d2a:    2002        .       MOVS     r0,#2
        0x20000d2c:    e00d        ..      B        0x20000d4a ; theta_to_sin + 60
        0x20000d2e:    4a39        9J      LDR      r2,[pc,#228] ; [0x20000e14] = 0x12d97
        0x20000d30:    2300        .#      MOVS     r3,#0
        0x20000d32:    43db        .C      MVNS     r3,r3
        0x20000d34:    4290        .B      CMP      r0,r2
        0x20000d36:    da04        ..      BGE      0x20000d42 ; theta_to_sin + 52
        0x20000d38:    4a37        7J      LDR      r2,[pc,#220] ; [0x20000e18] = 0xffff36f1
        0x20000d3a:    1880        ..      ADDS     r0,r0,r2
        0x20000d3c:    b202        ..      SXTH     r2,r0
        0x20000d3e:    2003        .       MOVS     r0,#3
        0x20000d40:    e003        ..      B        0x20000d4a ; theta_to_sin + 60
        0x20000d42:    4a36        6J      LDR      r2,[pc,#216] ; [0x20000e1c] = 0x1921f
        0x20000d44:    1a10        ..      SUBS     r0,r2,r0
        0x20000d46:    b202        ..      SXTH     r2,r0
        0x20000d48:    2004        .       MOVS     r0,#4
        0x20000d4a:    4c35        5L      LDR      r4,[pc,#212] ; [0x20000e20] = 0x40003000
        0x20000d4c:    6062        b`      STR      r2,[r4,#4]
        0x20000d4e:    2209        ."      MOVS     r2,#9
        0x20000d50:    6022        "`      STR      r2,[r4,#0]
        0x20000d52:    68e2        .h      LDR      r2,[r4,#0xc]
        0x20000d54:    03d2        ..      LSLS     r2,r2,#15
        0x20000d56:    0fd2        ..      LSRS     r2,r2,#31
        0x20000d58:    2a00        .*      CMP      r2,#0
        0x20000d5a:    d0fa        ..      BEQ      0x20000d52 ; theta_to_sin + 68
        0x20000d5c:    68e2        .h      LDR      r2,[r4,#0xc]
        0x20000d5e:    b212        ..      SXTH     r2,r2
        0x20000d60:    2b00        .+      CMP      r3,#0
        0x20000d62:    dc00        ..      BGT      0x20000d66 ; theta_to_sin + 88
        0x20000d64:    4252        RB      RSBS     r2,r2,#0
        0x20000d66:    800a        ..      STRH     r2,[r1,#0]
        0x20000d68:    bc10        ..      POP      {r4}
        0x20000d6a:    4770        pG      BX       lr
    theta_to_sin_and_cos
        0x20000d6c:    b4f0        ..      PUSH     {r4-r7}
        0x20000d6e:    4b27        'K      LDR      r3,[pc,#156] ; [0x20000e0c] = 0x6487
        0x20000d70:    4298        .B      CMP      r0,r3
        0x20000d72:    da03        ..      BGE      0x20000d7c ; theta_to_sin_and_cos + 16
        0x20000d74:    b200        ..      SXTH     r0,r0
        0x20000d76:    2301        .#      MOVS     r3,#1
        0x20000d78:    2401        .$      MOVS     r4,#1
        0x20000d7a:    e015        ..      B        0x20000da8 ; theta_to_sin_and_cos + 60
        0x20000d7c:    4d24        $M      LDR      r5,[pc,#144] ; [0x20000e10] = 0xc90f
        0x20000d7e:    2400        .$      MOVS     r4,#0
        0x20000d80:    43e4        .C      MVNS     r4,r4
        0x20000d82:    42a8        .B      CMP      r0,r5
        0x20000d84:    da03        ..      BGE      0x20000d8e ; theta_to_sin_and_cos + 34
        0x20000d86:    1a28        (.      SUBS     r0,r5,r0
        0x20000d88:    b200        ..      SXTH     r0,r0
        0x20000d8a:    2301        .#      MOVS     r3,#1
        0x20000d8c:    e00c        ..      B        0x20000da8 ; theta_to_sin_and_cos + 60
        0x20000d8e:    4b21        !K      LDR      r3,[pc,#132] ; [0x20000e14] = 0x12d97
        0x20000d90:    4298        .B      CMP      r0,r3
        0x20000d92:    da04        ..      BGE      0x20000d9e ; theta_to_sin_and_cos + 50
        0x20000d94:    4b20         K      LDR      r3,[pc,#128] ; [0x20000e18] = 0xffff36f1
        0x20000d96:    18c0        ..      ADDS     r0,r0,r3
        0x20000d98:    b200        ..      SXTH     r0,r0
        0x20000d9a:    4623        #F      MOV      r3,r4
        0x20000d9c:    e004        ..      B        0x20000da8 ; theta_to_sin_and_cos + 60
        0x20000d9e:    4b1f        .K      LDR      r3,[pc,#124] ; [0x20000e1c] = 0x1921f
        0x20000da0:    1a18        ..      SUBS     r0,r3,r0
        0x20000da2:    b200        ..      SXTH     r0,r0
        0x20000da4:    4623        #F      MOV      r3,r4
        0x20000da6:    2401        .$      MOVS     r4,#1
        0x20000da8:    4e1d        .N      LDR      r6,[pc,#116] ; [0x20000e20] = 0x40003000
        0x20000daa:    6070        p`      STR      r0,[r6,#4]
        0x20000dac:    2709        .'      MOVS     r7,#9
        0x20000dae:    6037        7`      STR      r7,[r6,#0]
        0x20000db0:    68f5        .h      LDR      r5,[r6,#0xc]
        0x20000db2:    03ed        ..      LSLS     r5,r5,#15
        0x20000db4:    0fed        ..      LSRS     r5,r5,#31
        0x20000db6:    2d00        .-      CMP      r5,#0
        0x20000db8:    d0fa        ..      BEQ      0x20000db0 ; theta_to_sin_and_cos + 68
        0x20000dba:    68f5        .h      LDR      r5,[r6,#0xc]
        0x20000dbc:    b22d        -.      SXTH     r5,r5
        0x20000dbe:    6070        p`      STR      r0,[r6,#4]
        0x20000dc0:    6037        7`      STR      r7,[r6,#0]
        0x20000dc2:    68b0        .h      LDR      r0,[r6,#8]
        0x20000dc4:    03c0        ..      LSLS     r0,r0,#15
        0x20000dc6:    0fc0        ..      LSRS     r0,r0,#31
        0x20000dc8:    2800        .(      CMP      r0,#0
        0x20000dca:    d0fa        ..      BEQ      0x20000dc2 ; theta_to_sin_and_cos + 86
        0x20000dcc:    68b0        .h      LDR      r0,[r6,#8]
        0x20000dce:    b200        ..      SXTH     r0,r0
        0x20000dd0:    2b00        .+      CMP      r3,#0
        0x20000dd2:    dd01        ..      BLE      0x20000dd8 ; theta_to_sin_and_cos + 108
        0x20000dd4:    006b        k.      LSLS     r3,r5,#1
        0x20000dd6:    e001        ..      B        0x20000ddc ; theta_to_sin_and_cos + 112
        0x20000dd8:    006b        k.      LSLS     r3,r5,#1
        0x20000dda:    425b        [B      RSBS     r3,r3,#0
        0x20000ddc:    800b        ..      STRH     r3,[r1,#0]
        0x20000dde:    2c00        .,      CMP      r4,#0
        0x20000de0:    dd01        ..      BLE      0x20000de6 ; theta_to_sin_and_cos + 122
        0x20000de2:    0040        @.      LSLS     r0,r0,#1
        0x20000de4:    e001        ..      B        0x20000dea ; theta_to_sin_and_cos + 126
        0x20000de6:    0040        @.      LSLS     r0,r0,#1
        0x20000de8:    4240        @B      RSBS     r0,r0,#0
        0x20000dea:    8010        ..      STRH     r0,[r2,#0]
        0x20000dec:    bcf0        ..      POP      {r4-r7}
        0x20000dee:    4770        pG      BX       lr
    theta_distance
        0x20000df0:    1a40        @.      SUBS     r0,r0,r1
        0x20000df2:    4907        .I      LDR      r1,[pc,#28] ; [0x20000e10] = 0xc90f
        0x20000df4:    4288        .B      CMP      r0,r1
        0x20000df6:    db02        ..      BLT      0x20000dfe ; theta_distance + 14
        0x20000df8:    490a        .I      LDR      r1,[pc,#40] ; [0x20000e24] = 0xfffe6de1
        0x20000dfa:    1840        @.      ADDS     r0,r0,r1
        0x20000dfc:    4770        pG      BX       lr
        0x20000dfe:    4906        .I      LDR      r1,[pc,#24] ; [0x20000e18] = 0xffff36f1
        0x20000e00:    4288        .B      CMP      r0,r1
        0x20000e02:    dcfb        ..      BGT      0x20000dfc ; theta_distance + 12
        0x20000e04:    4905        .I      LDR      r1,[pc,#20] ; [0x20000e1c] = 0x1921f
        0x20000e06:    1840        @.      ADDS     r0,r0,r1
        0x20000e08:    4770        pG      BX       lr
    $d
        0x20000e0a:    0000        ..      DCW    0
        0x20000e0c:    00006487    .d..    DCD    25735
        0x20000e10:    0000c90f    ....    DCD    51471
        0x20000e14:    00012d97    .-..    DCD    77207
        0x20000e18:    ffff36f1    .6..    DCD    4294915825
        0x20000e1c:    0001921f    ....    DCD    102943
        0x20000e20:    40003000    .0.@    DCD    1073754112
        0x20000e24:    fffe6de1    .m..    DCD    4294864353
    $t
    $Ven$TT$L$$DIV_SDiv_Result
        0x20000e28:    b403        ..      PUSH     {r0,r1}
        0x20000e2a:    4801        .H      LDR      r0,[pc,#4] ; [0x20000e30] = 0xbc1
        0x20000e2c:    9001        ..      STR      r0,[sp,#4]
        0x20000e2e:    bd01        ..      POP      {r0,pc}
    $d
        0x20000e30:    00000bc1    ....    DCD    3009
    $t
    $Ven$TT$L$$pll
        0x20000e34:    b403        ..      PUSH     {r0,r1}
        0x20000e36:    4801        .H      LDR      r0,[pc,#4] ; [0x20000e3c] = 0x28b9
        0x20000e38:    9001        ..      STR      r0,[sp,#4]
        0x20000e3a:    bd01        ..      POP      {r0,pc}
    $d
        0x20000e3c:    000028b9    .(..    DCD    10425
    $t
    $Ven$TT$L$$__aeabi_uidivmod
        0x20000e40:    b403        ..      PUSH     {r0,r1}
        0x20000e42:    4801        .H      LDR      r0,[pc,#4] ; [0x20000e48] = 0x135
        0x20000e44:    9001        ..      STR      r0,[sp,#4]
        0x20000e46:    bd01        ..      POP      {r0,pc}
    $d
        0x20000e48:    00000135    5...    DCD    309
    $t
    $Ven$TT$L$$foc_set_ctrl_mode
        0x20000e4c:    b403        ..      PUSH     {r0,r1}
        0x20000e4e:    4801        .H      LDR      r0,[pc,#4] ; [0x20000e54] = 0x2841
        0x20000e50:    9001        ..      STR      r0,[sp,#4]
        0x20000e52:    bd01        ..      POP      {r0,pc}
    $d
        0x20000e54:    00002841    A(..    DCD    10305

** Section #3 'RW_IRAM1' (SHT_PROGBITS) [SHF_ALLOC + SHF_WRITE]
    Size   : 168 bytes (alignment 4)
    Address: 0x20000e58


** Section #4 'RW_IRAM1' (SHT_NOBITS) [SHF_ALLOC + SHF_WRITE]
    Size   : 3044 bytes (alignment 8)
    Address: 0x2000117c


