747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
** Section #5 '.debug_abbrev' (SHT_PROGBITS)
    Size   : 1476 bytes


** Section #6 '.debug_frame' (SHT_PROGBITS)
    Size   : 3864 bytes


** Section #7 '.debug_info' (SHT_PROGBITS)
    Size   : 69804 bytes


** Section #8 '.debug_line' (SHT_PROGBITS)
    Size   : 20396 bytes


** Section #9 '.debug_loc' (SHT_PROGBITS)
    Size   : 7816 bytes


** Section #10 '.debug_macinfo' (SHT_PROGBITS)
    Size   : 149392 bytes


** Section #11 '.debug_pubnames' (SHT_PROGBITS)
    Size   : 6946 bytes


** Section #12 '.symtab' (SHT_SYMTAB)
    Size   : 13024 bytes (alignment 4)
    String table #13 '.strtab'
    Last local symbol no. 459


** Section #13 '.strtab' (SHT_STRTAB)
    Size   : 10808 bytes


** Section #14 '.note' (SHT_NOTE)
    Size   : 32 bytes (alignment 4)


** Section #15 '.comment' (SHT_PROGBITS)
    Size   : 40132 bytes


** Section #16 '.shstrtab' (SHT_STRTAB)
    Size   : 156 bytes


address     size       variable name                            type
0x20001170  0x4        CyclesPerUs                              uint32_t

address     size       variable name                            type
0x2000116c  0x4        SystemCoreClock                          uint32_t

address     size       variable name                            type
0x20001164  0x4        IAP_Flash_Erase                          IAP_Flash_Erase_t

address     size       variable name                            type
0x20001160  0x4        IAP_Flash_Param                          IAP_Flash_Param_t

address     size       variable name                            type
0x20001168  0x4        IAP_Flash_Write                          IAP_Flash_Write_t

address     size       variable name                            type
0x20001154  0x4        ADC3V6                                   uint32_t

address     size       variable name                            type
0x20001158  0x4        ADC_K                                    uint32_t

address     size       variable name                            type
0x2000115c  0x4        ADC_Offset                               uint32_t

address     size       variable name                            type
0x20001150  0x4        VDD3V3                                   uint32_t

address     size       variable name                            type
0x2000114c  0x4        VERSION_F                                uint32_t

address     size       variable name                            type
0x20001148  0x4        Debug_DAC2V                              uint32

address     size       variable name                            type
0x20001144  0x2        Debug_DAC_Offset                         int16

address     size       variable name                            type
0x200010e8  0x2        id_ref_ramp                              int16

address     size       variable name                            type
0x200010ea  0x2        iq_ref_ramp                              int16

address     size       variable name                            type
0x200010f4  0x2        mcChargeCnt                              uint16

address     size       variable name                            type
0x200010e7  0x1        mcChargeState                            mcChargeState_e

address     size       variable name                            type
0x2000194c  0x14       mcCtrl                                   mcControl_s
0x2000194c  0x1        mcCtrl.onOff                             uint8
0x2000194d  0x1        mcCtrl.dir                               mcDir_e
0x2000194e  0x1      * mcCtrl.ctrlMode                          mcCtrlMode_e
0x20001950  0x2        mcCtrl.id_set                            int16
0x20001952  0x2        mcCtrl.iq_set                            int16
0x20001954  0x2      * mcCtrl.speed_set                         int16
0x20001958  0x4        mcCtrl.pos_set                           int32
0x2000195c  0x2        mcCtrl.power_set                         int16

address     size       variable name                            type
0x200010e5  0x1        mcCurOffsetFlag                          uint8

address     size       variable name                            type
0x200010e6  0x1        mcCurOffsetState                         mcCurOffsetState_e

address     size       variable name                            type
0x200010ee  0x2        mcCurOffset_u                            int16

address     size       variable name                            type
0x200010f0  0x2        mcCurOffset_v                            int16

address     size       variable name                            type
0x200010f2  0x2        mcCurOffset_w                            int16

address     size       variable name                            type
0x200010e4  0x1        mcstate                                  mcState_e

address     size       variable name                            type
0x00000000  0x28       pos_pi                                   PIController
0x00000000  0x1      * pos_pi.pos_mode                          int8
0x00000002  0x2        pos_pi.Kp                                int16
0x00000004  0x2      * pos_pi.Ki                                int16
0x00000008  0x4        pos_pi.integral                          int32
0x0000000c  0x4        pos_pi.integral_max                      int32
0x00000010  0x4        pos_pi.integral_min                      int32
0x00000014  0x2      * pos_pi.LastErr                           int16
0x00000018  0x4        pos_pi.out                               int32
0x0000001c  0x2        pos_pi.KpDivisor                         int16
0x0000001e  0x2        pos_pi.KiDivisor                         int16
0x00000020  0x4        pos_pi.max_out_p                         int32
0x00000024  0x4        pos_pi.max_out_n                         int32

address     size       variable name                            type
0x200010f6  0x2        speed_loop_lpf                           int16

address     size       variable name                            type
0x2000111c  0x28       speed_pi                                 PIController
0x2000111c  0x1      * speed_pi.pos_mode                        int8
0x2000111e  0x2        speed_pi.Kp                              int16
0x20001120  0x2      * speed_pi.Ki                              int16
0x20001124  0x4        speed_pi.integral                        int32
0x20001128  0x4        speed_pi.integral_max                    int32
0x2000112c  0x4        speed_pi.integral_min                    int32
0x20001130  0x2      * speed_pi.LastErr                         int16
0x20001134  0x4        speed_pi.out                             int32
0x20001138  0x2        speed_pi.KpDivisor                       int16
0x2000113a  0x2        speed_pi.KiDivisor                       int16
0x2000113c  0x4        speed_pi.max_out_p                       int32
0x20001140  0x4        speed_pi.max_out_n                       int32

address     size       variable name                            type
0x00000000  0x4        speed_pi_loop_cnt                        u32

address     size       variable name                            type
0x200010ec  0x2        speed_ramp                               int16

address     size       variable name                            type
0x20001178  0x2        g_pll_sin                                int16

address     size       variable name                            type
0x20000eae  0x2        Ia                                       int16

address     size       variable name                            type
0x20000eb8  0x2        Ialpha                                   int16

address     size       variable name                            type
0x20000eb4  0x2        Ialpha_sp                                int16

address     size       variable name                            type
0x20000eb0  0x2        Ib                                       int16

address     size       variable name                            type
0x20000eba  0x2        Ibeta                                    int16

address     size       variable name                            type
0x20000eb6  0x2        Ibeta_sp                                 int16

address     size       variable name                            type
0x20000eb2  0x2        Ic                                       int16

address     size       variable name                            type
0x20000ec0  0x2        Id                                       int16

address     size       variable name                            type
0x20000ec2  0x2        Iq                                       int16

address     size       variable name                            type
0x20000ebc  0x2        Ualpha                                   int16

address     size       variable name                            type
0x20000ebe  0x2        Ubeta                                    int16

address     size       variable name                            type
0x20000ec4  0x2        Ud                                       int16

address     size       variable name                            type
0x00000000  0x2        Ud_out                                   int16

address     size       variable name                            type
0x00000000  0x2        Ud_ref                                   int16

address     size       variable name                            type
0x20000ec6  0x2        Uq                                       int16

address     size       variable name                            type
0x00000000  0x2        Uq_ref                                   int16

address     size       variable name                            type
0x20000f2c  0x4        __working_theta                          int32

address     size       variable name                            type
0x2000117c  0x7d0      anti_cogging_compesation_data            array[1000] of int16

address     size       variable name                            type
0x200010e1  0x1        anti_cogging_compesation_dir             int8

address     size       variable name                            type
0x200010e0  0x1        anti_cogging_compesation_flag            int8

address     size       variable name                            type
0x20000ef8  0x2        anti_cogging_compesation_iq              int16

address     size       variable name                            type
0x00000000  0x2        anti_cogging_compesation_iq_lpf          int16

address     size       variable name                            type
0x20000efa  0x2        anti_cogging_idx                         int16

address     size       variable name                            type
0x20000ed6  0x2        cos_of_theta                             int16

address     size       variable name                            type
0x20000ea0  0x1        ctrl_mode                                ctrl_mode_e

address     size       variable name                            type
0x20001068  0x28       id_pi                                    PIController
0x20001068  0x1      * id_pi.pos_mode                           int8
0x2000106a  0x2        id_pi.Kp                                 int16
0x2000106c  0x2      * id_pi.Ki                                 int16
0x20001070  0x4        id_pi.integral                           int32
0x20001074  0x4        id_pi.integral_max                       int32
0x20001078  0x4        id_pi.integral_min                       int32
0x2000107c  0x2      * id_pi.LastErr                            int16
0x20001080  0x4        id_pi.out                                int32
0x20001084  0x2        id_pi.KpDivisor                          int16
0x20001086  0x2        id_pi.KiDivisor                          int16
0x20001088  0x4        id_pi.max_out_p                          int32
0x2000108c  0x4        id_pi.max_out_n                          int32

address     size       variable name                            type
0x20000ec8  0x2        id_ref                                   int16

address     size       variable name                            type
0x20000eac  0x2        id_sin_ref                               int16

address     size       variable name                            type
0x20001040  0x28       iq_pi                                    PIController
0x20001040  0x1      * iq_pi.pos_mode                           int8
0x20001042  0x2        iq_pi.Kp                                 int16
0x20001044  0x2      * iq_pi.Ki                                 int16
0x20001048  0x4        iq_pi.integral                           int32
0x2000104c  0x4        iq_pi.integral_max                       int32
0x20001050  0x4        iq_pi.integral_min                       int32
0x20001054  0x2      * iq_pi.LastErr                            int16
0x20001058  0x4        iq_pi.out                                int32
0x2000105c  0x2        iq_pi.KpDivisor                          int16
0x2000105e  0x2        iq_pi.KiDivisor                          int16
0x20001060  0x4        iq_pi.max_out_p                          int32
0x20001064  0x4        iq_pi.max_out_n                          int32

address     size       variable name                            type
0x20000eca  0x2        iq_ref                                   int16

address     size       variable name                            type
0x20000ecc  0x2        lh0_raw                                  int16

address     size       variable name                            type
0x20000f38  0x4        lh0_raw_deep_lpf_hr                      int32

address     size       variable name                            type
0x00000000  0x2        lh0_raw_lpf                              int16

address     size       variable name                            type
0x20000f30  0x4        lh0_raw_lpf_hr                           int32

address     size       variable name                            type
0x20000ece  0x2        lh1_raw                                  int16

address     size       variable name                            type
0x20000f3c  0x4        lh1_raw_deep_lpf_hr                      int32

address     size       variable name                            type
0x00000000  0x2        lh1_raw_lpf                              int16

address     size       variable name                            type
0x20000f34  0x4        lh1_raw_lpf_hr                           int32

address     size       variable name                            type
0x20000f54  0x4        lh_e_speed_est                           int32

address     size       variable name                            type
0x00000000  0x4        lh_e_speed_est_lpf                       int32

address     size       variable name                            type
0x20000eda  0x2        lh_e_speed_fb                            int16

address     size       variable name                            type
0x20000edc  0x2        lh_e_speed_lpf_cofe                      int16

address     size       variable name                            type
0x20000f50  0x4        lh_e_theta                               int32

address     size       variable name                            type
0x20000f5c  0x4        lh_e_theta_deep                          int32

address     size       variable name                            type
0x20000f58  0x4        lh_e_theta_v                             int32

address     size       variable name                            type
0x20000f60  0x4        lh_e_theta_vibration                     int32

address     size       variable name                            type
0x20000f4c  0x4        lh_m_speed_deep_est                      int32

address     size       variable name                            type
0x20000f44  0x4        lh_m_speed_est                           int32

address     size       variable name                            type
0x00000000  0x4        lh_m_speed_vibration_est                 int32

address     size       variable name                            type
0x20000f40  0x4        lh_m_theta                               int32

address     size       variable name                            type
0x20000f48  0x4        lh_m_theta_deep                          int32

address     size       variable name                            type
0x20000f64  0x4        lh_m_theta_vibration                     int32

address     size       variable name                            type
0x20000ff0  0x28       lhp_swing_pll_deep_pi                    PIController
0x20000ff0  0x1      * lhp_swing_pll_deep_pi.pos_mode           int8
0x20000ff2  0x2        lhp_swing_pll_deep_pi.Kp                 int16
0x20000ff4  0x2      * lhp_swing_pll_deep_pi.Ki                 int16
0x20000ff8  0x4        lhp_swing_pll_deep_pi.integral           int32
0x20000ffc  0x4        lhp_swing_pll_deep_pi.integral_max       int32
0x20001000  0x4        lhp_swing_pll_deep_pi.integral_min       int32
0x20001004  0x2      * lhp_swing_pll_deep_pi.LastErr            int16
0x20001008  0x4        lhp_swing_pll_deep_pi.out                int32
0x2000100c  0x2        lhp_swing_pll_deep_pi.KpDivisor          int16
0x2000100e  0x2        lhp_swing_pll_deep_pi.KiDivisor          int16
0x20001010  0x4        lhp_swing_pll_deep_pi.max_out_p          int32
0x20001014  0x4        lhp_swing_pll_deep_pi.max_out_n          int32

address     size       variable name                            type
0x20000fc8  0x28       lhp_swing_pll_pi                         PIController
0x20000fc8  0x1      * lhp_swing_pll_pi.pos_mode                int8
0x20000fca  0x2        lhp_swing_pll_pi.Kp                      int16
0x20000fcc  0x2      * lhp_swing_pll_pi.Ki                      int16
0x20000fd0  0x4        lhp_swing_pll_pi.integral                int32
0x20000fd4  0x4        lhp_swing_pll_pi.integral_max            int32
0x20000fd8  0x4        lhp_swing_pll_pi.integral_min            int32
0x20000fdc  0x2      * lhp_swing_pll_pi.LastErr                 int16
0x20000fe0  0x4        lhp_swing_pll_pi.out                     int32
0x20000fe4  0x2        lhp_swing_pll_pi.KpDivisor               int16
0x20000fe6  0x2        lhp_swing_pll_pi.KiDivisor               int16
0x20000fe8  0x4        lhp_swing_pll_pi.max_out_p               int32
0x20000fec  0x4        lhp_swing_pll_pi.max_out_n               int32

address     size       variable name                            type
0x20001018  0x28       lhp_vibration_pll_pi                     PIController
0x20001018  0x1      * lhp_vibration_pll_pi.pos_mode            int8
0x2000101a  0x2        lhp_vibration_pll_pi.Kp                  int16
0x2000101c  0x2      * lhp_vibration_pll_pi.Ki                  int16
0x20001020  0x4        lhp_vibration_pll_pi.integral            int32
0x20001024  0x4        lhp_vibration_pll_pi.integral_max        int32
0x20001028  0x4        lhp_vibration_pll_pi.integral_min        int32
0x2000102c  0x2      * lhp_vibration_pll_pi.LastErr             int16
0x20001030  0x4        lhp_vibration_pll_pi.out                 int32
0x20001034  0x2        lhp_vibration_pll_pi.KpDivisor           int16
0x20001036  0x2        lhp_vibration_pll_pi.KiDivisor           int16
0x20001038  0x4        lhp_vibration_pll_pi.max_out_p           int32
0x2000103c  0x4        lhp_vibration_pll_pi.max_out_n           int32

address     size       variable name                            type
0x20000ede  0x2        lht_e_hpf_input                          int16

address     size       variable name                            type
0x20000ee2  0x2        lht_e_hpf_last_input                     int16

address     size       variable name                            type
0x20000ee0  0x2        lht_e_hpf_out                            int16

address     size       variable name                            type
0x00000000  0x4        m_theta_align_offset                     int32

address     size       variable name                            type
0x20000f10  0x4        over_module_cnt                          uint32_t

address     size       variable name                            type
0x20000f14  0x4        pos_close_test_theta                     int32

address     size       variable name                            type
0x00000000  0x2        setting_svm_alpha                        int16

address     size       variable name                            type
0x00000000  0x2        setting_svm_beta                         int16

address     size       variable name                            type
0x00000000  0x2        setting_svm_d                            int16

address     size       variable name                            type
0x00000000  0x2        setting_svm_q                            int16

address     size       variable name                            type
0x00000000  0x4        setting_theta                            u32

address     size       variable name                            type
0x20000ed4  0x2        sin_of_theta                             int16

address     size       variable name                            type
0x00000000  0x2        svm_duty                                 int16

address     size       variable name                            type
0x20000eea  0x2        svm_sector                               uint16_t

address     size       variable name                            type
0x20000ea5  0x1        swing_45_deg_delay_dir                   int8

address     size       variable name                            type
0x00000000  0x28       swing_anti_cogging_speed_pi              PIController
0x00000000  0x1      * swing_anti_cogging_speed_pi.pos_mode     int8
0x00000002  0x2        swing_anti_cogging_speed_pi.Kp           int16
0x00000004  0x2      * swing_anti_cogging_speed_pi.Ki           int16
0x00000008  0x4        swing_anti_cogging_speed_pi.integral     int32
0x0000000c  0x4        swing_anti_cogging_speed_pi.integral_max int32
0x00000010  0x4        swing_anti_cogging_speed_pi.integral_min int32
0x00000014  0x2      * swing_anti_cogging_speed_pi.LastErr      int16
0x00000018  0x4        swing_anti_cogging_speed_pi.out          int32
0x0000001c  0x2        swing_anti_cogging_speed_pi.KpDivisor    int16
0x0000001e  0x2        swing_anti_cogging_speed_pi.KiDivisor    int16
0x00000020  0x4        swing_anti_cogging_speed_pi.max_out_p    int32
0x00000024  0x4        swing_anti_cogging_speed_pi.max_out_n    int32

address     size       variable name                            type
0x00000000  0x28       swing_cmp_pi                             PIController
0x00000000  0x1      * swing_cmp_pi.pos_mode                    int8
0x00000002  0x2        swing_cmp_pi.Kp                          int16
0x00000004  0x2      * swing_cmp_pi.Ki                          int16
0x00000008  0x4        swing_cmp_pi.integral                    int32
0x0000000c  0x4        swing_cmp_pi.integral_max                int32
0x00000010  0x4        swing_cmp_pi.integral_min                int32
0x00000014  0x2      * swing_cmp_pi.LastErr                     int16
0x00000018  0x4        swing_cmp_pi.out                         int32
0x0000001c  0x2        swing_cmp_pi.KpDivisor                   int16
0x0000001e  0x2        swing_cmp_pi.KiDivisor                   int16
0x00000020  0x4        swing_cmp_pi.max_out_p                   int32
0x00000024  0x4        swing_cmp_pi.max_out_n                   int32

