747lulu747/SAOZHAN_BRUASH/src/backup/SEVOR_DEV - V0.0 - 21DD - 第二版电机 - 三角波扫动 - 双电阻/out/SWM21P.asm
address     size       variable name                            type
0x00000000  0x28       swing_cur_pi                             PIController
0x00000000  0x1      * swing_cur_pi.pos_mode                    int8
0x00000002  0x2        swing_cur_pi.Kp                          int16
0x00000004  0x2      * swing_cur_pi.Ki                          int16
0x00000008  0x4        swing_cur_pi.integral                    int32
0x0000000c  0x4        swing_cur_pi.integral_max                int32
0x00000010  0x4        swing_cur_pi.integral_min                int32
0x00000014  0x2      * swing_cur_pi.LastErr                     int16
0x00000018  0x4        swing_cur_pi.out                         int32
0x0000001c  0x2        swing_cur_pi.KpDivisor                   int16
0x0000001e  0x2        swing_cur_pi.KiDivisor                   int16
0x00000020  0x4        swing_cur_pi.max_out_p                   int32
0x00000024  0x4        swing_cur_pi.max_out_n                   int32

address     size       variable name                            type
0x20000ea3  0x1        swing_dir                                int8

address     size       variable name                            type
0x20000f70  0x4        swing_freq_set                           float

address     size       variable name                            type
0x20000efe  0x2        swing_freq_set_q15                       int16

address     size       variable name                            type
0x20000ed2  0x2        swing_lh_deep_lpf_cofe                   int16

address     size       variable name                            type
0x20000ed0  0x2        swing_lh_lpf_cofe                        int16

address     size       variable name                            type
0x20000f90  0x4        swing_open_down_compesation_cnt          int32

address     size       variable name                            type
0x20000f8c  0x4        swing_open_up_compesation_cnt            int32

address     size       variable name                            type
0x20000ea8  0x1        swing_out_rang                           int8

address     size       variable name                            type
0x20000ea4  0x1        swing_pi_clear                           int8

address     size       variable name                            type
0x20000f88  0x4        swing_pi_clear_cnt                       int32

address     size       variable name                            type
0x20001090  0x28       swing_pos_pi                             PIController
0x20001090  0x1      * swing_pos_pi.pos_mode                    int8
0x20001092  0x2        swing_pos_pi.Kp                          int16
0x20001094  0x2      * swing_pos_pi.Ki                          int16
0x20001098  0x4        swing_pos_pi.integral                    int32
0x2000109c  0x4        swing_pos_pi.integral_max                int32
0x200010a0  0x4        swing_pos_pi.integral_min                int32
0x200010a4  0x2      * swing_pos_pi.LastErr                     int16
0x200010a8  0x4        swing_pos_pi.out                         int32
0x200010ac  0x2        swing_pos_pi.KpDivisor                   int16
0x200010ae  0x2        swing_pos_pi.KiDivisor                   int16
0x200010b0  0x4        swing_pos_pi.max_out_p                   int32
0x200010b4  0x4        swing_pos_pi.max_out_n                   int32

address     size       variable name                            type
0x00000000  0x2        swing_q_out                              int16

address     size       variable name                            type
0x200010b8  0x28       swing_speed_pi                           PIController
0x200010b8  0x1      * swing_speed_pi.pos_mode                  int8
0x200010ba  0x2        swing_speed_pi.Kp                        int16
0x200010bc  0x2      * swing_speed_pi.Ki                        int16
0x200010c0  0x4        swing_speed_pi.integral                  int32
0x200010c4  0x4        swing_speed_pi.integral_max              int32
0x200010c8  0x4        swing_speed_pi.integral_min              int32
0x200010cc  0x2      * swing_speed_pi.LastErr                   int16
0x200010d0  0x4        swing_speed_pi.out                       int32
0x200010d4  0x2        swing_speed_pi.KpDivisor                 int16
0x200010d6  0x2        swing_speed_pi.KiDivisor                 int16
0x200010d8  0x4        swing_speed_pi.max_out_p                 int32
0x200010dc  0x4        swing_speed_pi.max_out_n                 int32

address     size       variable name                            type
0x20000f98  0x4        swing_theta                              int32

address     size       variable name                            type
0x00000000  0x4        swing_theta_45_deg_delay                 int32

address     size       variable name                            type
0x20000fa8  0x4        swing_theta_45_deg_delay_max             int32

address     size       variable name                            type
0x20000fac  0x4        swing_theta_45_deg_delay_min             int32

address     size       variable name                            type
0x00000000  0x2        swing_theta_45_deg_delay_sin             int16

address     size       variable name                            type
0x20000fa4  0x4        swing_theta_45_deg_delay_step            int32

address     size       variable name                            type
0x20000f74  0x4        swing_theta_amplite_set                  int32

address     size       variable name                            type
0x20000f00  0x2        swing_theta_cnt                          int16

address     size       variable name                            type
0x00000000  0x2        swing_theta_competation_out              int16

address     size       variable name                            type
0x20000f02  0x2        swing_theta_ctrl_q_lpf                   int16

address     size       variable name                            type
0x00000000  0x4        swing_theta_d_ampli_theta                int32

address     size       variable name                            type
0x20000efc  0x2        swing_theta_d_set                        int16

address     size       variable name                            type
0x00000000  0x2        swing_theta_d_step                       int16

address     size       variable name                            type
0x20000f04  0x2        swing_theta_err                          int16

address     size       variable name                            type
0x20000fb0  0x4        swing_theta_err_too_large_cnt            int32

address     size       variable name                            type
0x20000ea6  0x1        swing_theta_err_too_large_flag           int8

address     size       variable name                            type
0x00000000  0x2        swing_theta_ip_out                       int16

address     size       variable name                            type
0x20000f84  0x4        swing_theta_last_out                     int32

address     size       variable name                            type
0x20000f78  0x4        swing_theta_max                          int32

address     size       variable name                            type
0x20000f7c  0x4        swing_theta_min                          int32

address     size       variable name                            type
0x20000f08  0x2        swing_theta_open_compesation             int16

address     size       variable name                            type
0x20000f80  0x4        swing_theta_out                          int32

address     size       variable name                            type
0x20000f9c  0x4        swing_theta_out_45_deg_delay             int32

address     size       variable name                            type
0x20000fa0  0x4        swing_theta_out_45_deg_delay_707         int32

address     size       variable name                            type
0x00000000  0x1        swing_theta_phase_num                    int8

address     size       variable name                            type
0x00000000  0x2        swing_theta_sin                          int16

address     size       variable name                            type
0x00000000  0x2        swing_theta_sin_abs                      int16

address     size       variable name                            type
0x20000f06  0x2        swing_theta_speed_ref                    int16

address     size       variable name                            type
0x20000f94  0x4        swing_theta_step                         int32

address     size       variable name                            type
0x00000000  0x2        swing_theta_uq_ref                       int16

address     size       variable name                            type
0x20000eec  0x2        tAout                                    uint16_t

address     size       variable name                            type
0x20000eee  0x2        tBout                                    uint16_t

address     size       variable name                            type
0x20000ef0  0x2        tCout                                    uint16_t

address     size       variable name                            type
0x20000ef2  0x2        tFAout                                   uint16_t

address     size       variable name                            type
0x20000ef4  0x2        tFBout                                   uint16_t

address     size       variable name                            type
0x20000ef6  0x2        tFCout                                   uint16_t

address     size       variable name                            type
0x00000000  0x4        theta_delta                              uint32_t

address     size       variable name                            type
0x20000ed8  0x2        theta_phase                              int16

address     size       variable name                            type
0x00000000  0x2        vibration_duty_feaback                   int16

address     size       variable name                            type
0x20000ee4  0x2        vibration_freq                           int16

address     size       variable name                            type
0x20000ee6  0x2        vibration_freq_calc_phase                int16

address     size       variable name                            type
0x20000ee8  0x2        vibration_freq_count                     int16

address     size       variable name                            type
0x20000f6c  0x4        vibration_freq_tim_cnt                   int32

address     size       variable name                            type
0x20000f68  0x4        vibration_max_cnt                        int32

address     size       variable name                            type
0x00000000  0x28       vibration_pi                             PIController
0x00000000  0x1      * vibration_pi.pos_mode                    int8
0x00000002  0x2        vibration_pi.Kp                          int16
0x00000004  0x2      * vibration_pi.Ki                          int16
0x00000008  0x4        vibration_pi.integral                    int32
0x0000000c  0x4        vibration_pi.integral_max                int32
0x00000010  0x4        vibration_pi.integral_min                int32
0x00000014  0x2      * vibration_pi.LastErr                     int16
0x00000018  0x4        vibration_pi.out                         int32
0x0000001c  0x2        vibration_pi.KpDivisor                   int16
0x0000001e  0x2        vibration_pi.KiDivisor                   int16
0x00000020  0x4        vibration_pi.max_out_p                   int32
0x00000024  0x4        vibration_pi.max_out_n                   int32

address     size       variable name                            type
0x20000f0a  0x2        vibration_q_amplite_set                  int16

address     size       variable name                            type
0x20000ea7  0x1        vibration_q_dir                          int8

address     size       variable name                            type
0x00000000  0x4        vibration_q_dis_cnt                      int32

address     size       variable name                            type
0x20000fb4  0x4        vibration_q_freq_set                     int32

address     size       variable name                            type
0x20000f0c  0x2        vibration_q_out                          int16

address     size       variable name                            type
0x20000f0e  0x2        vibration_q_out_fb_cmp                   int16

address     size       variable name                            type
0x00000000  0x4        vibration_q_out_fb_tim                   int32

address     size       variable name                            type
0x00000000  0x4        vibration_q_sin                          int32

address     size       variable name                            type
0x20000fc4  0x4        vibration_q_step                         int32

address     size       variable name                            type
0x20000fc0  0x4        vibration_q_theta                        int32

address     size       variable name                            type
0x20000fb8  0x4        vibration_q_time                         int32

address     size       variable name                            type
0x20000fbc  0x4        vibration_q_time_cnt                     int32

address     size       variable name                            type
0x20000f28  0x4        working_theta                            int32

address     size       variable name                            type
0x20000f24  0x4        working_theta_align                      int32

address     size       variable name                            type
0x20000f1c  0x4        working_theta_align_cnt                  uint32_t

address     size       variable name                            type
0x20000ea2  0x1        working_theta_align_done                 uint8_t

address     size       variable name                            type
0x20000f20  0x4        working_theta_align_sum                  uint32_t

address     size       variable name                            type
0x20000e9c  0x4        user_delay_cnt                           volatile uint32_t

